
&Вместо("ПередЗаписьюСправочникаПередЗаписью")
Процедура Расш1_ПередЗаписьюСправочникаПередЗаписью(Источник, Отказ) Экспорт
	
	// Собираем параметры в массив
    ПараметрыМетода = Мокито.МассивПараметров(Источник, Отказ);

    // Отправляем данные на анализ
    ПрерватьВыполнение = Ложь;
    Результат = Мокито.АнализВызова(ПодпискиНаСобытия, "ПередЗаписьюСправочникаПередЗаписью", ПараметрыМетода, ПрерватьВыполнение);

    // Обрабатываем результат анализа
    Если НЕ ПрерватьВыполнение Тогда
        Возврат ПродолжитьВызов(Источник, Отказ);
    Иначе
        Возврат Результат;
    КонецЕсли;

КонецПроцедуры
