//©///////////////////////////////////////////////////////////////////////////©//
//
//  Copyright 2021-2022 BIA-Technologies Limited Liability Company
//
//  Licensed under the Apache License, Version 2.0 (the "License");
//  you may not use this file except in compliance with the License.
//  You may obtain a copy of the License at
//
//      http://www.apache.org/licenses/LICENSE-2.0
//
//  Unless required by applicable law or agreed to in writing, software
//  distributed under the License is distributed on an "AS IS" BASIS,
//  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//  See the License for the specific language governing permissions and
//  limitations under the License.
//
//©///////////////////////////////////////////////////////////////////////////©//

/////////////////////////////////////////////////////////////////////////////////
// Основной модуль для запуска тестирования
/////////////////////////////////////////////////////////////////////////////////
#Область ПрограммныйИнтерфейс

// Инициализировать
// 	Выполняет чтение и инициализацию параметров подсистемы тестирования
// Параметры:
//  ПараметрыЗапускаСтрокой - Строка - Строка запуска приложения
// 
// Возвращаемое значение:
//  Структура - Набор прочитанных параметров. См. ЮТПараметры.Параметры
Функция Инициализировать(Знач ПараметрыЗапускаСтрокой) Экспорт
	
	Возврат ЮТПараметры.ПараметрыЗапуска(ПараметрыЗапускаСтрокой);
	
КонецФункции

// ВыполнятьМодульноеТестирование
// 	Возвращает признак необходимости выполнять модульное тестирование
// Параметры:
//  Параметры - См. ЮТПараметры.Параметры
// 
// Возвращаемое значение:
//  Булево - Необходимость выполнения модульного тестирования
Функция ВыполнятьМодульноеТестирование(Параметры) Экспорт
	
	Возврат Параметры.ВыполнятьМодульноеТестирование;
	
КонецФункции

// ВыполнитьМодульноеТестирование
// 	Запускает выполнение модульного тестирования 
// 
// Параметры:
//  Параметры - См. ЮТПараметры.Параметры
Процедура ВыполнитьМодульноеТестирование(Параметры = Неопределено) Экспорт
	
	Если Параметры = Неопределено Тогда
		Параметры = ЮТ.Инициализировать(ПараметрЗапуска);
	КонецЕсли;
	
	Если НЕ ВыполнятьМодульноеТестирование(Параметры) Тогда
		Возврат;
	КонецЕсли;
	
	ЮТКонтекст.ИнициализироватьКонтекст();
	
	ЮТИсполнитель.ВыполнитьМодульноеТестирование(Параметры);
	
	Если Параметры.CloseAfterTests Тогда
		ПрекратитьРаботуСистемы(Ложь);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#КонецОбласти
