//©///////////////////////////////////////////////////////////////////////////©//
//
//  Copyright 2021-2023 BIA-Technologies Limited Liability Company
//
//  Licensed under the Apache License, Version 2.0 (the "License");
//  you may not use this file except in compliance with the License.
//  You may obtain a copy of the License at
//
//      http://www.apache.org/licenses/LICENSE-2.0
//
//  Unless required by applicable law or agreed to in writing, software
//  distributed under the License is distributed on an "AS IS" BASIS,
//  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//  See the License for the specific language governing permissions and
//  limitations under the License.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область СлужебныйПрограммныйИнтерфейс

Процедура ИсполняемыеСценарии() Экспорт
	
	Возврат; // TODO Реанимировать после реализации проброса доп параметров
	ЮТТесты
		// Добавление теста в тестовый набор по умолчанию с указанием представления теста
		.ДобавитьТест("ТестовыйМетод3", "Тестовый метод 3")
		// Добавление теста для клиента в тестовый набор по умолчанию
		.ДобавитьКлиентскийТест("ТестовыйМетод4")
		// Добавление теста для клиента в тестовый набор по умолчанию
		.ДобавитьСерверныйТест("ТестовыйМетод4")
		
		.ДобавитьТестовыйНабор("ТестовыйНабор")
			.ДобавитьТест("ТестовыйМетод")
			.ДобавитьТест("ТестовыйМетод2")
			.ДобавитьТест("ТестовыйМетод5", , "Тег1")
		// Создание тестового набора со списком тегов
		.ДобавитьТестовыйНабор("Тестовый набор 2", "Тег1, Тег2")
		// Добавление теста в созданный тестовый набор с указанием тегов, которые будут объединены с тегами набора
			.ДобавитьТест("ТестовыйМетод6", , "Тег5, Тег6");
	
	ВызватьИсключение "Ошибка загрузки сценариев";
	
КонецПроцедуры

#КонецОбласти
