//©///////////////////////////////////////////////////////////////////////////©//
//
//  Copyright 2021-2022 BIA-Technologies Limited Liability Company
//
//  Licensed under the Apache License, Version 2.0 (the "License");
//  you may not use this file except in compliance with the License.
//  You may obtain a copy of the License at
//
//      http://www.apache.org/licenses/LICENSE-2.0
//
//  Unless required by applicable law or agreed to in writing, software
//  distributed under the License is distributed on an "AS IS" BASIS,
//  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//  See the License for the specific language governing permissions and
//  limitations under the License.
//
//©///////////////////////////////////////////////////////////////////////////©//

/////////////////////////////////////////////////////////////////////////////////
// Экспортные процедуры и функции для служебного использования внутри подсистемы
///////////////////////////////////////////////////////////////////////////////// 

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает значение контекста
// 
// Параметры:
//  ИмяЗначения - Строка
// 
// Возвращаемое значение:
//  Произвольный
Функция Значение(ИмяЗначения) Экспорт
	
	Уровень = ЮТКонтекст.КонтекстИсполнения().Уровень;
	Уровни = ЮТФабрика.УровниИсполнения();
	
	Если Уровень = Уровни.Тест И ЮТКонтекст.КонтекстТеста().Свойство(ИмяЗначения) Тогда
		
		Возврат ЮТКонтекст.КонтекстТеста()[ИмяЗначения];
		
	ИначеЕсли (Уровень = Уровни.Тест ИЛИ Уровень = Уровни.НаборТестов) 
		И ЮТКонтекст.КонтекстНабора().Свойство(ИмяЗначения) Тогда
			
		Возврат ЮТКонтекст.КонтекстНабора()[ИмяЗначения];
		
	ИначеЕсли (Уровень = Уровни.Тест ИЛИ Уровень = Уровни.НаборТестов ИЛИ Уровень = Уровни.Модуль) 
		И ЮТКонтекст.КонтекстМодуля().Свойство(ИмяЗначения) Тогда
			
		Возврат ЮТКонтекст.КонтекстМодуля()[ИмяЗначения];
		
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли;
	
КонецФункции

// Установить значение.
//  Устанавливает значение в контекст тестов.
//  Установка происходит в соответствии с уровнем исполнения
// Параметры:
//  ИмяЗначения - Строка
//  Значение - Произвольный
Процедура УстановитьЗначение(ИмяЗначения, Значение) Экспорт
	
	Уровень = ЮТКонтекст.КонтекстИсполнения().Уровень;
	Уровни = ЮТФабрика.УровниИсполнения();
	
	Если Уровень = Уровни.Тест Тогда
		
		ЮТКонтекст.КонтекстТеста().Вставить(ИмяЗначения, Значение);
		
	ИначеЕсли Уровень = Уровни.НаборТестов Тогда
			
		ЮТКонтекст.КонтекстНабора().Вставить(ИмяЗначения, Значение);
		
	ИначеЕсли Уровень = Уровни.Модуль Тогда
			
		ЮТКонтекст.КонтекстМодуля().Вставить(ИмяЗначения, Значение);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

/////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции, составляющие внутреннюю реализацию модуля 
///////////////////////////////////////////////////////////////////////////////// 
#Область СлужебныеПроцедурыИФункции

#КонецОбласти
