//©///////////////////////////////////////////////////////////////////////////©//
//
//  Copyright 2021-2024 BIA-Technologies Limited Liability Company
//
//  Licensed under the Apache License, Version 2.0 (the "License");
//  you may not use this file except in compliance with the License.
//  You may obtain a copy of the License at
//
//      http://www.apache.org/licenses/LICENSE-2.0
//
//  Unless required by applicable law or agreed to in writing, software
//  distributed under the License is distributed on an "AS IS" BASIS,
//  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//  See the License for the specific language governing permissions and
//  limitations under the License.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область СлужебныйПрограммныйИнтерфейс

Процедура ИсполняемыеСценарии() Экспорт
	
	ЮТТесты
		.ДобавитьТест("ПараметрыГенерацииОтчета")
		.ДобавитьТест("ЗаписатьОтчет")
		.ДобавитьТест("ОписаниеТеста")
	;
	
КонецПроцедуры

Процедура ПараметрыГенерацииОтчета() Экспорт
	
	Параметры = ЮТОтчетAllureСлужебный.ПараметрыГенерацииОтчета();
	
	ЮТест.ОжидаетЧто(Параметры)
		.Свойство("Форматы")
			.ИмеетДлину(1)
			.ИмеетСвойство("allure");
	
КонецПроцедуры

Процедура ЗаписатьОтчет() Экспорт
	
	РезультатТестирования = ТестовыеДанные.РезультатТестирования();
	Каталог = ЮТест.Данные().НовоеИмяВременногоФайла();
	СоздатьКаталог(Каталог);
	Формат = ЮТОтчетAllureСлужебный.ПараметрыГенерацииОтчета().Форматы.allure;
	ЮТОтчетAllureСлужебный.ЗаписатьОтчет(РезультатТестирования, Каталог, Формат, Неопределено);
	
КонецПроцедуры

Процедура ОписаниеТеста() Экспорт
	
	Модуль = ТестовыеДанные.ОписаниеТестовогоМодуля();
	Набор = ТестовыеДанные.ОписаниеТестовогоНабора(Модуль);
	Тест = ТестовыеДанные.ОписаниеТеста(Набор);
	
	ОписаниеТеста = ЮТОтчетAllureСлужебный.ОписаниеТеста(Тест, Набор, Модуль);
	ЮТест.ОжидаетЧто(ОписаниеТеста)
		.ИмеетТип("Структура")
		.Заполнено()
	;
	
	ИмяТестовогоНабора = Модуль.МетаданныеМодуля.Имя;
	ИмяВложенногоНабора = СтрШаблон("%1 [%2]", Набор.Представление, Тест.Режим);
	СодержитМетку(ОписаниеТеста, "suite", ИмяТестовогоНабора);
	СодержитМетку(ОписаниеТеста, "subSuite", ИмяВложенногоНабора);
	
	Набор.Представление = Модуль.МетаданныеМодуля.Имя;
	ОписаниеТеста = ЮТОтчетAllureСлужебный.ОписаниеТеста(Тест, Набор, Модуль);
	СодержитМетку(ОписаниеТеста, "suite", ИмяТестовогоНабора);
	ЮТест.ОжидаетЧто(ОписаниеТеста)
		.Свойство("labels")
		.НеСодержит(ЮТест.Предикат()
			.Реквизит("name").Равно("subSuite"))
	;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СодержитМетку(ОписаниеТеста, ИмяМетки, ЗначениеМетки)
	ЮТест.ОжидаетЧто(ОписаниеТеста)
		.Свойство("labels")
		.Содержит(ЮТест.Предикат()
			.Реквизит("name").Равно(ИмяМетки)
			.Реквизит("value").Равно(ЗначениеМетки))
	;
КонецПроцедуры

#КонецОбласти
