//©///////////////////////////////////////////////////////////////////////////©//
//
//  Copyright 2021-2024 BIA-Technologies Limited Liability Company
//
//  Licensed under the Apache License, Version 2.0 (the "License");
//  you may not use this file except in compliance with the License.
//  You may obtain a copy of the License at
//
//      http://www.apache.org/licenses/LICENSE-2.0
//
//  Unless required by applicable law or agreed to in writing, software
//  distributed under the License is distributed on an "AS IS" BASIS,
//  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//  See the License for the specific language governing permissions and
//  limitations under the License.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область СлужебныйПрограммныйИнтерфейс

Процедура ИсполняемыеСценарии() Экспорт
	
	ЮТТесты
		.ДобавитьТест("ДобавитьПояснениеОшибки")
		.ДобавитьТест("ВыводЛогаИсполнения")
	;
	
КонецПроцедуры

Процедура ДобавитьПояснениеОшибки() Экспорт
	
	ЮТРегистрацияОшибок.ДобавитьПояснениеОшибки("Пояснение");
	
	Ошибка = ОшибкаВыполнения();
	ЮТест.ОжидаетЧто(Ошибка)
		.Заполнено()
		.Свойство("Сообщение")
			.Заполнено()
			.Содержит("Пояснение");
	
КонецПроцедуры

Процедура ВыводЛогаИсполнения() Экспорт
	
	ЮТест.ДобавитьСообщение("Сообщение 1");
	ЮТест.ДобавитьСообщение("Сообщение 2");
	ЮТест.ДобавитьПредупреждение("Предупреждение 1");
	
	Ошибка = ОшибкаВыполнения();
	
	ЮТест.ОжидаетЧто(Ошибка)
		.Заполнено()
		.Свойство("Лог")
			.Заполнено()
			.ИмеетДлину(3)
			.Содержит("[INF] Сообщение 1")
			.Содержит("[INF] Сообщение 2")
			.Содержит("[WRN] Предупреждение 1");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ИмяКонтекстаОшибки()
	
	Возврат "ДанныеОшибки";
	
КонецФункции

Функция ОшибкаВыполнения()
	
	Попытка
		//@skip-check module-unused-local-variable
		Результат = 1/0;
	Исключение
		Ошибка = ИнформацияОбОшибке();
	КонецПопытки;
	
	Тест = Новый Структура("Ошибки, ПолноеИмяМетода", Новый Массив(), "Тест");
	ЮТРегистрацияОшибокСлужебный.ЗарегистрироватьОшибкуВыполненияТеста(Тест, Ошибка);
	Возврат Тест.Ошибки[0];
	
КонецФункции

#КонецОбласти
