//©///////////////////////////////////////////////////////////////////////////©//
//
//  Copyright 2021-2025 BIA-Technologies Limited Liability Company
//
//  Licensed under the Apache License, Version 2.0 (the "License");
//  you may not use this file except in compliance with the License.
//  You may obtain a copy of the License at
//
//      http://www.apache.org/licenses/LICENSE-2.0
//
//  Unless required by applicable law or agreed to in writing, software
//  distributed under the License is distributed on an "AS IS" BASIS,
//  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//  See the License for the specific language governing permissions and
//  limitations under the License.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область СлужебныйПрограммныйИнтерфейс

Процедура ИсполняемыеСценарии() Экспорт
	
	ЮТТесты
		.ДобавитьТестовыйНабор("Локация")
			.ДобавитьТест("Город")
			.ДобавитьТест("Улица")
			.ДобавитьТест("Страна")
			.ДобавитьТест("Область")
			.ДобавитьТест("Индекс")
		.ДобавитьТестовыйНабор("Локализации")
			.ДобавитьТест("ГородСЛокализацией")
			.ДобавитьТест("УлицаСЛокализацией")
			.ДобавитьТест("СтранаСЛокализацией")
			.ДобавитьТест("ОбластьСЛокализацией")
			.ДобавитьТест("ИндексСЛокализацией")
			.После("СброситьЛокализацию");
	
КонецПроцедуры

Процедура Город() Экспорт
	
	Город = ЮТПодражатель_Локация.Город();
	ЮТест.ОжидаетЧто(Город)
		.ИмеетТип("Строка")
		.Заполнено();
	
	ЮТест.ОжидаетЧто(СтрДлина(Город))
		.Больше(1);
	
КонецПроцедуры

Процедура Улица() Экспорт
	
	Улица = ЮТПодражатель_Локация.Улица();
	ЮТест.ОжидаетЧто(Улица)
		.ИмеетТип("Строка")
		.Заполнено();
	
	ЮТест.ОжидаетЧто(СтрДлина(Улица))
		.Больше(1);
	
КонецПроцедуры

Процедура Страна() Экспорт
	
	Страна = ЮТПодражатель_Локация.Страна();
	ЮТест.ОжидаетЧто(Страна)
		.ИмеетТип("Строка")
		.Заполнено();
	
	ЮТест.ОжидаетЧто(СтрДлина(Страна))
		.Больше(1);
	
КонецПроцедуры

Процедура Область() Экспорт
	
	Область = ЮТПодражатель_Локация.Область();
	ЮТест.ОжидаетЧто(Область)
		.ИмеетТип("Строка")
		.Заполнено();
	
	ЮТест.ОжидаетЧто(СтрДлина(Область))
		.Больше(1);
	
КонецПроцедуры

Процедура Индекс() Экспорт
	
	Индекс = ЮТПодражатель_Локация.Индекс();
	ЮТест.ОжидаетЧто(Индекс)
		.ИмеетТип("Строка")
		.Заполнено();
	
	ЮТест.ОжидаетЧто(СтрДлина(Индекс))
		.Равно(6);
	
КонецПроцедуры

Процедура ГородСЛокализацией() Экспорт
	
	Подражатель = ЮТест.Данные().Подражатель();
	Подражатель.УстановитьЛокализацию("en");
	
	Город = ЮТПодражатель_Локация.Город();
	ЮТест.ОжидаетЧто(Город)
		.ИмеетТип("Строка")
		.Заполнено();
	
КонецПроцедуры

Процедура УлицаСЛокализацией() Экспорт
	
	Подражатель = ЮТест.Данные().Подражатель();
	Подражатель.УстановитьЛокализацию("en");
	
	Улица = ЮТПодражатель_Локация.Улица();
	ЮТест.ОжидаетЧто(Улица)
		.ИмеетТип("Строка")
		.Заполнено();
	
КонецПроцедуры

Процедура СтранаСЛокализацией() Экспорт
	
	Подражатель = ЮТест.Данные().Подражатель();
	Подражатель.УстановитьЛокализацию("en");
	
	Страна = ЮТПодражатель_Локация.Страна();
	ЮТест.ОжидаетЧто(Страна)
		.ИмеетТип("Строка")
		.Заполнено();
	
КонецПроцедуры

Процедура ОбластьСЛокализацией() Экспорт
	
	Подражатель = ЮТест.Данные().Подражатель();
	Подражатель.УстановитьЛокализацию("en");
	
	Область = ЮТПодражатель_Локация.Область();
	ЮТест.ОжидаетЧто(Область)
		.ИмеетТип("Строка")
		.Заполнено();
	
КонецПроцедуры

Процедура ИндексСЛокализацией() Экспорт
	
	Подражатель = ЮТест.Данные().Подражатель();
	Подражатель.УстановитьЛокализацию("en");
	
	Индекс = ЮТПодражатель_Локация.Индекс();
	ЮТест.ОжидаетЧто(Индекс)
		.ИмеетТип("Строка")
		.Заполнено();
	
	ЮТест.ОжидаетЧто(СтрДлина(Индекс))
		.Равно(5);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Процедура СброситьЛокализацию() Экспорт
	
	ЮТест.Данные().Подражатель().УстановитьЛокализацию("");
	
КонецПроцедуры

#КонецОбласти