
//////////////////////////////////////////////////////////////////////
// Обработчики команд

&НаКлиенте
Процедура Сохранить()
	
	РаботаСХранилищемОбщихНастроек.СохранитьРабочийКаталог(ПутьКРабочемуКаталогу);
	РаботаСХранилищемОбщихНастроек.СохранитьТекстКраткогоЗаголовкаПриложения(КраткийЗаголовок);
	Если КлиентскоеПриложение.ПолучитьКраткийЗаголовок() <> КраткийЗаголовок Тогда
		
		КлиентскоеПриложение.УстановитьКраткийЗаголовок(КраткийЗаголовок);
		
	КонецЕсли;
	
	Закрыть(Истина);
	
КонецПроцедуры

//////////////////////////////////////////////////////////////////////
// Обработчики событий формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПутьКРабочемуКаталогу = РаботаСХранилищемОбщихНастроек.ПолучитьРабочийКаталог();
	КраткийЗаголовок = РаботаСХранилищемОбщихНастроек.ПолучитьТекстКраткогоЗаголовкаПриложения();
	
КонецПроцедуры

//////////////////////////////////////////////////////////////////////
// Обработчики событий элементов управления

&НаКлиенте
Процедура ПутьКРабочемуКаталогуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОпПослеПодключенияРасширения = Новый ОписаниеОповещения("ПослеПодключенияРасширения", ЭтотОбъект);
	НачатьПодключениеРасширенияРаботыСФайлами(ОпПослеПодключенияРасширения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеПодключенияРасширения(Подключено, ДопПараметры) Экспорт
	Если НЕ Подключено Тогда
		
		ПоказатьПредупреждение( ,
			НСтр("ru ='Данная возможность недоступна, так как не подключено расширение работы с файлами.'", "ru"));
		
	КонецЕсли;

	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	ДиалогОткрытияФайла.Заголовок = НСтр("ru ='Выбор каталога временного хранения файлов'", "ru");
	ОпПослеВыбораКаталога = Новый ОписаниеОповещения("ПослеВыбораКаталога", ЭтотОбъект);
	ДиалогОткрытияФайла.Показать(ОпПослеВыбораКаталога);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораКаталога(ВыбранныеФайлы, ДопПараметры) Экспорт
	Если НЕ ВыбранныеФайлы=Неопределено Тогда
		ПутьКРабочемуКаталогу = ВыбранныеФайлы[0];
	КонецЕсли;  
КонецПроцедуры
