//©///////////////////////////////////////////////////////////////////////////©//
//
//  Copyright 2021-2025 BIA-Technologies Limited Liability Company
//
//  Licensed under the Apache License, Version 2.0 (the "License");
//  you may not use this file except in compliance with the License.
//  You may obtain a copy of the License at
//
//      http://www.apache.org/licenses/LICENSE-2.0
//
//  Unless required by applicable law or agreed to in writing, software
//  distributed under the License is distributed on an "AS IS" BASIS,
//  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//  See the License for the specific language governing permissions and
//  limitations under the License.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область ПрограммныйИнтерфейс

// Описание объекта метаданных.
// 
// Параметры:
//  Значение - ОбъектМетаданных
//           - Тип - Тип объекта информационной базы
//           - Строка - Полное имя объекта метаданных
//           - см. СтруктураОписанияОбъектаМетаданных
//           - Произвольный - Объект информационной базы
// 
// Возвращаемое значение:
//  см. СтруктураОписанияОбъектаМетаданных
Функция ОписаниеОбъектаМетаданных(Знач Значение) Экспорт
	
	Если ЮТМетаданныеСлужебныйКлиентСервер.ЭтоОписаниеОбъектаМетаданных(Значение) Тогда
		//@skip-check constructor-function-return-section
		Возврат Значение;
	КонецЕсли;
	
	ТипЗначения = ТипЗнч(Значение);
	
	ТипТип = Тип("Тип");
#Если Сервер Тогда
	Если ТипЗначения = Тип("ОбъектМетаданных") Тогда
		Значение = Значение.ПолноеИмя();
		ТипЗначения = Тип("Строка");
	КонецЕсли;
#КонецЕсли
	
	Если ТипЗначения <> ТипТип И ТипЗначения <> Тип("Строка") Тогда
		Значение = ТипЗнч(Значение);
		ТипЗначения = ТипТип;
	КонецЕсли;
	
	Если ТипЗначения = ТипТип Тогда
		ИдентификаторТипа = ЮТТипыДанныхСлужебный.ИдентификаторТипа(Значение); // Для работы кэширования
		//@skip-check constructor-function-return-section
		Возврат ЮТМетаданныеСлужебныйПовтИсп.ОписаниеОбъектаМетаданныхПоИдентификаторуТипа(ИдентификаторТипа);
	Иначе
		//@skip-check constructor-function-return-section
		Возврат ЮТМетаданныеСлужебныйПовтИсп.ОписаниеОбъектаМетаданных(Значение);
	КонецЕсли;
	
КонецФункции

// Возвращает список реквизитов и их типов
// 
// Параметры:
//  ТаблицаИнформационнойБазы - ОбъектМетаданных
//                            - Тип - Тип объекта информационной базы
//                            - Строка - Полное имя объекта метаданных, может включать имя табличной части
//                            - см. СтруктураОписанияОбъектаМетаданных
//                            - Произвольный - Объект информационной базы
//  ВСоответствие - Булево - Возвращать в виде соответстия, иначе структура
// 
// Возвращаемое значение:
//  Соответствие из ОписаниеТипов, Структура - Типы реквизитов. Ключ - Имя реквизита, Значение - его тип (ОписаниеТипов)
Функция ТипыРеквизитов(ТаблицаИнформационнойБазы, ВСоответствие = Ложь) Экспорт
	Перем ИмяТабличнойЧасти;
	
	Если ТипЗнч(ТаблицаИнформационнойБазы) = Тип("Строка") Тогда
		Части = СтрРазделить(ТаблицаИнформационнойБазы, ".");
		Если Части.Количество() = 3 Тогда
			ИмяОбъекта = СтрШаблон("%1.%2", Части[0], Части[1]);
			ИмяТабличнойЧасти = Части[2];
		ИначеЕсли Части.Количество() = 2 Тогда
			ИмяОбъекта = ТаблицаИнформационнойБазы;
		Иначе
			ВызватьИсключение "Некорректное имя таблицы (объекта метаданных) - " + ТаблицаИнформационнойБазы;
		КонецЕсли;
	Иначе
		ИмяОбъекта = ТаблицаИнформационнойБазы;
	КонецЕсли;
	
	ОписаниеОбъекта = ОписаниеОбъектаМетаданных(ИмяОбъекта);
	Если ИмяТабличнойЧасти <> Неопределено Тогда
		Реквизиты = ОписаниеОбъекта.ТабличныеЧасти[ИмяТабличнойЧасти];
	Иначе
		Реквизиты = ОписаниеОбъекта.Реквизиты;
	КонецЕсли;
	
	ТипыРеквизитов = ?(ВСоответствие, Новый Соответствие(), Новый Структура());
	
	Для Каждого Элемент Из Реквизиты Цикл
		ТипыРеквизитов.Вставить(Элемент.Ключ, Элемент.Значение.Тип);
	КонецЦикла;
	
	Возврат ТипыРеквизитов;
	
КонецФункции

// Возвращает нормализованное имя таблицы, то которое можно использовать в запросах
// 
// Параметры:
//  Значение - ОбъектМетаданных
//           - Тип - Тип объекта информационной базы
//           - Строка - Полное имя объекта метаданных
//           - см. СтруктураОписанияОбъектаМетаданных
//           - Произвольный - Объект информационной базы
// 
// Возвращаемое значение:
//  Строка - Нормализованное имя таблицы
Функция НормализованноеИмяТаблицы(Значение) Экспорт
	
	Описание = ОписаниеОбъектаМетаданных(Значение);
	
	Возврат СтрШаблон("%1.%2", Описание.ОписаниеТипа.Имя, Описание.Имя);
	
КонецФункции

// Проверка, что переданное значение относится к справочникам.
// 
// Параметры:
//  Значение - ОбъектМетаданных
//           - Тип - Тип объекта информационной базы
//           - Строка - Полное имя объекта метаданных
//           - см. СтруктураОписанияОбъектаМетаданных
//           - Произвольный - Объект информационной базы
// 
// Возвращаемое значение:
//  Булево - Это справочник
Функция ЭтоСправочник(Значение) Экспорт
	
	Возврат ЭтоОбъектМетаданныхОжидаемогоТипа(Значение, "Справочник");
	
КонецФункции

// Проверка, что переданное значение относится к документам.
// 
// Параметры:
//  Значение - ОбъектМетаданных
//           - Тип - Тип объекта информационной базы
//           - Строка - Полное имя объекта метаданных
//           - см. СтруктураОписанияОбъектаМетаданных
//           - Произвольный - Объект информационной базы
// 
// Возвращаемое значение:
//  Булево - Это документ
Функция ЭтоДокумент(Значение) Экспорт
	
	Возврат ЭтоОбъектМетаданныхОжидаемогоТипа(Значение, "Документ");
	
КонецФункции

// Проверка, что переданное значение относится к ПВХ.
// 
// Параметры:
//  Значение - ОбъектМетаданных
//           - Тип - Тип объекта информационной базы
//           - Строка - Полное имя объекта метаданных
//           - см. СтруктураОписанияОбъектаМетаданных
//           - Произвольный - Объект информационной базы
// 
// Возвращаемое значение:
//  Булево - Это ПВХ
Функция ЭтоПланВидовХарактеристик(Значение) Экспорт
	
	Возврат ЭтоОбъектМетаданныхОжидаемогоТипа(Значение, "ПланВидовХарактеристик");
	
КонецФункции

// Проверка, что переданное значение относится к перечислениям.
// 
// Параметры:
//  Значение - ОбъектМетаданных
//           - Тип - Тип объекта информационной базы
//           - Строка - Полное имя объекта метаданных
//           - см. СтруктураОписанияОбъектаМетаданных
//           - Произвольный - Объект информационной базы
// 
// Возвращаемое значение:
//  Булево - Это перечисление
Функция ЭтоПланСчетов(Значение) Экспорт
	
	Возврат ЭтоОбъектМетаданныхОжидаемогоТипа(Значение, "ПланСчетов");
	
КонецФункции

// Проверка, что переданное значение относится к ПВР.
// 
// Параметры:
//  Значение - ОбъектМетаданных
//           - Тип - Тип объекта информационной базы
//           - Строка - Полное имя объекта метаданных
//           - см. СтруктураОписанияОбъектаМетаданных
//           - Произвольный - Объект информационной базы
// 
// Возвращаемое значение:
//  Булево - Это ПВР
Функция ЭтоПланВидовРасчета(Значение) Экспорт
	
	Описание = ОписаниеОбъектаМетаданных(Значение);
	Возврат Описание <> Неопределено И Описание.ОписаниеТипа.Имя = "ПланВидовРасчета";
	
КонецФункции

// Проверка, что переданное значение относится к планам обмена.
// 
// Параметры:
//  Значение - ОбъектМетаданных
//           - Тип - Тип объекта информационной базы
//           - Строка - Полное имя объекта метаданных
//           - см. СтруктураОписанияОбъектаМетаданных
//           - Произвольный - Объект информационной базы
// 
// Возвращаемое значение:
//  Булево - Это план обмена
Функция ЭтоПланОбмена(Значение) Экспорт
	
	Описание = ОписаниеОбъектаМетаданных(Значение);
	Возврат Описание <> Неопределено И Описание.ОписаниеТипа.Имя = "ПланОбмена";
	
КонецФункции

// Проверка, что переданное значение относится к бизнес процессам.
// 
// Параметры:
//  Значение - ОбъектМетаданных
//           - Тип - Тип объекта информационной базы
//           - Строка - Полное имя объекта метаданных
//           - см. СтруктураОписанияОбъектаМетаданных
//           - Произвольный - Объект информационной базы
// 
// Возвращаемое значение:
//  Булево - Это бизнес процесс
Функция ЭтоБизнесПроцесс(Значение) Экспорт
	
	Описание = ОписаниеОбъектаМетаданных(Значение);
	Возврат Описание <> Неопределено И Описание.ОписаниеТипа.Имя = "БизнесПроцесс";
	
КонецФункции

// Проверка, что переданное значение относится к задачам.
// 
// Параметры:
//  Значение - ОбъектМетаданных
//           - Тип - Тип объекта информационной базы
//           - Строка - Полное имя объекта метаданных
//           - см. СтруктураОписанияОбъектаМетаданных
//           - Произвольный - Объект информационной базы
// 
// Возвращаемое значение:
//  Булево - Это задача
Функция ЭтоЗадача(Значение) Экспорт
	
	Описание = ОписаниеОбъектаМетаданных(Значение);
	Возврат Описание <> Неопределено И Описание.ОписаниеТипа.Имя = "Задача";
	
КонецФункции

// Проверка, что переданное значение относится к перечислениям.
// 
// Параметры:
//  Значение - ОбъектМетаданных
//           - Тип - Тип объекта информационной базы
//           - Строка - Полное имя объекта метаданных
//           - см. СтруктураОписанияОбъектаМетаданных
//           - Произвольный - Объект информационной базы
// 
// Возвращаемое значение:
//  Булево - Это перечисление
Функция ЭтоПеречисление(Значение) Экспорт
	
	Описание = ОписаниеОбъектаМетаданных(Значение);
	Возврат Описание <> Неопределено И Описание.ОписаниеТипа.Имя = "Перечисление";
	
КонецФункции

// Проверка, что переданное значение относится к регистрам сведений.
// 
// Параметры:
//  Значение - ОбъектМетаданных
//           - Тип - Тип объекта информационной базы
//           - Строка - Полное имя объекта метаданных
//           - см. СтруктураОписанияОбъектаМетаданных
//           - Произвольный - Объект информационной базы
// 
// Возвращаемое значение:
//  Булево - Это регистр сведений
Функция ЭтоРегистрСведений(Значение) Экспорт
	
	Описание = ОписаниеОбъектаМетаданных(Значение);
	Возврат Описание <> Неопределено И Описание.ОписаниеТипа.Имя = "РегистрСведений";
	
КонецФункции

// Проверка, что переданное значение относится к регистрам.
// 
// Параметры:
//  Значение - ОбъектМетаданных
//           - Тип - Тип объекта информационной базы
//           - Строка - Полное имя объекта метаданных
//           - см. СтруктураОписанияОбъектаМетаданных
//           - Произвольный - Объект информационной базы
// 
// Возвращаемое значение:
//  Булево - Это перечисление
Функция ЭтоРегистр(Значение) Экспорт
	
	Описание = ОписаниеОбъектаМетаданных(Значение);
	Возврат Описание <> Неопределено И СтрНачинаетсяС(Описание.ОписаниеТипа.Имя, "Регистр");
	
КонецФункции

// Разрешены ли синхронные вызовы в параметрах конфигурации.
// 
// Возвращаемое значение:
//  Булево - Разрешены синхронные вызовы
Функция РазрешеныСинхронныеВызовы() Экспорт
	
	Возврат ЮТМетаданныеСлужебныйПовтИсп.РазрешеныСинхронныеВызовы();
	
КонецФункции

// Возвращает набор регистров движений документа
// 
// Параметры:
//  Документ - ОбъектМетаданных
//           - Тип - Тип объекта информационной базы
//           - Строка - Полное имя объекта метаданных
//           - см. СтруктураОписанияОбъектаМетаданных
//           - ДокументСсылка, ДокументОбъект - Объект информационной базы
//           - ДокументМенеджер - Менеджер вида документа
// 
// Возвращаемое значение:
//  Структура - Регистры движений документа. Ключи - Имя регистра, Значение - Полное имя регистра
Функция РегистрыДвиженийДокумента(Документ) Экспорт
	
	ОписаниеОбъектаМетаданных = ОписаниеОбъектаМетаданных(Документ);
	
	ПолноеИмя = СтрШаблон("%1.%2", ОписаниеОбъектаМетаданных.ОписаниеТипа.ИмяКоллекции, ОписаниеОбъектаМетаданных.Имя);
	
	Возврат ЮТМетаданныеСлужебныйПовтИсп.РегистрыДвиженийДокумента(ПолноеИмя);
	
КонецФункции

// Возвращает описание регистра движений документа.
//
// Параметры:
//  Документ     - ДокументСсылка, ДокументОбъект, ДокументМенеджер - Документ или менеджер
//               - ОбъектМетаданных, Тип - Метаданные или тип документа
//               - Строка - Полное имя объекта метаданных 
//  ИмяРегистра  - Строка - Имя регистра движений.
//
// Возвращаемое значение:
//  Структура - Описание регистра движений документа
//  Неопределено - Документ не делает движений по указанному регистру
Функция ОписаниеРегистраДвиженийДокумента(Документ, ИмяРегистра) Экспорт
	
	ПолноеИмяРегистра = Неопределено;
	
	Если НЕ РегистрыДвиженийДокумента(Документ).Свойство(ИмяРегистра, ПолноеИмяРегистра) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	//@skip-check constructor-function-return-section
	Возврат ОписаниеОбъектаМетаданных(ПолноеИмяРегистра);
	
КонецФункции

// Возвращает текущую версию тестового движка (YAxUnit)
// 
// Возвращаемое значение:
//  Строка - Версия движка
Функция ВерсияДвижка() Экспорт
	
	Возврат ЮТМетаданныеСлужебныйПовтИсп.ВерсияДвижка();
	
КонецФункции

// Описание типа объекта метаданных.
// 
// Возвращаемое значение:
//  Структура - Описание типа метаданных:
//  * Имя - Строка
//  * ИмяКоллекции - Строка
//  * Конструктор - Строка
//  * Группы - Булево
//  * Ссылочный - Булево
//  * Регистр - Булево
//  * ОбработкаОтчет - Булево
//  * НаборыРеквизитов - Массив Из Строка
//  * ТабличныеЧасти - Булево
//  * ВидыСубконто - Булево
//  * УстановитьНовыйКод - Булево - Доступна автоустановка кода
//  * Предопределенные - Булево
Функция ОписаниеТипаМетаданных() Экспорт
	
	Описание = Новый Структура();
	Описание.Вставить("Имя", "");
	Описание.Вставить("ИмяКоллекции", "");
	Описание.Вставить("Конструктор", "");
	Описание.Вставить("Группы", Ложь);
	Описание.Вставить("Ссылочный", Ложь);
	Описание.Вставить("НаборыРеквизитов", Новый Массив);
	Описание.Вставить("ТабличныеЧасти", Ложь);
	Описание.Вставить("ВидыСубконто", Ложь);
	Описание.Вставить("Регистр", Ложь);
	Описание.Вставить("ОбработкаОтчет", Ложь);
	Описание.Вставить("УстановитьНовыйКод", Ложь);
	Описание.Вставить("Предопределенные", Ложь);
	
	Возврат Описание;
	
КонецФункции

// Описание объекта метаданных.
// 
// Возвращаемое значение:
//  Структура - Описание объекта метаданных:
// * Имя - Строка
// * ОписаниеТипа - см. ОписаниеТипаМетаданных 
// * Реквизиты - Структура
// * ТабличныеЧасти - Структура
Функция СтруктураОписанияОбъектаМетаданных() Экспорт
	
	Описание = Новый Структура;
	Описание.Вставить("Имя", "");
	Описание.Вставить("Представление", "");
	Описание.Вставить("ОписаниеТипа", Неопределено);
	Описание.Вставить("Реквизиты", Новый Структура());
	Описание.Вставить("ТабличныеЧасти", Новый Структура());
	
	//@skip-check constructor-function-return-section
	Возврат Описание;
	
КонецФункции

// Описание реквизита объекта метаданных
//
// Возвращаемое значение:
//  Структура - Описание реквизита:
// * Имя - Строка
// * Тип - ОписаниеТипов
// * Обязательный - Булево
// * ЭтоКлюч - Булево
Функция ОписаниеРеквизита() Экспорт
	
	Описание = Новый Структура();
	Описание.Вставить("Имя", "");
	Описание.Вставить("Тип", Новый ОписаниеТипов("Неопределено"));
	Описание.Вставить("Обязательный", Ложь);
	Описание.Вставить("ЭтоКлюч", Ложь);
	
	Возврат Описание;
	
КонецФункции

// Типы метаданных.
// 
// Возвращаемое значение:
//  Структура - Типы метаданных.
//				* Ключ - Строка
//				* Значение - см. ЮТМетаданные.ОписаниеТипаМетаданных
Функция ТипыМетаданных() Экспорт
	
	Возврат ЮТМетаданныеСлужебныйПовтИсп.ТипыМетаданных();
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЭтоОбъектМетаданныхОжидаемогоТипа(Значение, ОжидаемыйТип)
	
	Описание = ОписаниеОбъектаМетаданных(Значение);
	Возврат Описание <> Неопределено И Описание.ОписаниеТипа.Имя = ОжидаемыйТип;
	
КонецФункции

#КонецОбласти
