&НаСервере
Процедура ПолучитьИмяОтчетаИКлючВарианта(ПараметрКоманды, ИмяОтчета, КлючВарианта)

	ОбъектНастройки = ПараметрКоманды.ПолучитьОбъект();
	КлючВарианта = ОбъектНастройки.Код;
	ИмяОтчета = ОбъектНастройки.КлючОбъекта;

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	Перем ИмяОтчета, КлючВарианта;

	Если НЕ ЗначениеЗаполнено(ПараметрКоманды) Тогда
		Возврат;
	КонецЕсли;

	ПолучитьИмяОтчетаИКлючВарианта(ПараметрКоманды, ИмяОтчета, КлючВарианта);

	Если НЕ ЗначениеЗаполнено(ИмяОтчета) Тогда
		Возврат;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(КлючВарианта) Тогда
		Возврат;
	КонецЕсли;

	Форма = ПолучитьФорму(ИмяОтчета + ".Форма", , Новый УникальныйИдентификатор);
	Форма.УстановитьТекущийВариант(КлючВарианта);
	Форма.Открыть();

КонецПроцедуры
