//©///////////////////////////////////////////////////////////////////////////©//
//
//  Copyright 2021-2024 BIA-Technologies Limited Liability Company
//
//  Licensed under the Apache License, Version 2.0 (the "License");
//  you may not use this file except in compliance with the License.
//  You may obtain a copy of the License at
//
//      http://www.apache.org/licenses/LICENSE-2.0
//
//  Unless required by applicable law or agreed to in writing, software
//  distributed under the License is distributed on an "AS IS" BASIS,
//  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//  See the License for the specific language governing permissions and
//  limitations under the License.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
//	Данные = ПолучитьОбщийМакет("ЮТMonacoEditor");
//	ЧтениеZip = Новый ЧтениеZipФайла(Данные.ОткрытьПотокДляЧтения);
//	ИмяВременногоФайла = ПолучитьИмяВременногоФайла();
//	ЧтениеZip.Извлечь(ЧтениеZip.Элементы[0], ИмяВременногоФайла);
//	Данные = Новый ДвоичныеДанные(ИмяВременногоФайла);
//	УдалитьФайлы(ИмяВременногоФайла);
//	
//	EditorURL = ПолучитьНавигационнуюСсылкуИнформационнойБазы() + "/" + ПоместитьВоВременноеХранилище(Данные, УникальныйИдентификатор);
	EditorURL = "http://localhost:5173/";
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура EditorURLПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	ЮТРеактивныйКлиент.ОбработатьСообщение(ЭтотОбъект, Элементы.EditorURL, ДанныеСобытия, СтандартнаяОбработка,
		Новый ОписаниеОповещения("ОбработатьСообщение", ЭтотОбъект)
	);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбработатьСообщение(Сообщение, Контекст) Экспорт
	
	Если СтрСравнить(Сообщение.ИмяСобытия, "runTest") = 0 Тогда
		ЗапуститьТесты(Сообщение);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьТесты(Сообщение)
	
	Результат = Новый Структура("success", Истина);

	ЮТРеактивныйКлиент.ОтправитьОтвет(Элементы.EditorURL, Сообщение, Результат);
	
КонецПроцедуры

&НаКлиенте
Функция ТекстРедактора()
	
	Возврат ЮТРеактивныйКлиент.ГлобальноеСвойство(Элементы.EditorURL, "bslEditor").getText();
	
КонецФункции

#КонецОбласти
