//©///////////////////////////////////////////////////////////////////////////©//
//
//  Copyright 2021-2024 BIA-Technologies Limited Liability Company
//
//  Licensed under the Apache License, Version 2.0 (the "License");
//  you may not use this file except in compliance with the License.
//  You may obtain a copy of the License at
//
//      http://www.apache.org/licenses/LICENSE-2.0
//
//  Unless required by applicable law or agreed to in writing, software
//  distributed under the License is distributed on an "AS IS" BASIS,
//  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//  See the License for the specific language governing permissions and
//  limitations under the License.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область СлужебныйПрограммныйИнтерфейс

Процедура ИсполняемыеСценарии() Экспорт
	
	ЮТТесты.ВТранзакции()
		.ДобавитьТест("ДобавитьСтроку")
		.ДобавитьТест("Установить")
		.ДобавитьТест("УстановитьРеквизиты")
		.ДобавитьТест("Фикция")
		.ДобавитьТест("ФикцияРеквизитов")
		.ДобавитьТест("ФикцияОбязательныхПолей")
		.ДобавитьТест("Инициализировать")
	;
	
КонецПроцедуры

Процедура ДобавитьСтроку() Экспорт
	
	Документ = ЮТест.Данные().СоздатьДокумент("Документы.РасходТовара");
	Конструктор = ЮТест.Данные().КонструкторДвижений(Документ, "Продажи");
	
	ЮТест.ОжидаетЧто(Конструктор)
		.Метод("ДобавитьСтроку").НеВыбрасываетИсключение();
	
	Данные = Конструктор.Данные();
	ЮТест.ОжидаетЧто(Данные)
		.Заполнено()
		.ИмеетТип("Массив")
		.ИмеетДлину(1);
	
КонецПроцедуры

Процедура Установить() Экспорт
	
	Документ = ЮТест.Данные().СоздатьДокумент("Документы.РасходТовара");
	Покупатель = ЮТест.Данные().СоздатьДокумент("Справочники.Контрагенты");
	Конструктор = ЮТест.Данные().КонструкторДвижений(Документ, "Продажи");
	
	ЮТест.ОжидаетЧто(Конструктор)
		.Метод("Установить", ЮТКоллекции.ЗначениеВМассиве("Покупатель", Покупатель)).ВыбрасываетИсключение("Сначала необходимо добавить строку");
	
	Конструктор
		.ДобавитьСтроку()
		.Установить("Покупатель", Покупатель);
	Данные = Конструктор.ДанныеСтроки();
	ЮТест.ОжидаетЧто(Данные)
		.Заполнено()
		.Свойство("Покупатель").Равно(Покупатель);
	
КонецПроцедуры

Процедура УстановитьРеквизиты() Экспорт
	
	ВызватьИсключение "Тест не реализован";
	
КонецПроцедуры

Процедура Фикция() Экспорт
	
	ВызватьИсключение "Тест не реализован";
	
КонецПроцедуры

Процедура ФикцияРеквизитов() Экспорт
	
	ВызватьИсключение "Тест не реализован";
	
КонецПроцедуры

Процедура ФикцияОбязательныхПолей() Экспорт
	
	ВызватьИсключение "Тест не реализован";
	
КонецПроцедуры

Процедура Инициализировать() Экспорт
	
	ВызватьИсключение "Тест не реализован";
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
