---
description: 
globs: tests/**/*.bsl
alwaysApply: false
---
VARIABLE ASSERTIONS RULES

- для проверки переменных используется ЮТест.ОжидаетЧто
- ЮТест.ОжидаетЧто поддерживает fluent интерфейс
- доступные методы
    - Равно
    - НеРавно
    - Больше
    - БольшеИлиРавно
    - Меньше
    - МеньшеИлиРавно
    - ЭтоНеопределено
    - ЭтоНеНеопределено
    - ЭтоNull
    - ЭтоНеNull
    - ЭтоИстина
    - ЭтоНеИстина
    - ЭтоЛожь
    - ЭтоНеЛожь
    - ВСписке
    - Свойство/Элемент
    - Заполнено
    - НеЗаполнено
    - Существует
    - НеСуществует
    - ИмеетДлину
    - ИмеетДлинуБольше
    - ИмеетДлинуМеньше
    - НеИмеетДлину
    - Содержит
    - НеСодержит
    - НачинаетсяС
    - ЗаканчиваетсяНа
    - СодержитСтрокуПоШаблону
    - НеСодержитСтрокуПоШаблону
    - МеждуВключаяГраницы
    - МеждуИсключаяГраницы
    - МеждуВключаяНачалоГраницы
    - МеждуВключаяОкончаниеГраницы
    - ИмеетТип
    - НеИмеетТип
    - ИмеетСвойство
    - НеИмеетСвойства
    - ИмеетСвойстваРавные
    - КаждыйЭлементСодержитСвойство
    - КаждыйЭлементСодержитСвойствоСоЗначением
    - ЛюбойЭлементСодержитСвойство
    - ЛюбойЭлементСодержитСвойствоСоЗначением
    - КаждыйЭлементСоответствуетПредикату
    - ЛюбойЭлементСоответствуетПредикату
- пример:
```bsl
ЮТест.ОжидаетЧто(Ссылка, "Созданный объект")
  .Заполнено()
  .ИмеетТип("ДокументСсылка.ПриходТовара")
  .Свойство("Номер").Заполнено()
  .Свойство("Дата").Заполнено()
  .Свойство("Поставщик").Равно(Поставщик)
  .Свойство("Склад").Равно(Склад)
  .Свойство("Валюта").Равно(Валюта)
  .Свойство("Организация").Равно(Организация)
  .Свойство("Товары").ИмеетДлину(2)
  .Свойство("Товары[0].Товар").Равно(Товар1)
  .Свойство("Товары[0].Цена").Больше(0)
  .Свойство("Товары[0].Количество").Больше(0)
  .Свойство("Товары[0].Сумма").Равно(100)
  .Свойство("Товары[-1].Товар").Равно(Товар2)
  .Свойство("Товары[-1].Сумма").Равно(200)
  .Свойство("Проведен").ЭтоИстина()
```
  
DATABASE ASSERTIONS RULES

Проверка данных информационной Базовые
- используются утверждения ЮТест.ОжидаетЧтоТаблицаБазы
- методы
    - СодержитЗаписи
    - НеСодержитЗаписи
    - СодержитЗаписиСНаименованием
    - СодержитЗаписиСКодом
    - СодержитЗаписиСНомером
    - НеСодержитЗаписиСНаименованием
    - НеСодержитЗаписиСКодом
    - НеСодержитЗаписиСНомером
## Примеры

```bsl title="Тест создания справочника"
// Проверка и подготовка контекста
АртикулТовара = ЮТест.Данные().СлучайнаяСтрока();
УсловиеПоискаТовара = ЮТест.Предикат()
    .Реквизит("Артикул").Равно(АртикулТовара)
    .Получить(); // Необходимо для сохранения сформированного предиката в переменную

ЮТест.ОжидаетЧтоТаблицаБазы("Справочник.Товары", "Товар уже существует в базе")
    .НеСодержитЗаписей(УсловиеПоискаТовара);
```