---
description: 
globs: tests/**/*.bsl
alwaysApply: false
---
TEST DATA GENERATE RULES

- Вмебсто прямого создания объектов используй механизмы yaxunit
- Создание тестовых данных с использование конструктора объекта:

    ```bsl
    ПриходныйОрдер = ЮТест.Данные().КонструкторОбъекта("Документ.ПриходныйОрдер")
        .ФикцияОбязательныхПолей() // Автоматически заполняем обязательные поля
        .Установить("Контрагент", Справочники.Контрагенты.НайтиПоКоду("00001"))
        .ТабличнаяЧасть("Товары")
        .ДобавитьСтроку()
            .Установить("Номенклатура", Справочники.Номенклатура.НайтиПоКоду("00001"))
            .Установить("Количество", 10)
        .Провести(Истина); // Проводим документ и возвращаем объект
    ```
- ЮТест.Данные().КонструкторОбъекта поддерживает fluent интерфейс
- Методы
    - Установить(ИмяРеквизита:Строка, Значение:Произвольный)
    - УстановитьРеквизиты(ЗначенияРеквизитов:Структура)
    - Фикция(ИмяРеквизита:Строка) - Устанавливает фиктивное значение реквизита создаваемого объекта.
    - ФикцияРеквизитов(ИменаРеквизитов:Строка|Массив из Строка) - Устанавливает фиктивные значения для нескольких реквизитов создаваемого объекта
    - ФикцияОбязательныхПолей()
    - ТабличнаяЧасть(ИмяТабличнойЧасти:Строка) - Переключает конструктор на работу с указанной табличной частью объекта.
    - ДобавитьСтроку(ЗначенияРеквизитов:Структура = Неопределено) - Добавляет новую строку в табличную част
    - Записать(ВернутьОбъект:Булево = Ложь, ОбменДаннымиЗагрузка:Булево = Ложь):Ссылка|Объект
    - Провести(ВернутьОбъект:Булево = Ложь):Ссылка|Объект
    - ДобавитьЗапись(ОбменДаннымиЗагрузка:Булево) - Записывает новый объект в базу данных, но в отличие от методов Записать или Провести возвращает конструктор
    - НовыйОбъект() - Создает новый объект, но не записывает его в базу данных.
    - УстановитьСсылкуНового(Значение:УникальныйИдентификатор|Строка)
    - УстановитьДополнительноеСвойство(ИмяСвойства:Строка, Значение: Произвольный) - Устанавливает дополнительное свойство для создаваемого объекта
    - Объект() - Переключает конструктор на заполнение объекта. Этот метод используется для возврата к настройке реквизитов объекта после работы с табличной частью.
    - ДанныеСтроки():Структура|Неопределено - Возвращает данные текущей строки табличной части объекта. Если конструктор настроен на заполнение объекта, возвращается Неопределено.
    - ДанныеОбъекта():Структура- Возвращает данные создаваемого объекта в виде структуры. Этот метод полезен для проверки или использования данных объекта в тестах.
- Конструктор движений документа `ЮТест.Данные().КонструкторДвижений`
    - поддерживает fluent интерфейс
    - Пример
    ```bsl
    // Создаем пустой документ "ПриходнаяНакладная"
    Документ = ЮТест.Данные().СоздатьДокумент("Документы.ПриходнаяНакладная");

    // Формируем движения по регистру "ОстаткиТоваров"
    ЮТест.Данные().КонструкторДвижений(Документ, "ОстаткиТоваров")
        .ДобавитьСтроку()
            .ФикцияРеквизитов("Номенклатура, Склад")
            .Установить("Количество", 10)
        .ДобавитьСтроку()
            .ФикцияРеквизитов("Номенклатура, Склад")
            .Установить("Количество", 5)
        .Записать();
    ```
    - Методы
        - ДобавитьСтроку(ЗначенияРеквизитов:Структура = Неопределено)
        - Установить(ИмяРеквизита:Строка, Значение:Произвольный)
        - УстановитьРеквизиты(ЗначенияРеквизитов:Структура)
        - Фикция(ИмяРеквизита:Строка, РеквизитыЗаполнения:Структура = Неопределено, ОграничениеТипа:Тип|ОписаниеТипов = Неопределено) - Устанавливает фиктивное значение реквизита создаваемого объекта.
        - ФикцияРеквизитов(ИменаРеквизитов:Строка|Массив из Строка) - Устанавливает фиктивные значения для нескольких реквизитов создаваемого объекта
        - ФикцияОбязательныхПолей()
        - УстановитьДополнительноеСвойство(ИмяСвойства:Строка, Значение: Произвольный) - Устанавливает дополнительное свойство для создаваемого объекта
        - ДанныеСтроки():Структура
        - Данные():Массив - возвращает данные всего набора записей
        - Записать(ОбменДаннымиЗагрузка:Булево = Ложь)
- Требования
    - Используй генерацию фиктивных значений, если нет требований к конкретным значениям реквизитов
    -  Вместо конструкций вида `Установить("Склад", ЮТест.Данные().СоздатьЭлемент(Справочники.ПУБ_Склады))` используй `Фикция("Склад")`
