//©///////////////////////////////////////////////////////////////////////////©//
//
//  Copyright 2021-2025 BIA-Technologies Limited Liability Company
//
//  Licensed under the Apache License, Version 2.0 (the "License");
//  you may not use this file except in compliance with the License.
//  You may obtain a copy of the License at
//
//      http://www.apache.org/licenses/LICENSE-2.0
//
//  Unless required by applicable law or agreed to in writing, software
//  distributed under the License is distributed on an "AS IS" BASIS,
//  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//  See the License for the specific language governing permissions and
//  limitations under the License.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СформироватьТекст(Команда)
	СформироватьТекстНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ОтмеченныеОбъекты()
	
	ОтмеченныеСсылки = Новый Массив;
	
	Для Каждого Элемент Из Данные Цикл
		Если Элемент.Пометка Тогда
			ОтмеченныеСсылки.Добавить(Элемент.Значение);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ОтмеченныеСсылки;
	
КонецФункции

&НаСервере
Процедура СформироватьТекстНаСервере()
	
	ОтмеченныеСсылки = ОтмеченныеОбъекты();
	
	ПараметрыГенерацииКода = ЮТГенераторКода.ПараметрыГенерацииКода();
	ПараметрыГенерацииКода.ПропускатьПустыеЗначения = НастройкиПропускатьПустыеЗначения;
	ПараметрыГенерацииКода.ИспользоватьПоиск = НастройкиРежимУстановкиРеквизитов = "Поиск";
	
	Результат = ЮТГенераторКодаСлужебныйСервер.СформироватьКодПоСсылкамНаОбъекты(ОтмеченныеСсылки, ПараметрыГенерацииКода);
	
КонецПроцедуры

#КонецОбласти
