
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	УстановитьВидимостьОбъектовЧерезODataAPI();
КонецПроцедуры


Процедура УстановитьВидимостьОбъектовЧерезODataAPI()
	Массив = Новый Массив();
	
	Для Каждого Справочник Из Метаданные.Справочники Цикл
		Массив.Добавить(Справочник);
	КонецЦикла;
	
	Для Каждого Документ Из Метаданные.Документы Цикл
			Массив.Добавить(Документ);
	КонецЦикла;
	
	Для Каждого Перечисление Из Метаданные.Перечисления Цикл
		Массив.Добавить(Перечисление);
	КонецЦикла;
	
	Для Каждого РегистрСведений Из Метаданные.РегистрыСведений Цикл
		Массив.Добавить(РегистрСведений);
	КонецЦикла;
	
	Для Каждого РегистрНакопления Из Метаданные.РегистрыНакопления Цикл
		Массив.Добавить(РегистрНакопления);
	КонецЦикла;		

	Для Каждого ПланВидовХарактеристик Из Метаданные.ПланыВидовХарактеристик Цикл
		Массив.Добавить(ПланВидовХарактеристик);
	КонецЦикла;	

	
	Для Каждого Константа Из Метаданные.Константы Цикл
		Массив.Добавить(Константа);
	КонецЦикла;
	
	Для Каждого Журналы Из Метаданные.ЖурналыДокументов Цикл
		Массив.Добавить(Журналы);
	КонецЦикла;
	
	УстановитьСоставСтандартногоИнтерфейсаOData(Массив);
КонецПроцедуры	