//©///////////////////////////////////////////////////////////////////////////©//
//
//  Copyright 2021-2025 BIA-Technologies Limited Liability Company
//
//  Licensed under the Apache License, Version 2.0 (the "License");
//  you may not use this file except in compliance with the License.
//  You may obtain a copy of the License at
//
//      http://www.apache.org/licenses/LICENSE-2.0
//
//  Unless required by applicable law or agreed to in writing, software
//  distributed under the License is distributed on an "AS IS" BASIS,
//  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//  See the License for the specific language governing permissions and
//  limitations under the License.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область СлужебныйПрограммныйИнтерфейс

// Найти ссылку по реквизиту.
// 
// Параметры:
//  МетаданныеОбъекта - ОбъектМетаданных - метаданные
//                    - Произвольный - менеджер
//                    - см. ЮТМетаданные.ОписаниеОбъектаМетаданных
//                    - Строка - полное имя метаданных или менеджера
//                    - Тип, ОписаниеТипов - тип значения
//  ИмяРеквизита - Строка
//  ЗначениеРеквизита - Произвольный
// 
// Возвращаемое значение:
//  ЛюбаяСсылка - Найти ссылку по реквизиту
Функция СсылкаПоРеквизиту(МетаданныеОбъекта, ИмяРеквизита, ЗначениеРеквизита) Экспорт
	ИмяТаблицы = ИмяОбъектаМетаданных(МетаданныеОбъекта);
	
	Предикат = ЮТест.Предикат()
		.Реквизит(ИмяРеквизита).Равно(ЗначениеРеквизита);
	
	Возврат ЮТЗапросы.СсылкаПоУсловиям(ИмяТаблицы, Предикат);
КонецФункции

// Случайная ссылка.
// 
// Параметры:
//  МетаданныеОбъекта - ОбъектМетаданных - метаданные
//                    - Произвольный - менеджер
//                    - см. ЮТМетаданные.ОписаниеОбъектаМетаданных
//                    - Строка - полное имя метаданных или менеджера
//                    - Тип, ОписаниеТипов - тип значения
//  Значение - Строка, Число, УникальныйИдентификатор - Значение поиска
//  Отборы - Массив из см. ЮТФабрика.ВыражениеПредиката - Набор условий, см. ЮТПредикаты.Получить
//           - см. ЮТФабрика.ВыражениеПредиката
//           - ОбщийМодуль - Модуль настройки предикатов, см. ЮТест.Предикат
//           - Структура, Соответствие - Набор условий
//           - Неопределено - Проверит, что таблица не пустая
// 
// Возвращаемое значение:
//  ЛюбаяСсылка - Случайная ссылка
Функция Ссылка(МетаданныеОбъекта, Значение, Отборы = Неопределено) Экспорт
	ОписаниеОбъектаМетаданных = ЮТМетаданные.ОписаниеОбъектаМетаданных(МетаданныеОбъекта, Истина);
	
	Если ЮТМетаданные.ЭтоПеречисление(ОписаниеОбъектаМетаданных) Тогда
		Возврат ДесериализоватьПеречисление(ОписаниеОбъектаМетаданных, Значение);
	КонецЕсли;
	
	Если ТаблицаСодержитПредопределенный(ОписаниеОбъектаМетаданных, Значение) Тогда
		Менеджер = ЮТОбщий.Менеджер(ОписаниеОбъектаМетаданных);
		Возврат Менеджер[Значение];
	КонецЕсли;
	
	ИмяТаблицы = ИмяОбъектаМетаданных(ОписаниеОбъектаМетаданных);
	РеквизитыПоиска = РеквизитыПоиска(ОписаниеОбъектаМетаданных);
	
	Для Каждого РеквизитПоиска Из РеквизитыПоиска Цикл
		ЗначениеПоиска = РеквизитПоиска.Значение.ПривестиЗначение(Значение);
		Если ЗначениеПоиска = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Предикат = ЮТест.Предикат(Отборы)
			.Реквизит(РеквизитПоиска.Ключ).Равно(ЗначениеПоиска);
		
		Результат = ЮТЗапросы.СсылкаПоУсловиям(ИмяТаблицы, Предикат);
		
		Если Результат <> Неопределено Тогда
			Возврат Результат;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Получить полное имя объекта метаданных
//
// Параметры:
//  МетаданныеОбъекта - ОбъектМетаданных - объект метаданных
//                    - Тип - тип объекта информационной базы
//                    - Строка - полное имя объекта метаданных
//                    - см. ЮТМетаданные.ОписаниеОбъектаМетаданных
//                    - Произвольный - объект информационной базы
//
// Возвращаемое значение:
//  Строка - Полное имя объекта метаданных
Функция ИмяОбъектаМетаданных(МетаданныеОбъекта)
	Описание = ЮТМетаданные.ОписаниеОбъектаМетаданных(МетаданныеОбъекта, Истина);
	
	Возврат СтрШаблон("%1.%2", Описание.ОписаниеТипа.Имя, Описание.Имя);
КонецФункции

Функция РеквизитыПоиска(ОписаниеОбъектаМетаданных)
	БазовыеРеквизиты = БазовыеРеквизитыПоиска(ОписаниеОбъектаМетаданных);
	
	РеквизитыПоиска = Новый Структура;
	Для Каждого ИмяРеквизита Из БазовыеРеквизиты Цикл
		Реквизит = Неопределено;
		Если ОписаниеОбъектаМетаданных.Реквизиты.Свойство(ИмяРеквизита, Реквизит) Тогда
			РеквизитыПоиска.Вставить(ИмяРеквизита, Реквизит.Тип);
		КонецЕсли;
	КонецЦикла;
	
	Возврат РеквизитыПоиска;
КонецФункции

Функция БазовыеРеквизитыПоиска(ОписаниеОбъектаМетаданных)
	ИмяКоллекции = ОписаниеОбъектаМетаданных.ОписаниеТипа.Имя;
	
	Если ИмяКоллекции = "Справочник"
		ИЛИ ИмяКоллекции = "ПланВидовХарактеристик"
		ИЛИ ИмяКоллекции = "ПланСчетов"
		ИЛИ ИмяКоллекции = "ПланВидовРасчета"
		ИЛИ ИмяКоллекции = "ПланОбмена" Тогда
		Реквизиты = "Код,Наименование";
	ИначеЕсли ИмяКоллекции = "Документ"
		ИЛИ ИмяКоллекции = "БизнесПроцесс"
		ИЛИ ИмяКоллекции = "Задача" Тогда
		Реквизиты = "Номер";
	ИначеЕсли ИмяКоллекции = "Перечисление" Тогда
		Реквизиты = "Имя,Представление";
	Иначе
		Реквизиты = "";
	КонецЕсли;
	
	Возврат СтрРазделить(Реквизиты, ",");
КонецФункции

Функция ДесериализоватьПеречисление(ОписаниеОбъектаМетаданных, Идентификатор)
	
	Менеджер = ЮТОбщий.Менеджер(ОписаниеОбъектаМетаданных);
	
	Для Каждого Значение Из Менеджер Цикл
		
		Если СтрСравнить(Строка(Значение), Идентификатор) = 0 Тогда
			Возврат Значение;
		КонецЕсли;
		
	КонецЦикла;
	
	ОжидаемыйТип = ЮТТипыДанныхСлужебный.НовыйТипСсылки(ОписаниеОбъектаМетаданных);
	Попытка
		Возврат XMLЗначение(ОжидаемыйТип, Идентификатор);
	Исключение
		ВызватьИсключение СтрШаблон("Не удалось определить значение перечисления '%1' (%2)", Идентификатор, ОжидаемыйТип);
	КонецПопытки;
	
	Возврат Неопределено;
	
КонецФункции

Функция ТаблицаСодержитПредопределенный(ОписаниеОбъектаМетаданных, ИмяПредопределенного) Экспорт
	
	Если НЕ ОписаниеОбъектаМетаданных.ОписаниеТипа.Предопределенные Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ОбъектМетаданных = Метаданные[ОписаниеОбъектаМетаданных.ОписаниеТипа.ИмяКоллекции][ОписаниеОбъектаМетаданных.Имя];
	
	Если ОбъектМетаданных.ПолучитьИменаПредопределенных().Найти(ИмяПредопределенного) <> Неопределено Тогда
		Возврат Истина;
	КонецЕсли;
	
	Результат = Ложь;
	
	Для Каждого ИмяЭлемента Из ОбъектМетаданных.ПолучитьИменаПредопределенных() Цикл
		Если СтрСравнить(ИмяЭлемента, ИмяПредопределенного) = 0 Тогда
			Результат = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
