//©///////////////////////////////////////////////////////////////////////////©//
//
//  Copyright 2021-2022 BIA-Technologies Limited Liability Company
//
//  Licensed under the Apache License, Version 2.0 (the "License");
//  you may not use this file except in compliance with the License.
//  You may obtain a copy of the License at
//
//      http://www.apache.org/licenses/LICENSE-2.0
//
//  Unless required by applicable law or agreed to in writing, software
//  distributed under the License is distributed on an "AS IS" BASIS,
//  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//  See the License for the specific language governing permissions and
//  limitations under the License.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область СлужебныйПрограммныйИнтерфейс

Процедура ИсполняемыеСценарии() Экспорт
	
	ЮТТесты
		.ДобавитьТест("Обучение")
		.ДобавитьТест("Проверить")
		.ДобавитьСерверныйТест("МокированиеМетодовСсылочныхОбъектов")
	;
	
КонецПроцедуры

Процедура Обучение() Экспорт
	
	Описание = "Обучение через явный вызов метода";
	
	ЛюбойПараметр = Мокито.ЛюбойПараметр();
	Адрес = "service.com";
	
	Мокито.Обучение(Интеграция)
		.Когда(Интеграция.ВыполнитьЗапрос(ЛюбойПараметр, ЛюбойПараметр, ЛюбойПараметр))
		.Вернуть(1)
		.Когда(Интеграция.ВыполнитьЗапрос(Адрес, ЛюбойПараметр, ЛюбойПараметр))
		.Вернуть(2)
		.Прогон();
	
	ЮТест.ОжидаетЧто(Интеграция.ВыполнитьЗапрос(Неопределено, 2), Описание + ". Кейс 1")
		.Равно(1);
	ЮТест.ОжидаетЧто(Интеграция.ВыполнитьЗапрос(Адрес, 1), Описание + ". Кейс 2")
		.Равно(2);
	
	Описание = "Обучение через указание имени и набора параметров";
	Мокито.Обучение(Интеграция)
		.Когда("ВыполнитьЗапрос", Мокито.МассивПараметров(ЛюбойПараметр, ЛюбойПараметр))
		.Вернуть(20)
		.Когда("ВыполнитьЗапрос", Мокито.МассивПараметров(Адрес, 2))
		.Вернуть(2)
		.Прогон();
	
	ЮТест.ОжидаетЧто(Интеграция.ВыполнитьЗапрос(Адрес, 2), Описание + ". Кейс 1")
		.Равно(2);
	ЮТест.ОжидаетЧто(Интеграция.ВыполнитьЗапрос(Адрес, 1), Описание + ". Кейс 2")
		.Равно(20);
	
КонецПроцедуры

Процедура Проверить() Экспорт
	
	ЛюбойПараметр = Мокито.ЛюбойПараметр();
	Адрес = "service.com";
	
	Мокито.Обучение(Интеграция)
		.Когда(Интеграция.ВыполнитьЗапрос(ЛюбойПараметр, ЛюбойПараметр))
		.Вернуть(1)
		.Когда(Интеграция.ВыполнитьЗапрос(Адрес, 2))
		.Вернуть(10)
		.Прогон();
	
	Интеграция.ВыполнитьЗапрос("Адрес", Неопределено);
	Интеграция.ВыполнитьЗапрос(Адрес, 2);
	Интеграция.ВыполнитьЗапрос(1, 2);
	
	Мокито.Проверить(Интеграция)
		.КоличествоВызовов(Интеграция.ВыполнитьЗапрос(ЛюбойПараметр, Мокито.ЧисловойПараметр())).Больше(1).Равно(2)
		.КоличествоВызовов("ВыполнитьЗапрос").Заполнено().Равно(3).Меньше(6)
		.КоличествоВызовов("ПолучитьПочтовыеЯщикиIMAP").Пусто().Меньше(1)
		.КоличествоВызовов(Интеграция.ВыполнитьЗапрос(1, 2)).Равно(1)
		.КоличествоВызовов(Интеграция.ВыполнитьЗапрос(ЛюбойПараметр, ЛюбойПараметр)).Равно(3)
		.КоличествоВызовов(Интеграция.ВыполнитьЗапрос(Мокито.ТипизированныйПараметр(Тип("Строка")), ЛюбойПараметр)).Равно(2)
	;
	
КонецПроцедуры

#Если Сервер Тогда
Процедура МокированиеМетодовСсылочныхОбъектов() Экспорт
	
	Результат = Новый УникальныйИдентификатор();
	// Мокирование обработки проведения (выключение алгоритма проведения)
	Документ = ЮТест.Данные().СоздатьДокумент("Документы.ПриходТовара");
	Мокито.Обучение(Документ)
		.Когда("ОбработкаПроведения").Пропустить()
		.Прогон();
	
	Объект = Документ.ПолучитьОбъект();
	Объект.Записать(РежимЗаписиДокумента.Проведение);
	
	Мокито.Проверить(Объект).КоличествоВызовов("ОбработкаПроведения").Заполнено();
	Мокито.Проверить(Документ).КоличествоВызовов("ОбработкаПроведения").Заполнено();
	
	УстановитьПривилегированныйРежим(Истина);
	Справочник = ЮТест.Данные().СоздатьЭлемент(Справочники.Товары);
	СправочникОбъект = Справочник.ПолучитьОбъект();
	
	// Мокирование экспортного метода объекта, указание имени метода
	Описание = "Мокирование экспортного метода объекта, указание имени метода";
	Мокито.Обучение(Справочник)
		.Когда("ПечатнаяФормаШтрихкода").Вернуть(Результат)
		.Прогон();
	
	ЮТест.ОжидаетЧто(СправочникОбъект.ПечатнаяФормаШтрихкода(Неопределено), Описание)
		.Равно(Результат);
	
	Мокито.Проверить(Справочник).КоличествоВызовов("ПечатнаяФормаШтрихкода").Заполнено();
	
	// Мокирование экспортного метода объекта, явный вызов метода
	Мокито.Сбросить();
	Описание = "Мокирование экспортного метода объекта, явный вызов метода";
	Мокито.Обучение(СправочникОбъект)
		.Когда(СправочникОбъект.ПечатнаяФормаШтрихкода(Неопределено)).Вернуть(Результат)
		.Прогон();
	
	ЮТест.ОжидаетЧто(Справочник.ПолучитьОбъект().ПечатнаяФормаШтрихкода(Неопределено), Описание)
		.Равно(Результат);
	
	Мокито.Проверить(Справочник).КоличествоВызовов("ПечатнаяФормаШтрихкода").Заполнено(Описание);
	
	// Мокирование приватного метода
	Пользователь = ЮТест.Данные().СоздатьЭлемент(Справочники.Пользователи);
	Мокито.Сбросить();
	Описание = "Мокирование приватного метода";
	Справочник = ЮТест.Данные().СоздатьЭлемент(Справочники.Встречи, , Новый Структура("Владелец", Пользователь));
	СправочникОбъект = Справочник.ПолучитьОбъект();
	СправочникОбъект.Начало = ТекущаяДатаСеанса();
	
	ЮТест.ОжидаетЧто(СправочникОбъект.ПроверитьЗаполнение())
		.ЭтоЛожь();
	
	Мокито.Обучение(СправочникОбъект)
		.Когда("УказанКорректныйПериод").Вернуть(Истина)
		.Прогон();
	
	ЮТест.ОжидаетЧто(СправочникОбъект.ПроверитьЗаполнение(), Описание + ". После мокирования")
		.ЭтоИстина();
	
	// Мокирование модуля менеджера
	Мокито.Сбросить();
	Элементы = Новый Массив(2);
	
	Описание = "Мокирование модуля менеджера";
	Мокито.Обучение(Справочники.Встречи)
		.Когда(Справочники.Встречи.СохранитьИзменения(Элементы)).Вернуть(Результат)
		.Прогон();
	
	ЮТест.ОжидаетЧто(Справочники.Встречи.СохранитьИзменения(Элементы), Описание)
		.Равно(Результат);
	
КонецПроцедуры
#КонецЕсли

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
