//©///////////////////////////////////////////////////////////////////////////©//
//
//  Copyright 2021-2024 BIA-Technologies Limited Liability Company
//
//  Licensed under the Apache License, Version 2.0 (the "License");
//  you may not use this file except in compliance with the License.
//  You may obtain a copy of the License at
//
//      http://www.apache.org/licenses/LICENSE-2.0
//
//  Unless required by applicable law or agreed to in writing, software
//  distributed under the License is distributed on an "AS IS" BASIS,
//  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//  See the License for the specific language governing permissions and
//  limitations under the License.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область СлужебныйПрограммныйИнтерфейс

Процедура ИсполняемыеСценарии() Экспорт
	
	ЮТТесты
		.ДобавитьТест("ЗагружаемаяНастройкаДымовогоТеста")
	;
	
КонецПроцедуры

Процедура ЗагружаемаяНастройкаДымовогоТеста() Экспорт
	
	ПараметрыЗапуска = Новый Структура;
	Ключ = "ОткрытиеФорм";
	ЮТест.ОжидаетЧто(ЮТДымовыеТестыСлужебныйКлиентСервер.ЗагружаемаяНастройкаДымовогоТеста(ПараметрыЗапуска, Ключ))
		.ИмеетТип("Структура")
		.Свойство("Использовать").ЭтоЛожь();
	
	ПараметрыЗапуска.Вставить("ДымовыеТесты");
	ЮТест.ОжидаетЧто(ЮТДымовыеТестыСлужебныйКлиентСервер.ЗагружаемаяНастройкаДымовогоТеста(ПараметрыЗапуска, Ключ))
		.ИмеетТип("Структура")
		.Свойство("Использовать").ЭтоЛожь();
	
	ПараметрыЗапуска.ДымовыеТесты = Ложь;
	ЮТест.ОжидаетЧто(ЮТДымовыеТестыСлужебныйКлиентСервер.ЗагружаемаяНастройкаДымовогоТеста(ПараметрыЗапуска, Ключ))
		.ИмеетТип("Структура")
		.Свойство("Использовать").ЭтоЛожь();
	
	ПараметрыЗапуска.ДымовыеТесты = Истина;
	ЮТест.ОжидаетЧто(ЮТДымовыеТестыСлужебныйКлиентСервер.ЗагружаемаяНастройкаДымовогоТеста(ПараметрыЗапуска, Ключ))
		.ИмеетТип("Структура")
		.Свойство("Использовать").ЭтоИстина();
	
	ПараметрыЗапуска.ДымовыеТесты = Новый Структура(Ключ);
	ЮТест.ОжидаетЧто(ЮТДымовыеТестыСлужебныйКлиентСервер.ЗагружаемаяНастройкаДымовогоТеста(ПараметрыЗапуска, Ключ))
		.ИмеетТип("Структура")
		.Свойство("Использовать").ЭтоЛожь();
	
	ПараметрыЗапуска.ДымовыеТесты.Вставить("Использовать", Истина);
	ЮТест.ОжидаетЧто(ЮТДымовыеТестыСлужебныйКлиентСервер.ЗагружаемаяНастройкаДымовогоТеста(ПараметрыЗапуска, Ключ))
		.ИмеетТип("Структура")
		.Свойство("Использовать").ЭтоЛожь();
	
	ПараметрыЗапуска.ДымовыеТесты[Ключ] = Ложь;
	ЮТест.ОжидаетЧто(ЮТДымовыеТестыСлужебныйКлиентСервер.ЗагружаемаяНастройкаДымовогоТеста(ПараметрыЗапуска, Ключ))
		.ИмеетТип("Структура")
		.Свойство("Использовать").ЭтоЛожь();
	
	ПараметрыЗапуска.ДымовыеТесты[Ключ] = Истина;
	ЮТест.ОжидаетЧто(ЮТДымовыеТестыСлужебныйКлиентСервер.ЗагружаемаяНастройкаДымовогоТеста(ПараметрыЗапуска, Ключ))
		.ИмеетТип("Структура")
		.Свойство("Использовать").ЭтоИстина();
	
	ПараметрыЗапуска.ДымовыеТесты[Ключ] = Новый Структура;
	ЮТест.ОжидаетЧто(ЮТДымовыеТестыСлужебныйКлиентСервер.ЗагружаемаяНастройкаДымовогоТеста(ПараметрыЗапуска, Ключ))
		.ИмеетТип("Структура")
		.Свойство("Использовать").ЭтоЛожь();
	
	ПараметрыЗапуска.ДымовыеТесты[Ключ] = Новый Структура("Использовать", Ложь);
	ЮТест.ОжидаетЧто(ЮТДымовыеТестыСлужебныйКлиентСервер.ЗагружаемаяНастройкаДымовогоТеста(ПараметрыЗапуска, Ключ))
		.ИмеетТип("Структура")
		.Свойство("Использовать").ЭтоЛожь();
	
КонецПроцедуры

#КонецОбласти
