#Область СлужебныйПрограммныйИнтерфейс

Процедура ИсполняемыеСценарии() Экспорт
	
	ЮТТесты
		.ДобавитьТест("ИсключитьТест")
		.ДобавитьТест("ЗагружаемаяНастройкаДымовогоТеста")
	;
	
КонецПроцедуры

Процедура ИсключитьТест() Экспорт
	
	Настройки = Новый Структура("Использовать, Справочник", Истина, Ложь);
	
	УстановитьНастройки(Настройки);
	ЮТест.ОжидаетЧто(ЮТДымовыеТестыСлужебныйКлиентСервер.ИсключитьТест("Справочник"))
		.ЭтоИстина();
	ЮТест.ОжидаетЧто(ЮТДымовыеТестыСлужебныйКлиентСервер.ИсключитьТест("Справочник.Номенклатура"))
		.ЭтоИстина();
	ЮТест.ОжидаетЧто(ЮТДымовыеТестыСлужебныйКлиентСервер.ИсключитьТест("Документ"))
		.ЭтоЛожь();
	ЮТест.ОжидаетЧто(ЮТДымовыеТестыСлужебныйКлиентСервер.ИсключитьТест("Документ.ПКО"))
		.ЭтоЛожь();
	
	Настройки.Справочник = Новый Структура("Исключения", "Номенклатура");
	УстановитьНастройки(Настройки);
	ЮТест.ОжидаетЧто(ЮТДымовыеТестыСлужебныйКлиентСервер.ИсключитьТест("Справочник"))
		.ЭтоЛожь();
	ЮТест.ОжидаетЧто(ЮТДымовыеТестыСлужебныйКлиентСервер.ИсключитьТест("Справочник.Номенклатура"))
		.ЭтоИстина();
	ЮТест.ОжидаетЧто(ЮТДымовыеТестыСлужебныйКлиентСервер.ИсключитьТест("Справочник.Номенклатура_Удалить"))
		.ЭтоЛожь();
	Настройки.Справочник.Исключения = ЮТКоллекции.ЗначениеВМассиве("*Удалить");
	УстановитьНастройки(Настройки);
	ЮТест.ОжидаетЧто(ЮТДымовыеТестыСлужебныйКлиентСервер.ИсключитьТест("Справочник.Номенклатура_Удалить"))
		.ЭтоИстина();
	ЮТест.ОжидаетЧто(ЮТДымовыеТестыСлужебныйКлиентСервер.ИсключитьТест("Справочник.Удалить"))
		.ЭтоЛожь();
	ЮТест.ОжидаетЧто(ЮТДымовыеТестыСлужебныйКлиентСервер.ИсключитьТест("Справочник.Удалить_Номенклатура"))
		.ЭтоЛожь();
	Настройки = Новый Структура("Использовать, Исключения", Истина, ЮТКоллекции.ЗначениеВМассиве("Удалить*"));
	УстановитьНастройки(Настройки);
	ЮТест.ОжидаетЧто(ЮТДымовыеТестыСлужебныйКлиентСервер.ИсключитьТест("Документ.Удалить_Номенклатура"))
		.ЭтоИстина();
	ЮТест.ОжидаетЧто(ЮТДымовыеТестыСлужебныйКлиентСервер.ИсключитьТест("Удалить_Справочник.Номенклатура"))
		.ЭтоИстина();
	ЮТест.ОжидаетЧто(ЮТДымовыеТестыСлужебныйКлиентСервер.ИсключитьТест("Справочник.Номенклатура_Удалить"))
		.ЭтоЛожь();
КонецПроцедуры

Процедура ЗагружаемаяНастройкаДымовогоТеста() Экспорт
	
	ПараметрыЗапуска = Новый Структура;
	Ключ = "ОткрытиеФорм";
	ЮТест.ОжидаетЧто(ЮТДымовыеТестыСлужебныйКлиентСервер.ЗагружаемаяНастройкаДымовогоТеста(ПараметрыЗапуска, Ключ))
		.ИмеетТип("Структура")
		.Свойство("Использовать").ЭтоЛожь();
	
	ПараметрыЗапуска.Вставить("ДымовыеТесты");
	ЮТест.ОжидаетЧто(ЮТДымовыеТестыСлужебныйКлиентСервер.ЗагружаемаяНастройкаДымовогоТеста(ПараметрыЗапуска, Ключ))
		.ИмеетТип("Структура")
		.Свойство("Использовать").ЭтоЛожь();
	
	ПараметрыЗапуска.ДымовыеТесты = Ложь;
	ЮТест.ОжидаетЧто(ЮТДымовыеТестыСлужебныйКлиентСервер.ЗагружаемаяНастройкаДымовогоТеста(ПараметрыЗапуска, Ключ))
		.ИмеетТип("Структура")
		.Свойство("Использовать").ЭтоЛожь();
	
	ПараметрыЗапуска.ДымовыеТесты = Истина;
	ЮТест.ОжидаетЧто(ЮТДымовыеТестыСлужебныйКлиентСервер.ЗагружаемаяНастройкаДымовогоТеста(ПараметрыЗапуска, Ключ))
		.ИмеетТип("Структура")
		.Свойство("Использовать").ЭтоИстина();
	
	ПараметрыЗапуска.ДымовыеТесты = Новый Структура(Ключ);
	ЮТест.ОжидаетЧто(ЮТДымовыеТестыСлужебныйКлиентСервер.ЗагружаемаяНастройкаДымовогоТеста(ПараметрыЗапуска, Ключ))
		.ИмеетТип("Структура")
		.Свойство("Использовать").ЭтоЛожь();
	
	ПараметрыЗапуска.ДымовыеТесты.Вставить("Использовать", Истина);
	ЮТест.ОжидаетЧто(ЮТДымовыеТестыСлужебныйКлиентСервер.ЗагружаемаяНастройкаДымовогоТеста(ПараметрыЗапуска, Ключ))
		.ИмеетТип("Структура")
		.Свойство("Использовать").ЭтоЛожь();
	
	ПараметрыЗапуска.ДымовыеТесты[Ключ] = Ложь;
	ЮТест.ОжидаетЧто(ЮТДымовыеТестыСлужебныйКлиентСервер.ЗагружаемаяНастройкаДымовогоТеста(ПараметрыЗапуска, Ключ))
		.ИмеетТип("Структура")
		.Свойство("Использовать").ЭтоЛожь();
	
	ПараметрыЗапуска.ДымовыеТесты[Ключ] = Истина;
	ЮТест.ОжидаетЧто(ЮТДымовыеТестыСлужебныйКлиентСервер.ЗагружаемаяНастройкаДымовогоТеста(ПараметрыЗапуска, Ключ))
		.ИмеетТип("Структура")
		.Свойство("Использовать").ЭтоИстина();
	
	ПараметрыЗапуска.ДымовыеТесты[Ключ] = Новый Структура;
	ЮТест.ОжидаетЧто(ЮТДымовыеТестыСлужебныйКлиентСервер.ЗагружаемаяНастройкаДымовогоТеста(ПараметрыЗапуска, Ключ))
		.ИмеетТип("Структура")
		.Свойство("Использовать").ЭтоЛожь();
	
	ПараметрыЗапуска.ДымовыеТесты[Ключ] = Новый Структура("Использовать", Ложь);
	ЮТест.ОжидаетЧто(ЮТДымовыеТестыСлужебныйКлиентСервер.ЗагружаемаяНастройкаДымовогоТеста(ПараметрыЗапуска, Ключ))
		.ИмеетТип("Структура")
		.Свойство("Использовать").ЭтоЛожь();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УстановитьНастройки(Настройки)
	
	ЮТДымовыеТестыСлужебныйКлиентСервер.Инициализация(Новый Структура("ДымовыеТесты", Настройки));
	
КонецПроцедуры

#КонецОбласти
