//©///////////////////////////////////////////////////////////////////////////©//
//
//  Copyright 2021-2023 BIA-Technologies Limited Liability Company
//
//  Licensed under the Apache License, Version 2.0 (the "License");
//  you may not use this file except in compliance with the License.
//  You may obtain a copy of the License at
//
//      http://www.apache.org/licenses/LICENSE-2.0
//
//  Unless required by applicable law or agreed to in writing, software
//  distributed under the License is distributed on an "AS IS" BASIS,
//  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//  See the License for the specific language governing permissions and
//  limitations under the License.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область СлужебныйПрограммныйИнтерфейс

Функция ВыборкаИзТабличногоДокумента(ТабличныйДокумент) Экспорт
	
	ВсегоСтрок = ТабличныйДокумент.ВысотаТаблицы;
	ВсегоКолонок = ТабличныйДокумент.ШиринаТаблицы;
	
	Область = ТабличныйДокумент.Область(1,1,ВсегоСтрок,ВсегоКолонок);
	
	ИсточникДанных = Новый ОписаниеИсточникаДанных(Область);
	ПостроительОтчета = Новый ПостроительОтчета;
	ПостроительОтчета.ИсточникДанных = ИсточникДанных;
	ПостроительОтчета.Выполнить();
	
	Возврат ПостроительОтчета.Результат.Выбрать();
	
КонецФункции

// Читает табличный документ в массив структур
//
//	Параметры:
//		ТабличныйДокумент - ТабличныйДокумент - Исходный табличный документ
//		НомерКолонки - Число - Номер строки таблицы, с которой следует начать считывание
//		НомерСтроки - Число - Номер колонки таблицы, с которой следует начать считывание
//	Возвращаемое значение:
//		Массив из Структура - Данные табличного документа	
Функция СтруктурыТабличногоДокумента(ТабличныйДокумент, Знач НомерКолонки = 1, Знач НомерСтроки = 1) Экспорт
	
	МассивДанных = Новый Массив;
	СведенияКолонок = Новый Массив;
	
	ЗаменяемыеСтроки = ЮТТестовыеДанныеСлужебный.ПодстрокиДляЗаменыВИменахСвойств();
	
	ЗначениеКолонки = ТабличныйДокумент.Область(НомерСтроки, НомерКолонки).Текст;
	Пока ЗначениеЗаполнено(ЗначениеКолонки) Цикл
		
		Для Каждого Замена Из ЗаменяемыеСтроки Цикл
			ПодстрокаПоиска = Замена.Ключ;
			ПодстрокаЗамены = Замена.Значение;
			ИмяКолонки = СтрЗаменить(ЗначениеКолонки, ПодстрокаПоиска, ПодстрокаЗамены);
		КонецЦикла;
		
		Сведения = Новый Структура("НомерКолонки, ИмяКолонки", НомерКолонки, ИмяКолонки);
		СведенияКолонок.Добавить(Сведения);
		
		НомерКолонки = НомерКолонки + 1;
		ЗначениеКолонки = ТабличныйДокумент.Область(НомерСтроки, НомерКолонки).Текст;
		
	КонецЦикла;
	
	НомерСтроки = НомерСтроки + 1;
	
	Пока ЕстьЗначенияВСтроке(ТабличныйДокумент, НомерСтроки, СведенияКолонок) Цикл
		
		Структура = Новый Структура;
		
		Для Каждого Сведения Из СведенияКолонок Цикл
			Значение = СокрЛП(ТабличныйДокумент.Область(НомерСтроки, Сведения.НомерКолонки).Текст);
			Структура.Вставить(Сведения.ИмяКолонки, Значение);
		КонецЦикла;
		
		МассивДанных.Добавить(Структура);
		
		НомерСтроки = НомерСтроки + 1;
		
	КонецЦикла;
	
	Возврат МассивДанных;
	
КонецФункции
	
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЕстьЗначенияВСтроке(ТабличныйДокумент, НомерСтроки, СведенияКолонок)
	
	ЕстьЗаполненныеЗначения = Ложь;
	
	Для Каждого Сведения Из СведенияКолонок Цикл
		Если ЕстьЗаполненныеЗначения Тогда
			Прервать;
		КонецЕсли;
		НомерКолонки = Сведения.НомерКолонки;
		ЕстьЗаполненныеЗначения = ЗначениеЗаполнено(ТабличныйДокумент.Область(НомерСтроки, НомерКолонки).Текст);
	КонецЦикла;
	
	Возврат ЕстьЗаполненныеЗначения;
	
КонецФункции

#КонецОбласти
