&НаСервере
Функция ПечатнаяФорма(ПараметрКоманды)
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ОтображатьСетку = Ложь;
	ТабличныйДокумент.Защита = Ложь;
	ТабличныйДокумент.ТолькоПросмотр = Ложь;
	ТабличныйДокумент.ОтображатьЗаголовки = Ложь;
	
	Сформирован = Ложь;
	
	Для каждого Ссылка Из ПараметрКоманды Цикл
		Документ = Ссылка.ПолучитьОбъект();
		Если НЕ Документ.Проведен Тогда
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Документ не проведен: " + Строка(Документ);
			Сообщение.КлючДанных = Ссылка;
			Сообщение.Сообщить();
			Продолжить;
		КонецЕсли;	
		Документ.ПечатнаяФорма(ТабличныйДокумент);
		Сформирован = Истина;
	КонецЦикла;	
	
	Если Сформирован Тогда
		Возврат ТабличныйДокумент;
	Иначе 	
		Возврат Неопределено;
	КонецЕсли;	
	
КонецФункции

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ТабличныйДокумент = ПечатнаяФорма(ПараметрКоманды);
	
	Если ТабличныйДокумент <> Неопределено Тогда
		ТабличныйДокумент.Показать();
	КонецЕсли;	
	
КонецПроцедуры
