//©///////////////////////////////////////////////////////////////////////////©//
//
//  Copyright 2021-2025 BIA-Technologies Limited Liability Company
//
//  Licensed under the Apache License, Version 2.0 (the "License");
//  you may not use this file except in compliance with the License.
//  You may obtain a copy of the License at
//
//      http://www.apache.org/licenses/LICENSE-2.0
//
//  Unless required by applicable law or agreed to in writing, software
//  distributed under the License is distributed on an "AS IS" BASIS,
//  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//  See the License for the specific language governing permissions and
//  limitations under the License.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область СлужебныйПрограммныйИнтерфейс

Процедура ИсполняемыеСценарии() Экспорт
	
	// Настройка базовых тегов Allure для дымовых тестов - должна быть в самом начале
	ЮТТесты.Настроить(ЮТАлюр
		.Epic("Дымовые тесты")
		.ParentSuite("Дымовые тесты")
		.Feature("Запись справочников"));
	
	Настройки = ЮТДымовыеТесты.ПараметрыВидаДымовогоТеста(КлючНастройки());
	
	Если НЕ Настройки.Использовать Тогда
		Возврат;
	КонецЕсли;
	
	ЮТТесты.ВТранзакции().УдалениеТестовыхДанных();	
	
	СправочникиДляЗаписи = ДТЗаписьСправочниковСлужебныйВызовСервера.СправочникиДляЗаписи();
	
	Если НЕ ЗначениеЗаполнено(СправочникиДляЗаписи) Тогда
		Возврат;
	КонецЕсли;
	
	ЮТТесты.ДобавитьТестовыйНабор("Запись справочников").Настроить(ЮТАлюр.Suite("Запись справочников"));
	
	Для Каждого ОписаниеСправочника Из СправочникиДляЗаписи Цикл
		ЗарегистрироватьТест(ОписаниеСправочника);
	КонецЦикла;	
	
КонецПроцедуры

#КонецОбласти      

#Область СлужебныеПроцедурыИФункции

Функция КлючНастройки()
	
	Возврат "ЗаписьСправочников";
	
КонецФункции

Процедура ЗарегистрироватьТест(ОписаниеСправочника)
	
	ПредставлениеОбъекта = СтрШаблон("Справочник.%1", ОписаниеСправочника.Имя);
	ПредставлениеТеста = СтрШаблон("%1.%2", ПредставлениеОбъекта, ОписаниеСправочника.Представление);
	
	ЮТТесты.ДобавитьСерверныйТест("ЗаписатьСправочник", ПредставлениеТеста, ОписаниеСправочника.Тег)
		.Настроить(ЮТАлюр
			.Story(ПредставлениеОбъекта)
			.SubSuite(ОписаниеСправочника.Имя)
			.Package("Smoke.ДТЗаписьСправочников." + ПредставлениеОбъекта + "." + ОписаниеСправочника.КлючНастройки))
		.СПараметрами(ОписаниеСправочника);
	
КонецПроцедуры

#КонецОбласти

#Область Тесты

Процедура ЗаписатьСправочник(ОписаниеСправочника) Экспорт
	
	СсылкаСправочника = ДТЗаписьСправочниковСлужебныйВызовСервера.СсылкаСправочника(
		ОписаниеСправочника.Имя, ОписаниеСправочника.КлючНастройки);
	
	Если НЕ ЗначениеЗаполнено(СсылкаСправочника) Тогда
		ЮТест.Пропустить(СтрШаблон("Не найдена подходящая запись справочника `Справочник.%1` для сценария `%2`",
							ОписаниеСправочника.Имя, ОписаниеСправочника.КлючНастройки));
	КонецЕсли;
	
	Попытка
		ОбъектСправочника = СсылкаСправочника.ПолучитьОбъект();
		ОбъектСправочника.Записать();
	Исключение
		ЮТРегистрацияОшибок.ДобавитьПояснениеОшибки(СтрШаблон("Ошибка записи справочника `%1`, сценарий `%2`",
														ОписаниеСправочника.Имя, ОписаниеСправочника.КлючНастройки));
		ВызватьИсключение;
	КонецПопытки;
		
КонецПроцедуры

#КонецОбласти

#Область Контекст

Функция Настройки() Экспорт
	
	Возврат ЮТКонтекстСлужебный.ЗначениеКонтекста(ИмяКонтекстаНастройки());
	
КонецФункции

Функция ИмяКонтекстаНастройки()
	
	Возврат "ДымовыеТесты_ЗаписьСправочников";
	
КонецФункции

#КонецОбласти

#Область ЗагрузкаНастроек

Функция ЗагрузитьНастройки(ЗагружаемаяНастройка)
	
	НастройкиТестов = НастройкиПоУмолчанию();
	Путь = "ДымовыеТесты.ЗаписьСправочников";
	
	Для Каждого Элемент Из ЗагружаемаяНастройка Цикл
		
		ЭтоБазоваяНастройка = ЮТДымовыеТестыСлужебныйКлиентСервер.ПрочитанБазовыеЭлементНастройки(НастройкиТестов,
																								  Элемент.Ключ,
																								  Элемент.Значение,
																								  Путь);
		
		Если ЭтоБазоваяНастройка Тогда
			Продолжить;
		ИначеЕсли ЭтоНастройкаЭлементовИГрупп(Элемент.Ключ) Тогда
			НастройкиТестов.Вставить(Элемент.Ключ, Элемент.Значение);
		ИначеЕсли ЮТМетаданные.ТипыМетаданных().Свойство(Элемент.Ключ) Тогда
			ПрочитатьНастройкиТипаМетаданных(НастройкиТестов, Элемент.Ключ, Элемент.Значение, Путь);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат НастройкиТестов;
	
КонецФункции

Процедура ПрочитатьНастройкиТипаМетаданных(НастройкиТестов, ИмяНастройки, ЗначениеНастройки, Путь)
	
	НастройкиТипаМетаданных = БазовоеОписаниеНастройкиЗаписиСправочников();
	ТипМетаданных = ЮТМетаданные.ТипыМетаданных()[ИмяНастройки];
	
	ЗагружаемаяНастройка = НормализованноеЗначениеНастройки(ЗначениеНастройки);
	
	Для Каждого Элемент Из ЗагружаемаяНастройка Цикл		
		ЭтоБазоваяНастройка = ЮТДымовыеТестыСлужебныйКлиентСервер.ПрочитанБазовыеЭлементНастройки(НастройкиТипаМетаданных,
																								  Элемент.Ключ,
																								  Элемент.Значение,
																								  Путь);
		
		Если ЭтоБазоваяНастройка Тогда
			Продолжить;
		ИначеЕсли ЭтоНастройкаЭлементовИГрупп(Элемент.Ключ) Тогда
			НастройкиТипаМетаданных.Вставить(Элемент.Ключ, Элемент.Значение);
			Продолжить;
		КонецЕсли;
		
		ОписаниеНастройкиСправочника = НастройкаСправочника(Элемент.Значение, Путь + "." + ИмяНастройки + "." + Элемент.Ключ);
		НастройкиТипаМетаданных.Вставить(Элемент.Ключ, ОписаниеНастройкиСправочника);
	КонецЦикла;
	
	НастройкиТестов.Вставить(ТипМетаданных.Имя, НастройкиТипаМетаданных);
	
КонецПроцедуры

Функция НастройкаСправочника(ЗначениеНастройки, Путь)
	
	Настройка = БазовоеОписаниеНастройкиЗаписиСправочников();
	ЗагружаемаяНастройка = НормализованноеЗначениеНастройки(ЗначениеНастройки);
	
	Для Каждого Элемент Из ЗагружаемаяНастройка Цикл
		
		ЭтоБазоваяНастройка = ЮТДымовыеТестыСлужебныйКлиентСервер.ПрочитанБазовыеЭлементНастройки(Настройка,
																								  Элемент.Ключ,
																								  Элемент.Значение,
																								  Путь);
		
		Если ЭтоБазоваяНастройка Тогда
			Продолжить;
		ИначеЕсли ЭтоНастройкаЭлементовИГрупп(Элемент.Ключ) Тогда
			Настройка.Вставить(Элемент.Ключ, Элемент.Значение);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Настройка;
	
КонецФункции

Функция НормализованноеЗначениеНастройки(Настройка)
	
	Если ТипЗнч(Настройка) = Тип("Булево") Тогда
		Возврат Новый Структура("Использовать", Настройка);
	Иначе
		Возврат Настройка;
	КонецЕсли;
	
КонецФункции

Функция НастройкиПоУмолчанию()
	
	Настройки = БазовоеОписаниеНастройкиЗаписиСправочников();
	Настройки.Использовать = Ложь;
	
	Возврат Настройки;
	
КонецФункции

Функция БазовоеОписаниеНастройкиЗаписиСправочников()
	
	Настройка = ЮТДымовыеТесты.БазовоеОписаниеЭлементаНастройки();
	Настройка.Вставить("Элементы", Истина);
	Настройка.Вставить("Группы", Истина);
	
	Возврат Настройка;
	
КонецФункции

Функция ЭтоНастройкаЭлементовИГрупп(Ключ)
	
	Возврат Ключ = "Элементы" Или Ключ = "Группы";
	
КонецФункции

#КонецОбласти
