//©///////////////////////////////////////////////////////////////////////////©//
//
//  Copyright 2021-2025 BIA-Technologies Limited Liability Company
//
//  Licensed under the Apache License, Version 2.0 (the "License");
//  you may not use this file except in compliance with the License.
//  You may obtain a copy of the License at
//
//      http://www.apache.org/licenses/LICENSE-2.0
//
//  Unless required by applicable law or agreed to in writing, software
//  distributed under the License is distributed on an "AS IS" BASIS,
//  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//  See the License for the specific language governing permissions and
//  limitations under the License.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область СлужебныйПрограммныйИнтерфейс

// Общий модуль с тестами
Процедура ИсполняемыеСценарии() Экспорт
	ЮТТесты.ВТранзакции().УдалениеТестовыхДанных()
		.ДобавитьТест("СсылкаПоРеквизитуПоКоду")
		.ДобавитьСерверныйТест("СсылкаПоРеквизитуПоНаименованию")
		.ДобавитьСерверныйТест("СсылкаПоРеквизитуНесуществующийКод")
		.ДобавитьСерверныйТест("СлучайнаяСсылкаБезОтборов")
		.ДобавитьТест("СлучайнаяСсылкаСПредикатом")
		.ДобавитьТест("СлучайнаяСсылкаСоСтруктурой")
		.ДобавитьТест("СлучайнаяСсылкаНесуществующийКод")
		.ДобавитьТест("СсылкаПоКоду")
		.ДобавитьТест("СсылкаПоНаименованию")
		.ДобавитьТест("СсылкаНесуществующийКод")
		.ДобавитьТест("СлучайнаяСсылкаДляДокумента")
		.ДобавитьТест("СлучайнаяСсылкаДляПланаВидовХарактеристик")
		.ДобавитьТест("СлучайнаяСсылкаДляПеречисления")
	;
КонецПроцедуры

// Тест поиска ссылки по наименованию
#Если Сервер Тогда
Процедура СсылкаПоРеквизитуПоНаименованию() Экспорт
	// Подготовка данных
	Контрагент = ЮТест.Данные().КонструкторОбъекта("Справочник.Контрагенты")
		.Установить("Наименование", "Тестовая организация")
		.Записать();
	
	// Выполнение тестируемого кода
	НайденнаяСсылка = ЮТТестовыеДанные.СсылкаПоРеквизиту(
		Метаданные.Справочники.Контрагенты,
		"Наименование",
		"Тестовая организация");
	
	// Проверки
	ЮТест.ОжидаетЧто(НайденнаяСсылка)
		.Равно(Контрагент);
КонецПроцедуры
#КонецЕсли

// Тест поиска ссылки по коду
Процедура СсылкаПоРеквизитуПоКоду() Экспорт
	// Подготовка данных
	Контрагент = ЮТест.Данные().КонструкторОбъекта("Справочник.Контрагенты")
		.Установить("Код", "000001")
		.Записать();
	
	// Выполнение тестируемого кода
	НайденнаяСсылка = ЮТТестовыеДанные.СсылкаПоРеквизиту(
		"Справочник.Контрагенты",
		"Код",
		"000001");
	
	// Проверки
	ЮТест.ОжидаетЧто(НайденнаяСсылка)
		.Равно(Контрагент);
КонецПроцедуры

// Тест поиска ссылки по несуществующему коду
#Если Сервер Тогда
Процедура СсылкаПоРеквизитуНесуществующийКод() Экспорт
	// Выполнение тестируемого кода
	НайденнаяСсылка = ЮТТестовыеДанные.СсылкаПоРеквизиту(
		Метаданные.Справочники.Контрагенты,
		"Код",
		"НесуществующийКод");
	
	// Проверки
	ЮТест.ОжидаетЧто(НайденнаяСсылка)
		.ЭтоНеопределено();
КонецПроцедуры
#КонецЕсли

// Тест получения случайной ссылки без отборов
#Если Сервер Тогда
Процедура СлучайнаяСсылкаБезОтборов() Экспорт
	// Подготовка данных
	Контрагент = ЮТест.Данные().КонструкторОбъекта("Справочник.Контрагенты")
		.Записать();
	
	// Выполнение тестируемого кода
	НайденнаяСсылка = ЮТТестовыеДанные.СлучайнаяСсылка(
		Метаданные.Справочники.Контрагенты,
		Неопределено);
	
	// Проверки
	ЮТест.ОжидаетЧто(НайденнаяСсылка)
		.Заполнено();
КонецПроцедуры
#КонецЕсли

Процедура СлучайнаяСсылкаДляДокумента() Экспорт
	// Подготовка данных
	Документ = ЮТест.Данные().КонструкторОбъекта("Документ.ПоступлениеДенег")
		.ФикцияОбязательныхПолей()
		.Записать();
	
	// Выполнение тестируемого кода
	НайденнаяСсылка = ЮТТестовыеДанные.СлучайнаяСсылка(
		"Документ.ПоступлениеДенег",
		Неопределено);
	
	// Проверки
	ЮТест.ОжидаетЧто(НайденнаяСсылка)
		.Заполнено();
КонецПроцедуры

Процедура СлучайнаяСсылкаДляПланаВидовХарактеристик() Экспорт
	// Подготовка данных
	ПВХ = ЮТест.Данные().КонструкторОбъекта("ПланВидовХарактеристик.ВидыСубконто")
		.Записать();
	
	// Выполнение тестируемого кода
	НайденнаяСсылка = ЮТТестовыеДанные.СлучайнаяСсылка(
		"ПланВидовХарактеристик.ВидыСубконто",
		Неопределено);
	
	// Проверки
	ЮТест.ОжидаетЧто(НайденнаяСсылка)
		.Заполнено();
КонецПроцедуры

Процедура СлучайнаяСсылкаДляПеречисления() Экспорт
	// Выполнение тестируемого кода
	НайденнаяСсылка = ЮТТестовыеДанные.СлучайнаяСсылка(
		"Перечисление.ВидыТоваров",
		Неопределено);
	
	// Проверки
	ЮТест.ОжидаетЧто(НайденнаяСсылка)
		.Заполнено()
		.ИмеетТип("ПеречислениеСсылка.ВидыТоваров");
КонецПроцедуры

// Тест получения случайной ссылки с предикатом
Процедура СлучайнаяСсылкаСПредикатом() Экспорт
	// Подготовка данных
	Контрагент = ЮТест.Данные().КонструкторОбъекта("Справочник.Контрагенты")
		.Установить("Код", "000001")
		.Записать();
	
	// Выполнение тестируемого кода
	НайденнаяСсылка = ЮТТестовыеДанные.СлучайнаяСсылка(
		"Справочники.Контрагенты",
		ЮТест.Предикат().Реквизит("Код").Равно("000001"));
	
	// Проверки
	ЮТест.ОжидаетЧто(НайденнаяСсылка)
		.Равно(Контрагент);
КонецПроцедуры

// Тест получения случайной ссылки со структурой
Процедура СлучайнаяСсылкаСоСтруктурой() Экспорт
	// Подготовка данных
	Контрагент = ЮТест.Данные().КонструкторОбъекта("Справочник.Контрагенты")
		.Установить("Код", "000001")
		.Записать();
	
	// Выполнение тестируемого кода
	НайденнаяСсылка = ЮТТестовыеДанные.СлучайнаяСсылка(
		"Справочник.Контрагенты",
		Новый Структура("Код", "000001"));
	
	// Проверки
	ЮТест.ОжидаетЧто(НайденнаяСсылка)
		.Равно(Контрагент);
КонецПроцедуры

// Тест получения случайной ссылки с несуществующим кодом
Процедура СлучайнаяСсылкаНесуществующийКод() Экспорт
	// Выполнение тестируемого кода
	НайденнаяСсылка = ЮТТестовыеДанные.СлучайнаяСсылка(
		"Справочник.Контрагенты",
		ЮТест.Предикат().Реквизит("Код").Равно("НесуществующийКод"));
	
	// Проверки
	ЮТест.ОжидаетЧто(НайденнаяСсылка)
		.ЭтоНеопределено();
КонецПроцедуры

// Тест поиска ссылки по коду
Процедура СсылкаПоКоду() Экспорт
	// Подготовка данных
	Код = "987654";
	Контрагент = ЮТест.Данные().КонструкторОбъекта("Справочник.Контрагенты")
		.Установить("Код", Код)
		.Записать();
	
	// Выполнение тестируемого кода
	НайденнаяСсылка = ЮТТестовыеДанные.Ссылка(
		"Справочники.Контрагенты",
		Код,
		Неопределено);
	
	// Проверки
	ЮТест.ОжидаетЧто(НайденнаяСсылка)
		.Равно(Контрагент);
КонецПроцедуры

// Тест поиска ссылки по наименованию
Процедура СсылкаПоНаименованию() Экспорт
	// Подготовка данных
	Наименование = ЮТест.Данные().СлучайнаяСтрока();
	Контрагент = ЮТест.Данные().КонструкторОбъекта("Справочник.Контрагенты")
		.Установить("Наименование", Наименование)
		.Записать();
	
	// Выполнение тестируемого кода
	НайденнаяСсылка = ЮТТестовыеДанные.Ссылка(
		"Справочники.Контрагенты",
		Наименование,
		Неопределено);
	
	// Проверки
	ЮТест.ОжидаетЧто(НайденнаяСсылка)
		.Равно(Контрагент);
КонецПроцедуры

// Тест поиска ссылки по несуществующему коду
Процедура СсылкаНесуществующийКод() Экспорт
	// Выполнение тестируемого кода
	НайденнаяСсылка = ЮТТестовыеДанные.Ссылка(
		"Справочники.Контрагенты",
		"НесуществующийКод",
		Неопределено);
	
	// Проверки
	ЮТест.ОжидаетЧто(НайденнаяСсылка)
		.ЭтоНеопределено();
КонецПроцедуры

#КонецОбласти

