#Область СлужебныйПрограммныйИнтерфейс

Процедура ИсполняемыеСценарии() Экспорт
	
	ЮТТесты
		.ДобавитьТест("Формы")
	;
	
КонецПроцедуры

Процедура Формы() Экспорт
	
	Отборы = Новый Структура("Использовать, Исключения", Истина, Новый Массив);
	Коллекции = ЮТКоллекции.ЗначениеВМассиве("Справочники", "Документы");
	ВладельцыФорм = ЮТДымовыеТестыСлужебныйВызовСервера.Формы(Коллекции, Отборы);
	
	ЮТест.ОжидаетЧто(ВладельцыФорм)
		.ИмеетТип("Массив")
		.Заполнено()
		.Содержит(ЮТест.Предикат().Реквизит("Тип").Равно("Справочник"))
		.Содержит(ЮТест.Предикат().Реквизит("Тип").Равно("Документ"))
		.Содержит(ЮТест.Предикат().Реквизит("Имя").Равно("ВходящиеПисьма"))
		.Содержит(ЮТест.Предикат().Реквизит("Имя").Равно("ОперацияПоУчетуТоваров"));
	
	Отборы.Исключения.Добавить("*Письма");
	Отборы.Вставить("Документы", Новый Структура("Использовать", Ложь));
	ВладельцыФорм = ЮТДымовыеТестыСлужебныйВызовСервера.Формы(Коллекции, Отборы);
	
	ЮТест.ОжидаетЧто(ВладельцыФорм)
		.ИмеетТип("Массив")
		.Заполнено()
		.НеСодержит(ЮТест.Предикат().Реквизит("Имя").Равно("ВходящиеПисьма"))
		.НеСодержит(ЮТест.Предикат().Реквизит("Имя").Равно("ИсходящиеПисьма"))
		.НеСодержит(ЮТест.Предикат().Реквизит("Имя").Равно("ОперацияПоУчетуТоваров"))
		.НеСодержит(ЮТест.Предикат().Реквизит("Тип").Равно("Документ"));
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
