//©///////////////////////////////////////////////////////////////////////////©//
//
//  Copyright 2021-2025 BIA-Technologies Limited Liability Company
//
//  Licensed under the Apache License, Version 2.0 (the "License");
//  you may not use this file except in compliance with the License.
//  You may obtain a copy of the License at
//
//      http://www.apache.org/licenses/LICENSE-2.0
//
//  Unless required by applicable law or agreed to in writing, software
//  distributed under the License is distributed on an "AS IS" BASIS,
//  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//  See the License for the specific language governing permissions and
//  limitations under the License.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область СлужебныйПрограммныйИнтерфейс

// Регистрация тестовых сценариев
//
Процедура ИсполняемыеСценарии() Экспорт
	ЮТТесты
		.ДобавитьТест("Реквизит")
		.ДобавитьТест("Свойство")
		.ДобавитьТест("Равно")
		.ДобавитьТест("НеРавно")
		.ДобавитьТест("Заполнено")
		.ДобавитьТест("НеЗаполнено")
		.ДобавитьТест("Пусто")
		.ДобавитьТест("Больше")
		.ДобавитьТест("БольшеИлиРавно")
		.ДобавитьТест("Меньше")
		.ДобавитьТест("МеньшеИлиРавно")
		.ДобавитьТест("ИмеетТип")
		.ДобавитьТест("ИмеетТипОтличныйОт")
		.ДобавитьТест("ИмеетДлину")
		.ДобавитьТест("ИмеетДлинуОтличнуюОт")
		.ДобавитьТест("ИмеетСвойство")
		.ДобавитьТест("НеИмеетСвойства")
		.ДобавитьТест("Содержит")
		.ДобавитьТест("НеСодержит")
		.ДобавитьТест("СодержитСтрокуПоШаблону")
		.ДобавитьТест("НеСодержитСтрокуПоШаблону")
		.ДобавитьТест("ВСписке")
		.ДобавитьТест("Между")
		.ДобавитьТест("МеждуВключаяГраницы")
		.ДобавитьТест("МеждуИсключаяГраницы")
		.ДобавитьТест("МеждуВключаяНачалоГраницы")
		.ДобавитьТест("МеждуВключаяОкончаниеГраницы")
		.ДобавитьТест("Получить")
		.ДобавитьТест("Выражения");
КонецПроцедуры

// Тест метода Реквизит
//
Процедура Реквизит() Экспорт
	
	// Выполнение
	Предикат = ЮТест.Предикат()
		.Реквизит("Код")
		.Равно("001")
		.Получить();
	
	// Проверка
	ЮТест.ОжидаетЧто(Предикат)
		.Свойство("[0].ИмяРеквизита").Равно("Код")
		.Свойство("[0].ВидСравнения").Равно("Равно")
		.Свойство("[0].Значение").Равно("001");
КонецПроцедуры

// Тест метода Свойство
//
Процедура Свойство() Экспорт
	
	// Выполнение
	Предикат = ЮТест.Предикат()
		.Свойство("Наименование")
		.Равно("Тест")
		.Получить();
	
	// Проверка
	ЮТест.ОжидаетЧто(Предикат)
		.Свойство("[0].ИмяРеквизита").Равно("Наименование")
		.Свойство("[0].ВидСравнения").Равно("Равно")
		.Свойство("[0].Значение").Равно("Тест");
КонецПроцедуры

// Тест метода Равно
//
Процедура Равно() Экспорт
	
	// Выполнение
	Предикат = ЮТест.Предикат()
		.Реквизит("Код")
		.Равно("001")
		.Получить();
	
	// Проверка
	ЮТест.ОжидаетЧто(Предикат)
		.Свойство("[0].ВидСравнения").Равно("Равно")
		.Свойство("[0].Значение").Равно("001");
КонецПроцедуры

// Тест метода НеРавно
//
Процедура НеРавно() Экспорт
	
	// Выполнение
	Предикат = ЮТест.Предикат()
		.Реквизит("Код")
		.НеРавно("002")
		.Получить();
	
	// Проверка
	ЮТест.ОжидаетЧто(Предикат)
		.Свойство("[0].ВидСравнения").Равно("НеРавно")
		.Свойство("[0].Значение").Равно("002");
КонецПроцедуры

// Тест метода Заполнено
//
Процедура Заполнено() Экспорт
	
	// Выполнение
	Предикат = ЮТест.Предикат()
		.Реквизит("Код")
		.Заполнено()
		.Получить();
	
	// Проверка
	ЮТест.ОжидаетЧто(Предикат)
		.Свойство("[0].ВидСравнения").Равно("Заполнено");
КонецПроцедуры

// Тест метода НеЗаполнено
//
Процедура НеЗаполнено() Экспорт
	
	// Выполнение
	Предикат = ЮТест.Предикат()
		.Реквизит("Комментарий")
		.НеЗаполнено()
		.Получить();
	
	// Проверка
	ЮТест.ОжидаетЧто(Предикат)
		.Свойство("[0].ВидСравнения").Равно("НеЗаполнено");
КонецПроцедуры

// Тест метода Пусто
//
Процедура Пусто() Экспорт
	
	// Выполнение
	Предикат = ЮТест.Предикат()
		.Реквизит("Комментарий")
		.Пусто()
		.Получить();
	
	// Проверка
	ЮТест.ОжидаетЧто(Предикат)
		.Свойство("[0].ВидСравнения").Равно("НеЗаполнено");
КонецПроцедуры

// Тест метода Больше
//
Процедура Больше() Экспорт
	
	// Выполнение
	Предикат = ЮТест.Предикат()
		.Реквизит("Количество")
		.Больше(5)
		.Получить();
	
	// Проверка
	ЮТест.ОжидаетЧто(Предикат)
		.Свойство("[0].ВидСравнения").Равно("Больше")
		.Свойство("[0].Значение").Равно(5);
КонецПроцедуры

// Тест метода БольшеИлиРавно
//
Процедура БольшеИлиРавно() Экспорт
	
	// Выполнение
	Предикат = ЮТест.Предикат()
		.Реквизит("Количество")
		.БольшеИлиРавно(10)
		.Получить();
	
	// Проверка
	ЮТест.ОжидаетЧто(Предикат)
		.Свойство("[0].ВидСравнения").Равно("БольшеРавно")
		.Свойство("[0].Значение").Равно(10);
КонецПроцедуры

// Тест метода Меньше
//
Процедура Меньше() Экспорт
	
	// Выполнение
	Предикат = ЮТест.Предикат()
		.Реквизит("Количество")
		.Меньше(15)
		.Получить();
	
	// Проверка
	ЮТест.ОжидаетЧто(Предикат)
		.Свойство("[0].ВидСравнения").Равно("Меньше")
		.Свойство("[0].Значение").Равно(15);
КонецПроцедуры

// Тест метода МеньшеИлиРавно
//
Процедура МеньшеИлиРавно() Экспорт
	
	// Выполнение
	Предикат = ЮТест.Предикат()
		.Реквизит("Количество")
		.МеньшеИлиРавно(10)
		.Получить();
	
	// Проверка
	ЮТест.ОжидаетЧто(Предикат)
		.Свойство("[0].ВидСравнения").Равно("МеньшеРавно")
		.Свойство("[0].Значение").Равно(10);
КонецПроцедуры

// Тест метода ИмеетТип
//
Процедура ИмеетТип() Экспорт
	
	// Выполнение
	Предикат = ЮТест.Предикат()
		.Реквизит("Количество")
		.ИмеетТип(Тип("Число"))
		.Получить();
	
	// Проверка
	ЮТест.ОжидаетЧто(Предикат)
		.Свойство("[0].ВидСравнения").Равно("ИмеетТип")
		.Свойство("[0].Значение").Равно(Тип("Число"));
КонецПроцедуры

// Тест метода ИмеетТипОтличныйОт
//
Процедура ИмеетТипОтличныйОт() Экспорт
	
	// Выполнение
	Предикат = ЮТест.Предикат()
		.Реквизит("Количество")
		.ИмеетТипОтличныйОт(Тип("Строка"))
		.Получить();
	
	// Проверка
	ЮТест.ОжидаетЧто(Предикат)
		.Свойство("[0].ВидСравнения").Равно("НеИмеетТип")
		.Свойство("[0].Значение").Равно(Тип("Строка"));
КонецПроцедуры

// Тест метода ИмеетДлину
//
Процедура ИмеетДлину() Экспорт
	
	// Выполнение
	Предикат = ЮТест.Предикат()
		.Реквизит("Код")
		.ИмеетДлину(3)
		.Получить();
	
	// Проверка
	ЮТест.ОжидаетЧто(Предикат)
		.Свойство("[0].ВидСравнения").Равно("ИмеетДлину")
		.Свойство("[0].Значение").Равно(3);
КонецПроцедуры

// Тест метода ИмеетДлинуОтличнуюОт
//
Процедура ИмеетДлинуОтличнуюОт() Экспорт
	
	// Выполнение
	Предикат = ЮТест.Предикат()
		.Реквизит("Код")
		.ИмеетДлинуОтличнуюОт(2)
		.Получить();
	
	// Проверка
	ЮТест.ОжидаетЧто(Предикат)
		.Свойство("[0].ВидСравнения").Равно("НеИмеетДлину")
		.Свойство("[0].Значение").Равно(2);
КонецПроцедуры

// Тест метода ИмеетСвойство
//
Процедура ИмеетСвойство() Экспорт
	
	// Выполнение
	Предикат = ЮТест.Предикат()
		.Реквизит("Данные")
		.ИмеетСвойство("Код")
		.Получить();
	
	// Проверка
	ЮТест.ОжидаетЧто(Предикат)
		.Свойство("[0].ВидСравнения").Равно("ИмеетСвойство")
		.Свойство("[0].Значение").Равно("Код");
КонецПроцедуры

// Тест метода НеИмеетСвойства
//
Процедура НеИмеетСвойства() Экспорт
	
	// Выполнение
	Предикат = ЮТест.Предикат()
		.Реквизит("Данные")
		.НеИмеетСвойства("Комментарий")
		.Получить();
	
	// Проверка
	ЮТест.ОжидаетЧто(Предикат)
		.Свойство("[0].ВидСравнения").Равно("НеИмеетСвойство")
		.Свойство("[0].Значение").Равно("Комментарий");
КонецПроцедуры

// Тест метода Содержит
//
Процедура Содержит() Экспорт
	
	// Выполнение
	Предикат = ЮТест.Предикат()
		.Реквизит("Наименование")
		.Содержит("Тест")
		.Получить();
	
	// Проверка
	ЮТест.ОжидаетЧто(Предикат)
		.Свойство("[0].ВидСравнения").Равно("Содержит")
		.Свойство("[0].Значение").Равно("Тест");
КонецПроцедуры

// Тест метода НеСодержит
//
Процедура НеСодержит() Экспорт
	
	// Выполнение
	Предикат = ЮТест.Предикат()
		.Реквизит("Наименование")
		.НеСодержит("Ошибка")
		.Получить();
	
	// Проверка
	ЮТест.ОжидаетЧто(Предикат)
		.Свойство("[0].ВидСравнения").Равно("НеСодержит")
		.Свойство("[0].Значение").Равно("Ошибка");
КонецПроцедуры

// Тест метода СодержитСтрокуПоШаблону
//
Процедура СодержитСтрокуПоШаблону() Экспорт
	
	// Выполнение
	Предикат = ЮТест.Предикат()
		.Реквизит("Код")
		.СодержитСтрокуПоШаблону("\d{3}")
		.Получить();
	
	// Проверка
	ЮТест.ОжидаетЧто(Предикат)
		.Свойство("[0].ВидСравнения").Равно("СодержитСтрокуПоШаблону")
		.Свойство("[0].Значение").Равно("\d{3}");
КонецПроцедуры

// Тест метода НеСодержитСтрокуПоШаблону
//
Процедура НеСодержитСтрокуПоШаблону() Экспорт
	
	// Выполнение
	Предикат = ЮТест.Предикат()
		.Реквизит("Код")
		.НеСодержитСтрокуПоШаблону("[А-Я]")
		.Получить();
	
	// Проверка
	ЮТест.ОжидаетЧто(Предикат)
		.Свойство("[0].ВидСравнения").Равно("НеСодержитСтрокуПоШаблону")
		.Свойство("[0].Значение").Равно("[А-Я]");
КонецПроцедуры

// Тест метода ВСписке
//
Процедура ВСписке() Экспорт
	// Подготовка
	СписокКодов = Новый Массив;
	СписокКодов.Добавить("001");
	СписокКодов.Добавить("002");
	
	// Выполнение
	Предикат = ЮТест.Предикат()
		.Реквизит("Код")
		.ВСписке(СписокКодов)
		.Получить();
	
	// Проверка
	ЮТест.ОжидаетЧто(Предикат)
		.Свойство("[0].ВидСравнения").Равно("ВСписке")
		.Свойство("[0].Значение").Равно(СписокКодов);
КонецПроцедуры

// Тест метода Между
//
Процедура Между() Экспорт
	
	// Выполнение
	Предикат = ЮТест.Предикат()
		.Реквизит("Количество")
		.Между(5, 15)
		.Получить();
	
	// Проверка
	ЮТест.ОжидаетЧто(Предикат)
		.Свойство("[0].ВидСравнения").Равно("МеждуВключаяГраницы")
		.Свойство("[0].Значение").Равно(5)
		.Свойство("[0].ОкончаниеИнтервала").Равно(15);
КонецПроцедуры

// Тест метода МеждуВключаяГраницы
//
Процедура МеждуВключаяГраницы() Экспорт
	
	// Выполнение
	Предикат = ЮТест.Предикат()
		.Реквизит("Количество")
		.МеждуВключаяГраницы(5, 15)
		.Получить();
	
	// Проверка
	ЮТест.ОжидаетЧто(Предикат)
		.Свойство("[0].ВидСравнения").Равно("МеждуВключаяГраницы")
		.Свойство("[0].Значение").Равно(5)
		.Свойство("[0].ОкончаниеИнтервала").Равно(15);
КонецПроцедуры

// Тест метода МеждуИсключаяГраницы
//
Процедура МеждуИсключаяГраницы() Экспорт
	
	// Выполнение
	Предикат = ЮТест.Предикат()
		.Реквизит("Количество")
		.МеждуИсключаяГраницы(5, 15)
		.Получить();
	
	// Проверка
	ЮТест.ОжидаетЧто(Предикат)
		.Свойство("[0].ВидСравнения").Равно("МеждуИсключаяГраницы")
		.Свойство("[0].Значение").Равно(5)
		.Свойство("[0].ОкончаниеИнтервала").Равно(15);
КонецПроцедуры

// Тест метода МеждуВключаяНачалоГраницы
//
Процедура МеждуВключаяНачалоГраницы() Экспорт
	
	// Выполнение
	Предикат = ЮТест.Предикат()
		.Реквизит("Количество")
		.МеждуВключаяНачалоГраницы(5, 15)
		.Получить();
	
	// Проверка
	ЮТест.ОжидаетЧто(Предикат)
		.Свойство("[0].ВидСравнения").Равно("МеждуВключаяНачалоГраницы")
		.Свойство("[0].Значение").Равно(5)
		.Свойство("[0].ОкончаниеИнтервала").Равно(15);
КонецПроцедуры

// Тест метода МеждуВключаяОкончаниеГраницы
//
Процедура МеждуВключаяОкончаниеГраницы() Экспорт
	
	// Выполнение
	Предикат = ЮТест.Предикат()
		.Реквизит("Количество")
		.МеждуВключаяОкончаниеГраницы(5, 15)
		.Получить();
	
	// Проверка
	ЮТест.ОжидаетЧто(Предикат)
		.Свойство("[0].ВидСравнения").Равно("МеждуВключаяОкончаниеГраницы")
		.Свойство("[0].Значение").Равно(5)
		.Свойство("[0].ОкончаниеИнтервала").Равно(15);
КонецПроцедуры

// Тест метода Получить
//
Процедура Получить() Экспорт
	
	// Выполнение
	Предикат1 = ЮТест.Предикат()
		.Реквизит("Код")
		.Равно("001")
		.Получить();
		
	Предикат2 = ЮТест.Предикат()
		.Реквизит("Код")
		.Равно("001")
		.Получить();
	
	// Проверка
	ЮТест.ОжидаетЧто(Предикат1)
		.Свойство("[0].ИмяРеквизита").Равно(Предикат2[0].ИмяРеквизита)
		.Свойство("[0].ВидСравнения").Равно(Предикат2[0].ВидСравнения)
		.Свойство("[0].Значение").Равно(Предикат2[0].Значение);
КонецПроцедуры

// Тест метода Выражения
//
Процедура Выражения() Экспорт
	// Подготовка
	Выражения = ЮТПредикаты.Выражения();
	
	// Проверка
	ЮТест.ОжидаетЧто(Выражения)
		.Свойство("Равно").Равно("Равно")
		.Свойство("НеРавно").Равно("НеРавно")
		.Свойство("Заполнено").Равно("Заполнено")
		.Свойство("НеЗаполнено").Равно("НеЗаполнено")
		.Свойство("Больше").Равно("Больше")
		.Свойство("БольшеРавно").Равно("БольшеРавно")
		.Свойство("Меньше").Равно("Меньше")
		.Свойство("МеньшеРавно").Равно("МеньшеРавно")
		.Свойство("ИмеетТип").Равно("ИмеетТип")
		.Свойство("НеИмеетТип").Равно("НеИмеетТип")
		.Свойство("ИмеетДлину").Равно("ИмеетДлину")
		.Свойство("НеИмеетДлину").Равно("НеИмеетДлину")
		.Свойство("ИмеетСвойство").Равно("ИмеетСвойство")
		.Свойство("НеИмеетСвойство").Равно("НеИмеетСвойство")
		.Свойство("Содержит").Равно("Содержит")
		.Свойство("НеСодержит").Равно("НеСодержит")
		.Свойство("СодержитСтрокуПоШаблону").Равно("СодержитСтрокуПоШаблону")
		.Свойство("НеСодержитСтрокуПоШаблону").Равно("НеСодержитСтрокуПоШаблону")
		.Свойство("ВСписке").Равно("ВСписке")
		.Свойство("МеждуВключаяГраницы").Равно("МеждуВключаяГраницы")
		.Свойство("МеждуИсключаяГраницы").Равно("МеждуИсключаяГраницы")
		.Свойство("МеждуВключаяНачалоГраницы").Равно("МеждуВключаяНачалоГраницы")
		.Свойство("МеждуВключаяОкончаниеГраницы").Равно("МеждуВключаяОкончаниеГраницы");
КонецПроцедуры

#КонецОбласти
