//©///////////////////////////////////////////////////////////////////////////©//
//
//  Copyright 2021-2023 BIA-Technologies Limited Liability Company
//
//  Licensed under the Apache License, Version 2.0 (the "License");
//  you may not use this file except in compliance with the License.
//  You may obtain a copy of the License at
//
//      http://www.apache.org/licenses/LICENSE-2.0
//
//  Unless required by applicable law or agreed to in writing, software
//  distributed under the License is distributed on an "AS IS" BASIS,
//  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//  See the License for the specific language governing permissions and
//  limitations under the License.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область СлужебныйПрограммныйИнтерфейс

Функция ЗагрузитьИзМакета(Макет, ОписанияТипов, КэшЗначений, ЗаменяемыеЗначения, ПараметрыЗаполнения) Экспорт
	
	ДанныеМакета = ДанныеМакета(Макет);
	ТипДанныхМакета = ТипЗнч(ДанныеМакета);
	
	Если ТипДанныхМакета = Тип("ТабличныйДокумент") Тогда
		Результат = ЗагрузитьДанныеИзТабличногоДокумента(ДанныеМакета, ОписанияТипов, ЗаменяемыеЗначения, КэшЗначений, ПараметрыЗаполнения);
	ИначеЕсли ТипДанныхМакета = Тип("ТекстовыйДокумент") ИЛИ ТипДанныхМакета = Тип("Строка") Тогда
		Результат = ЗагрузитьДанныеИзСтроки(ДанныеМакета, ОписанияТипов, ЗаменяемыеЗначения, КэшЗначений, ПараметрыЗаполнения);
	Иначе
		ВызватьИсключение "Макет должен быть либо табличным, либо текстовым документом";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЗагрузитьДанныеИзТабличногоДокумента(ДанныеМакета, ОписанияТипов, ЗаменяемыеЗначения, КэшЗначений, ПараметрыЗаполнения)
	
	КолонкиМакета = Новый Массив();
	Для Инд = 1 По ДанныеМакета.ШиринаТаблицы Цикл
		ИмяКолонки = ДанныеМакета.Область(1, Инд).Текст;
		КолонкиМакета.Добавить(ИмяКолонки);
	КонецЦикла;
	
	ПараметрыЗагрузки = ПараметрыЗагрузки(КолонкиМакета, ОписанияТипов, ЗаменяемыеЗначения, КэшЗначений, ПараметрыЗаполнения);
	
	Выборка = ВыборкаИзТабличногоДокумента(ДанныеМакета);
	
	Пока Выборка.Следующий() Цикл
		
		Строка = ПараметрыЗагрузки.Таблица.Добавить();
		
		Для Каждого ОписаниеКолонки Из ПараметрыЗагрузки.ОписаниеКолонок Цикл
			
			ЗначениеПредставления = Выборка[ОписаниеКолонки.Индекс];
			
			Если ПустаяСтрока(ЗначениеПредставления) Тогда
				Продолжить;
			КонецЕсли;
			
			Значение = ЗначениеЯчейки(Выборка,
									  ЗначениеПредставления,
									  ОписаниеКолонки,
									  ЗаменяемыеЗначения,
									  КэшЗначений,
									  ПараметрыЗагрузки.ПараметрыСоздания);
			Строка[ОписаниеКолонки.Имя] = Значение;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ПараметрыЗагрузки.Таблица;
	
КонецФункции

Функция ЗагрузитьДанныеИзСтроки(ДанныеМакета, ОписанияТипов, ЗаменяемыеЗначения, КэшЗначений, ПараметрыЗаполнения)
	
	Разделитель = "|";
	ПараметрыИтератора = ПараметрыИтератора(ДанныеМакета);
	
	Пока СледующаяСтрока(ПараметрыИтератора) Цикл
		
		Строка = СокрЛП(ПараметрыИтератора.Строка);
		
		Если НЕ СтрНачинаетсяС(Строка, Разделитель) Тогда
			Продолжить;
		КонецЕсли;
		
		КолонкиМакета = ЮТОбщий.РазложитьСтрокуВМассивПодстрок(Строка, Разделитель, Истина);
		
		СледующаяСтрока(ПараметрыИтератора);
		Прервать;
		
	КонецЦикла;
	
	ПараметрыЗагрузки = ПараметрыЗагрузки(КолонкиМакета, ОписанияТипов, ЗаменяемыеЗначения, КэшЗначений, ПараметрыЗаполнения);
	
	Пока СледующаяСтрока(ПараметрыИтератора) Цикл
		
		Строка = СокрЛП(ПараметрыИтератора.Строка);
		
		Если ПустаяСтрока(Строка) Тогда
			Продолжить;
		ИначеЕсли НЕ СтрНачинаетсяС(Строка, Разделитель) Тогда
			Прервать;
		КонецЕсли;
		
		СтрокаДанных = ПараметрыЗагрузки.Таблица.Добавить();
		Блоки = ЮТОбщий.РазложитьСтрокуВМассивПодстрок(Строка, Разделитель, Истина);
		
		Для Каждого ОписаниеКолонки Из ПараметрыЗагрузки.ОписаниеКолонок Цикл
			
			ЗначениеПредставления = Блоки[ОписаниеКолонки.Индекс];
			
			Если ПустаяСтрока(ЗначениеПредставления) Тогда
				Продолжить;
			КонецЕсли;
			
			Значение = ЗначениеЯчейки(Блоки,
									  ЗначениеПредставления,
									  ОписаниеКолонки,
									  ЗаменяемыеЗначения,
									  КэшЗначений,
									  ПараметрыЗагрузки.ПараметрыСоздания);
			СтрокаДанных[ОписаниеКолонки.Имя] = Значение;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ПараметрыЗагрузки.Таблица;
	
КонецФункции

Функция ПараметрыИтератора(Источник)
	
	ПараметрыЧтения = Новый Структура;
	
	ПараметрыЧтения.Вставить("ИзТекстовогоДокумента", Ложь);
	ПараметрыЧтения.Вставить("ИзЧтенияТекста", Ложь);
	ПараметрыЧтения.Вставить("ИзВыборки", Ложь);
	ПараметрыЧтения.Вставить("ДостиглиКонца", Ложь);
	ПараметрыЧтения.Вставить("Строка", Неопределено);
	
	ТипЗначения = ТипЗнч(Источник);
	
	Если ТипЗначения = Тип("ТекстовыйДокумент") Тогда
		ПараметрыЧтения.ИзТекстовогоДокумента = Истина;
		ПараметрыЧтения.Вставить("ТекстовыйДокумент", Источник);
		ПараметрыЧтения.Вставить("КоличествоСтрок", Источник.КоличествоСтрок());
		ПараметрыЧтения.Вставить("ИндексСтроки", 0);
	ИначеЕсли ТипЗначения = Тип("Строка") Тогда
		ПараметрыЧтения.ИзЧтенияТекста = Истина;
		Кодировка = КодировкаТекста.UTF8;
		Поток = ПолучитьДвоичныеДанныеИзСтроки(Источник, Кодировка).ОткрытьПотокДляЧтения();
		Чтение = Новый ЧтениеТекста(Поток, Кодировка);
		ПараметрыЧтения.Вставить("Чтение", Чтение);
		ПараметрыЧтения.Вставить("Поток", Поток);
	ИначеЕсли ТипЗначения = Тип("ВыборкаДанных") Тогда
		ПараметрыЧтения.ИзВыборки = Истина;
		ПараметрыЧтения.Вставить("Выборка", Источник);
	Иначе
		ВызватьИсключение "Неподдерживаемый параметр";
	КонецЕсли;
	
	Возврат ПараметрыЧтения;
	
КонецФункции

Функция СледующаяСтрока(ПараметрыЧтения)
	
	Если ПараметрыЧтения.ДостиглиКонца Тогда
		ВызватьИсключение "Построчное чтение уже завершено. Обнаружена попытка чтения завершенного потока";
	КонецЕсли;
	
	Если ПараметрыЧтения.ИзТекстовогоДокумента Тогда
		
		ЮТОбщий.Инкремент(ПараметрыЧтения.ИндексСтроки);
		Если ПараметрыЧтения.ИндексСтроки > ПараметрыЧтения.КоличествоСтрок Тогда
			ПараметрыЧтения.ДостиглиКонца = Истина;
			Возврат Ложь;
		КонецЕсли;
		ПараметрыЧтения.Строка = ПараметрыЧтения.ТекстовыйДокумент.ПолучитьСтроку(ПараметрыЧтения.ИндексСтроки);
		
	ИначеЕсли ПараметрыЧтения.ИзЧтенияТекста Тогда
		
		ПараметрыЧтения.Строка = ПараметрыЧтения.Чтение.ПрочитатьСтроку();
		
		Если ПараметрыЧтения.Строка = Неопределено Тогда
			ПараметрыЧтения.Чтение.Закрыть();
			ПараметрыЧтения.Поток.Закрыть();
			ПараметрыЧтения.ДостиглиКонца = Истина;
			Возврат Ложь;
		КонецЕсли;
		
	ИначеЕсли ПараметрыЧтения.ИзВыборки Тогда
		
		Если ПараметрыЧтения.Выборка.Следующий() Тогда
			ПараметрыЧтения.Строка = ПараметрыЧтения.Выборка;
		Иначе
			ПараметрыЧтения.ДостиглиКонца = Истина;
			ПараметрыЧтения.Строка = Неопределено;
			Возврат Ложь;
		КонецЕсли;
		
	Иначе
		
		ВызватьИсключение "Некорректные/неподдерживаемые параметры чтения";
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ВыборкаИзТабличногоДокумента(ТабличныйДокумент)
	
	ВсегоСтрок = ТабличныйДокумент.ВысотаТаблицы;
	ВсегоКолонок = ТабличныйДокумент.ШиринаТаблицы;
	
	Область = ТабличныйДокумент.Область(1, 1, ВсегоСтрок, ВсегоКолонок);
	
	ИсточникДанных = Новый ОписаниеИсточникаДанных(Область);
	ПостроительОтчета = Новый ПостроительОтчета;
	ПостроительОтчета.ИсточникДанных = ИсточникДанных;
	ПостроительОтчета.Выполнить();
	
	Возврат ПостроительОтчета.Результат.Выбрать();
	
КонецФункции

Функция ДанныеМакета(Знач Макет)
	
	ТипПараметра = ТипЗнч(Макет);
	ДанныеМакета = Неопределено;
	
	ПараметрыСодержитДанные = ТипПараметра = Тип("ТабличныйДокумент")
							  Или ТипПараметра = Тип("ТекстовыйДокумент")
							  Или ТипПараметра = Тип("Строка")
							  И СтрНачинаетсяС(Макет, "|");
	
	Если ПараметрыСодержитДанные Тогда
		ДанныеМакета = Макет;
	ИначеЕсли ТипПараметра = Тип("Строка") Тогда
		ДанныеМакета = ЮТОбщийВызовСервера.Макет(Макет);
	Иначе
		ВызватьИсключение ЮТОбщий.НеподдерживаемыйПараметрМетода("ЮТТестовыеДанныеВызовСервера.ДанныеМакета", Макет);
	КонецЕсли;
	
	Возврат ДанныеМакета;
	
КонецФункции

Функция ЗначениеЯчейки(СтрокаДанных, ЗначениеПредставления, ОписаниеКолонки, ЗаменяемыеЗначения, КэшЗначений, ПараметрыСоздания)
	
	Значение = ЗаменяемыеЗначения[ЗначениеПредставления];
	
	КэшироватьЗначение = Значение = Неопределено И ОписаниеКолонки.Менеджер <> Неопределено;
	
	Если КэшироватьЗначение Тогда
		Если КэшЗначений[ОписаниеКолонки.Менеджер] = Неопределено Тогда
			КэшЗначений.Вставить(ОписаниеКолонки.Менеджер, Новый Соответствие());
		Иначе
			Значение = КэшЗначений[ОписаниеКолонки.Менеджер][ЗначениеПредставления];
		КонецЕсли;
	КонецЕсли;
	
	Если Значение <> Неопределено Тогда
		Возврат Значение;
	КонецЕсли;
	
	ЗначенияРеквизитов = ЗначенияРеквизитов(СтрокаДанных, ОписаниеКолонки, ЗаменяемыеЗначения, КэшЗначений, ПараметрыСоздания);
	Значение = ПривестиЗначениеКолонки(ОписаниеКолонки, ЗначениеПредставления, ЗначенияРеквизитов, ПараметрыСоздания);
	
	Если КэшироватьЗначение Тогда
		КэшЗначений[ОписаниеКолонки.Менеджер].Вставить(ЗначениеПредставления, Значение);
	КонецЕсли;
	
	Возврат Значение;
	
КонецФункции

Процедура ПодготовитьПараметрыЗаполненияТаблицы(КэшЗначений, ЗаменяемыеЗначения, ПараметрыЗаполнения, Колонки)
	
	Если ЗаменяемыеЗначения = Неопределено Тогда
		ЗаменяемыеЗначения = Новый Соответствие;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(КэшЗначений) Тогда
		КэшЗначений = Новый Соответствие;
	КонецЕсли;
	
	Для Каждого Колонка Из Колонки Цикл
		
		Если НЕ Колонка.Ссылочный Тогда
			Продолжить;
		КонецЕсли;
		
		Если КэшЗначений[Колонка.Менеджер] = Неопределено Тогда
			КэшЗначений.Вставить(Колонка.Менеджер, Новый Соответствие);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ЗначенияРеквизитов(СтрокаТаблицы, ОписаниеКолонки, ЗаменяемыеЗначения, КэшЗначений, Параметры)
	
	ЗначенияРеквизитов = Новый Структура();
	
	Для Каждого ОписаниеВложеннойКолонки Из ОписаниеКолонки.ДополнительныеРеквизиты Цикл
		
		ПредставлениеЗначения = СтрокаТаблицы[ОписаниеВложеннойКолонки.Индекс];
		Если ПустаяСтрока(ПредставлениеЗначения) Тогда
			Продолжить;
		КонецЕсли;
		
		Значение = ЗначениеЯчейки(СтрокаТаблицы, ПредставлениеЗначения, ОписаниеВложеннойКолонки, ЗаменяемыеЗначения, КэшЗначений, Параметры);
		ЗначенияРеквизитов.Вставить(ОписаниеВложеннойКолонки.Имя, Значение);
		
	КонецЦикла;
	
	ОписаниеОбъектаМетаданных = ОписаниеКолонки.ОписаниеОбъектаМетаданных;
	
	Если ОписаниеОбъектаМетаданных <> Неопределено И ОписаниеОбъектаМетаданных.ОписаниеТипа.Имя = "Справочник" Тогда
		ИмяРеквизита = "Наименование";
		Если ОписаниеОбъектаМетаданных.Реквизиты.Свойство(ИмяРеквизита) = Неопределено Тогда
			ИмяРеквизита = "Код";
		КонецЕсли;
		ЗначенияРеквизитов.Вставить(ИмяРеквизита, СтрокаТаблицы[ОписаниеКолонки.Индекс]);
	КонецЕсли;
	
	Возврат ЗначенияРеквизитов;
	
КонецФункции

Функция ПривестиЗначениеКолонки(ОписаниеКолонки, ЗначениеПредставления, ЗначенияРеквизитов, ПараметрыЗаписи)
	
	Если ОписаниеКолонки.ЭтоПеречисление Тогда
		Значение = ОписаниеКолонки.Менеджер[ЗначениеПредставления];
	ИначеЕсли ОписаниеКолонки.Ссылочный Тогда
		Значение = СоздатьНовуюЗапись(ОписаниеКолонки, ЗначенияРеквизитов, ПараметрыЗаписи);
	ИначеЕсли ОписаниеКолонки.ЭтоДата Тогда
		Значение = ЮТПреобразования.ПривестиЗначениеКДате(ОписаниеКолонки.ОписаниеТипа, ЗначениеПредставления);
	ИначеЕсли ОписаниеКолонки.ЭтоЧисло Тогда
		Значение = ЮТПреобразования.ПривестиЗначениеКЧислу(ОписаниеКолонки.ОписаниеТипа, ЗначениеПредставления);
	Иначе
		Значение = ОписаниеКолонки.ОписаниеТипа.ПривестиЗначение(ЗначениеПредставления);
	КонецЕсли;
	
	Возврат Значение;
	
КонецФункции

Функция СоздатьНовуюЗапись(ОписаниеКолонки, ЗначенияРеквизитов, ПараметрыЗаписи)
	
	Конструктор = ЮТТестовыеДанные.КонструкторОбъекта(ОписаниеКолонки.Менеджер);
	
	Если ЗначениеЗаполнено(ЗначенияРеквизитов) Тогда
		Для Каждого ДанныеЗначения Из ЗначенияРеквизитов Цикл
			Конструктор.Установить(ДанныеЗначения.Ключ, ДанныеЗначения.Значение);
		КонецЦикла;
	КонецЕсли;
	
	Если ПараметрыЗаписи.ФикцияОбязательныхПолей Тогда
		Конструктор.ФикцияОбязательныхПолей();
	КонецЕсли;
	
	Возврат Конструктор.Записать(, ПараметрыЗаписи.ПараметрыЗаписи.ОбменДаннымиЗагрузка);
	
КонецФункции

Функция НоваяТаблица(ОписаниеКолонок)
	
	ТаблицаЗначений = Новый ТаблицаЗначений();
	
	Для Каждого ОписаниеКолонки Из ОписаниеКолонок Цикл
		ТаблицаЗначений.Колонки.Добавить(ОписаниеКолонки.Имя, ОписаниеКолонки.ОписаниеТипа);
	КонецЦикла;
	
	Возврат ТаблицаЗначений;
	
КонецФункции

Функция ПараметрыЗагрузки(КолонкиМакета, ОписанияТипов, ЗаменяемыеЗначения, КэшЗначений, ПараметрыЗаполнения)
	
	ОписаниеКолонок = ОписаниеКолонок(КолонкиМакета, ОписанияТипов);
	ПодготовитьПараметрыЗаполненияТаблицы(КэшЗначений, ЗаменяемыеЗначения, ПараметрыЗаполнения, ОписаниеКолонок);
	ПараметрыСоздания = ПараметрыЗаполнения.СозданиеОбъектовМетаданных;
		
	ТаблицаЗначений = НоваяТаблица(ОписаниеКолонок);
	
	ПараметрыЗагрузки = Новый Структура;
	
	ПараметрыЗагрузки.Вставить("ОписаниеКолонок", ОписаниеКолонок);
	ПараметрыЗагрузки.Вставить("ПараметрыСоздания", ПараметрыСоздания);
	ПараметрыЗагрузки.Вставить("Таблица", ТаблицаЗначений);
	
	Возврат ПараметрыЗагрузки;
	
КонецФункции

#Область ОписаниеКолонок

Функция ОписаниеКолонок(КолонкиМакета, ОписанияТипов)
	
	ОсновныеКолонки = ОсновныеКолонкиМакета(КолонкиМакета);
	
	Для Каждого Элемент Из ОписанияТипов Цикл
		
		Если НЕ ОсновныеКолонки.Свойство(Элемент.Ключ) Тогда
			
			Сообщение = СтрШаблон("Макет не содержит колонку `%1`", Элемент.Ключ);
			ВызватьИсключение Сообщение;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ТипЗнч(ОписанияТипов) = Тип("Структура") Тогда
		ОписанияТипов = ЮТОбщий.ВСоответствие(ОписанияТипов, "Ключ", "Значение");
	КонецЕсли;
	
	ЗагружаемыеКолонки = Новый Массив();
	
	Для Каждого Элемент Из ОсновныеКолонки Цикл
		
		ОписаниеТиповКолонки = ОписанияТипов[Элемент.Ключ];
		
		Если ОписаниеТиповКолонки = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ОсновнаяКолонка = Элемент.Значение;
		ЗагружаемыеКолонки.Добавить(ОсновнаяКолонка);
		
		ОсновнаяКолонка.ОписаниеТипа = ОписаниеТиповКолонки;
		ДозаполнитьОписаниеКолонки(ОсновнаяКолонка);
		
		ДополнительныеКолонки = ОсновнаяКолонка.ДополнительныеРеквизиты;
		ОсновнаяКолонка.ДополнительныеРеквизиты = Новый Массив();
		
		Для Каждого ВложеннаяКолонка Из ДополнительныеКолонки Цикл
			
			ВложеннаяКолонка.ОписаниеТипа = ОписаниеТипаВложеннойКолонки(ОписанияТипов, ОсновнаяКолонка, ВложеннаяКолонка);
			
			Если ВложеннаяКолонка.ОписаниеТипа = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			ОсновнаяКолонка.ДополнительныеРеквизиты.Добавить(ВложеннаяКолонка);
			ДозаполнитьОписаниеКолонки(ВложеннаяКолонка);
			
		КонецЦикла;
		
		ОсновнаяКолонка.Составное = ЗначениеЗаполнено(ОсновнаяКолонка.ДополнительныеРеквизиты);
		
	КонецЦикла;
	
	Возврат ЗагружаемыеКолонки;
	
КонецФункции

Функция ОписаниеТипаВложеннойКолонки(ОписанияТипов, ОсновнаяКолонка, ВложеннаяКолонка)
	
	ПолноеИмя = СтрШаблон("%1.%2", ОсновнаяКолонка.Имя, ВложеннаяКолонка.Имя);
	ОписаниеТипа = ОписанияТипов[ПолноеИмя];
	
	Если ОписаниеТипа = Неопределено Тогда
		Реквизиты = ОсновнаяКолонка.ОписаниеОбъектаМетаданных.Реквизиты;
		
		Если Реквизиты.Свойство(ВложеннаяКолонка.Имя) Тогда
			ОписаниеТипа = Реквизиты[ВложеннаяКолонка.Имя].Тип;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ОписаниеТипа;
	
КонецФункции

Функция ОписаниеКолонки(Индекс)
	
	ОписаниеКолонки = Новый Структура;
	ОписаниеКолонки.Вставить("Индекс", Индекс);
	ОписаниеКолонки.Вставить("Имя", "");
	
	ОписаниеКолонки.Вставить("ОписаниеТипа", Неопределено);
	ОписаниеКолонки.Вставить("ТипЗначения", Неопределено);
	ОписаниеКолонки.Вставить("Ссылочный", Ложь);
	ОписаниеКолонки.Вставить("ДополнительныеРеквизиты", Новый Массив());
	ОписаниеКолонки.Вставить("Составное", Ложь);
	ОписаниеКолонки.Вставить("Менеджер", Неопределено);
	ОписаниеКолонки.Вставить("ОписаниеОбъектаМетаданных", Неопределено);
	ОписаниеКолонки.Вставить("ЭтоПеречисление", Ложь);
	ОписаниеКолонки.Вставить("ЭтоЧисло", Ложь);
	ОписаниеКолонки.Вставить("ЭтоДата", Ложь);
	
	Возврат ОписаниеКолонки;
	
КонецФункции

Функция ОсновныеКолонкиМакета(КолонкиМакета)
	
	ОсновныеКолонки = Новый Структура();
	
	ВторойУровеньВложенности = 2;
	
	// Сначала соберем основные колонки
	Для Инд = 0 По КолонкиМакета.ВГраница() Цикл
		
		ИмяКолонки = КолонкиМакета[Инд];
		ЧастиИмени = СтрРазделить(ИмяКолонки, ".");
		
		Если ПустаяСтрока(ИмяКолонки) ИЛИ ЧастиИмени.Количество() = ВторойУровеньВложенности Тогда
			Продолжить;
		ИначеЕсли ЧастиИмени.Количество() > ВторойУровеньВложенности Тогда
			Сообщение = СтрШаблон("Некорректное имя колонки макета `%1`, доступно использовать максимум 1 уровень вложенности", ИмяКолонки);
			ВызватьИсключение Сообщение;
		Иначе
			ОписаниеКолонки = ОписаниеКолонки(Инд);
			ОписаниеКолонки.Имя = ИмяКолонки;
			
			ОсновныеКолонки.Вставить(ИмяКолонки, ОписаниеКолонки);
		КонецЕсли;
		
	КонецЦикла;
	
	Для Инд = 0 По КолонкиМакета.ВГраница() Цикл
		
		ЧастиИмени = СтрРазделить(КолонкиМакета[Инд], ".");
		
		Если ЧастиИмени.Количество() <> ВторойУровеньВложенности Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ ОсновныеКолонки.Свойство(ЧастиИмени[0]) Тогда
			Сообщение = СтрШаблон("Для колонки `%1` не найдена в макете основная колонка с именем `%2`", ИмяКолонки, ЧастиИмени[0]);
			ВызватьИсключение Сообщение;
		КонецЕсли;
		
		ОсновнаяКолонка = ОсновныеКолонки[ЧастиИмени[0]];
		ОписаниеКолонки = ОписаниеКолонки(Инд);
		ОписаниеКолонки.Имя = ЧастиИмени[1];
		
		ОсновнаяКолонка.ДополнительныеРеквизиты.Добавить(ОписаниеКолонки);
		
	КонецЦикла;
	
	Возврат ОсновныеКолонки;
	
КонецФункции

Процедура ДозаполнитьОписаниеКолонки(ОписаниеКолонки)
	
	ТипЗначения = ОписаниеКолонки.ОписаниеТипа.Типы()[0];
	ОписаниеКолонки.ТипЗначения = ТипЗначения;
	
	ОписаниеКолонки.Ссылочный = ЮТТипыДанныхСлужебный.ЭтоСсылочныйТип(ТипЗначения);
	ОписаниеКолонки.ЭтоЧисло = ТипЗначения = Тип("Число");
	ОписаниеКолонки.ЭтоДата = ТипЗначения = Тип("Дата");
	
	Если ОписаниеКолонки.Ссылочный Тогда
		ОписаниеКолонки.ОписаниеОбъектаМетаданных = ЮТМетаданные.ОписаниеОбъектаМетаданных(ТипЗначения);
		ОписаниеКолонки.ЭтоПеречисление = ЮТМетаданные.ЭтоПеречисление(ОписаниеКолонки.ОписаниеОбъектаМетаданных);
		ОписаниеКолонки.Менеджер = ЮТОбщий.Менеджер(ОписаниеКолонки.ОписаниеОбъектаМетаданных);
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#КонецОбласти
