//////////////////////////////////////////////////////////////
// Модуль поддерживает работу с полнотекстовым поиском

// регламентное задание ОбновлениеИндексаПолнотекстовогоПоиска
Процедура ОбновлениеИндексаПолнотекстовогоПоиска() Экспорт
	ПолнотекстовыйПоиск.ОбновитьИндекс(Ложь, Истина);
КонецПроцедуры

// регламентное задание СлияниеИндексаПолнотекстовогоПоиска
Процедура СлияниеИндексаПолнотекстовогоПоиска() Экспорт
	ПолнотекстовыйПоиск.ОбновитьИндекс(Истина);
КонецПроцедуры

// полное обновление индекса полнотекстового поиска
Процедура ПолноеОбновлениеИндексаПолнотекстовогоПоиска() Экспорт
	ПолнотекстовыйПоиск.ОбновитьИндекс();
КонецПроцедуры

