//©///////////////////////////////////////////////////////////////////////////©//
//
//  Copyright 2021-2025 BIA-Technologies Limited Liability Company
//
//  Licensed under the Apache License, Version 2.0 (the "License");
//  you may not use this file except in compliance with the License.
//  You may obtain a copy of the License at
//
//      http://www.apache.org/licenses/LICENSE-2.0
//
//  Unless required by applicable law or agreed to in writing, software
//  distributed under the License is distributed on an "AS IS" BASIS,
//  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//  See the License for the specific language governing permissions and
//  limitations under the License.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область ПрограммныйИнтерфейс

Процедура ИсполняемыеСценарии() Экспорт

	ЮТТесты
		.ДобавитьТестовыйНабор("Конструктор текста")
			.ДобавитьТест("тест_ДобавлениеНовойСтроки", "Конструтор текста. Добавление новой строки")
			.ДобавитьТест("тест_ДобавлениеНовойСтрокиПоШаблону", "Конструтор текста. Добавление новой строки по шаблону")
				.СПараметрами("Сумма", "XMLЗначение(Тип(""Число""), ""1000"")").Представление("Конструтор текста. Добавление новой строки по шаблону. П1 = Сумма, П2 = 1000")
				.СПараметрами("Дата", "XMLЗначение(Тип(""Дата""), ""2025-05-30T09:00:00"")").Представление("Конструтор текста. Добавление новой строки по шаблону. П1 = Дата, П2 = XMLЗначение(Тип(""Дата""), ""2025-05-30T09:00:00"")")
			.ДобавитьТест("тест_ДобавлениеТекста", "Конструтор текста. Добавить текст")
			.ДобавитьТест("тест_ДобавлениеНовойСтрокиПоШаблонПараметровБольшеЧемВШаблоне","Конструтор текста. Добавление новой строки по шаблону. Ошибка - Слишком много параметров")
			.ДобавитьТест("тест_ВставитьПервуюСтроку", "Конструтор текста. Вставить первую строку")
			.ДобавитьТест("тест_ВставитьСтроку", "Конструтор текста. Вставить строку")
			.ДобавитьТест("тест_ПереносСтроки", "Конструтор текста. Перенос строки")
			.ДобавитьТест("тест_Табуляция", "Конструтор текста. Табуляция строки")
			.ДобавитьТест("тест_Текст", "Конструтор текста. Получить готовый текст")
			.ДобавитьТест("тест_Разделитель", "Конструтор текста. Заменить стандартный разделитель строк")
			.ДобавитьТест("тест_Количество", "Конструтор текста. Количество строк добавленных")
			.ДобавитьТест("тест_УстановитьТекстИсходныйТекстСоответствует", "Конструтор текста. Установить текст - исходный текст совпадает с результатом")
			.ДобавитьТест("тест_УстановитьТекстИсходныйТекстРазобралсяКорректно", "Конструтор текста. Установить текст - Количество строк совпадает с исходным текстом")
			.ДобавитьТест("тест_УвеличитьОтступ", "Конструтор текста. Увеличить отступ")
			.ДобавитьТест("тест_УменьшитьОтступ", "Конструтор текста. Уменьшить отступ")
			.ДобавитьТест("тест_НоваяСтрокаСОтступом", "Конструтор текста. Новая строка с отступом")
			.ДобавитьТест("тест_НоваяСтрокаСНесколькимиОтступами", "Конструтор текста. Новая строка с несколькими уровнями отступов")
			.ДобавитьТест("тест_НоваяСтрокаПоШаблонуСОтступом", "Конструтор текста. Новая строка по шаблону с отступом")
	;
	
КонецПроцедуры

#КонецОбласти

#Область Тесты

Процедура тест_ДобавлениеНовойСтроки() Экспорт
	
	ОжидаемыйРезультат = "1Строка2";
	
	Результат = ЮТРаботаСТекстом.КонструкторТекста()
		.НоваяСтрока("Строка", "1", 2)
		.Текст();
	
	ЮТест
		.ОжидаетЧто(Результат)
			.Равно(ОжидаемыйРезультат);
	
КонецПроцедуры

Процедура тест_ДобавлениеНовойСтрокиПоШаблону(ПараметрШаблона1, ПараметрШаблона2) Экспорт
	
	Шаблон = ".Установить(""%1"", %2)";
	ОжидаемыйРезультат = СтрШаблон(Шаблон, ПараметрШаблона1, ПараметрШаблона2);
	
	Результат = ЮТРаботаСТекстом.КонструкторТекста()
		.НоваяСтрокаПоШаблону(Шаблон, ПараметрШаблона1, ПараметрШаблона2)
		.Текст();
	
	ЮТест
		.ОжидаетЧто(Результат)
			.Равно(ОжидаемыйРезультат);
	
КонецПроцедуры

Процедура тест_ДобавлениеТекста() Экспорт
	
	Текст = "Макет = ""|Колонка1|Колонка2|Ы||1  |     2|"";";
	ОжидаемыйРезультат =
		"// Первая строка
		|	Макет = ""|Колонка1|Колонка2|
		|	||1  |     2|"";";
	
	Результат = ЮТРаботаСТекстом
		.КонструкторТекста()
		.НоваяСтрока("// Первая строка")
		.ДобавитьТекст(Текст, 1, "Ы")
		.Текст();
	
	ЮТест
		.ОжидаетЧто(Результат)
			.Равно(ОжидаемыйРезультат);
	
КонецПроцедуры
			
Процедура тест_ДобавлениеНовойСтрокиПоШаблонПараметровБольшеЧемВШаблоне() Экспорт
	
	Шаблон = ".Установить(""Сумма"", %1)";
	Конструктор = ЮТРаботаСТекстом.КонструкторТекста();
	
	ТекстИсключения = "";
#Если ТолстыйКлиентОбычноеПриложение Тогда
	ТекстИсключения = "Ошибка при вызове метода контекста (СтрШаблон)";
#ИначеЕсли ТолстыйКлиентУправляемоеПриложение ИЛИ Клиент Тогда
	ТекстИсключения = "Слишком много фактических параметров";
#КонецЕсли
	
	ЮТест.ОжидаетЧто(Конструктор)
		.Метод("НоваяСтрокаПоШаблону", ЮТМетоды.МассивПараметров(Шаблон, "Сумма", "XMLЗначение(Тип(""Число""), ""1000"")"))
		.ВыбрасываетИсключение(ТекстИсключения);
	
КонецПроцедуры

Процедура тест_ВставитьПервуюСтроку() Экспорт

	ОжидаемыйРезультат =
		"0Строка3
		|Строка1
		|Строка2";
	
	Результат = ЮТРаботаСТекстом.КонструкторТекста()
		.НоваяСтрока("Строка1")
		.НоваяСтрока("Строка2")
		.ВставитьПервуюСтроку("Строка", "0", 3)
		.Текст();
	
	ЮТест
		.ОжидаетЧто(Результат)
			.Равно(ОжидаемыйРезультат);
	
КонецПроцедуры

Процедура тест_ВставитьСтроку() Экспорт

	ОжидаемыйРезультат =
		"Строка1
		|0Строка3
		|Строка2";
	
	Результат = ЮТРаботаСТекстом.КонструкторТекста()
		.НоваяСтрока("Строка1")
		.НоваяСтрока("Строка2")
		.ВставитьСтроку(1, "Строка", "0", 3)
		.Текст();
	
	ЮТест.ОжидаетЧто(Результат)
			.Равно(ОжидаемыйРезультат);
	
КонецПроцедуры

Процедура тест_ПереносСтроки() Экспорт
	
	ОжидаемыйРезультат = "Строка1
						|
						|Строка2";
	
	Результат = ЮТРаботаСТекстом.КонструкторТекста()
		.НоваяСтрока("Строка1")
		.ПереносСтроки()
		.НоваяСтрока("Строка2")
		.Текст();
	
	ЮТест.ОжидаетЧто(Результат)
			.Равно(ОжидаемыйРезультат);
	
КонецПроцедуры
		
Процедура тест_Табуляция() Экспорт
	
	ОжидаемыйРезультат =
		"		Строка1
		|Строка2";
	
	Результат = ЮТРаботаСТекстом.КонструкторТекста()
		.НоваяСтрока("Строка1").Табуляция(2)
		.НоваяСтрока("Строка2")
		.Текст();
	
	ЮТест.ОжидаетЧто(Результат)
			.Равно(ОжидаемыйРезультат);
	
КонецПроцедуры
		
Процедура тест_Текст() Экспорт
	
	ОжидаемыйРезультат =
		"		Строка1
		|Строка2
		|  Строка3
		|Строка4";
	
	Результат = ЮТРаботаСТекстом.КонструкторТекста()
		.НоваяСтрока(ОжидаемыйРезультат)
		.Текст();
	
	ЮТест
		.ОжидаетЧто(Результат)
			.Равно(ОжидаемыйРезультат);
	
КонецПроцедуры

Процедура тест_Разделитель() Экспорт
	
	ОжидаемыйРезультат =
		"Строка1
		|
		|Строка2";
	
	Результат = ЮТРаботаСТекстом.КонструкторТекста()
		.НоваяСтрока("Строка1")
		.НоваяСтрока("Строка2")
		.Разделитель(Символы.ПС + Символы.ПС)
		.Текст();
	
	ЮТест
		.ОжидаетЧто(Результат)
			.Равно(ОжидаемыйРезультат);
	
КонецПроцедуры
		
Процедура тест_Количество() Экспорт

	ОжидаемыйРезультат = 4;
	
	Результат = ЮТРаботаСТекстом.КонструкторТекста()
		.НоваяСтрока("		Строка1")
		.НоваяСтрока("Строка2")
		.НоваяСтрока("  Строка3")
		.НоваяСтрока("Строка3 ")
		.КоличествоСтрок();
	
	ЮТест.ОжидаетЧто(Результат)
			.Равно(ОжидаемыйРезультат);
	
КонецПроцедуры

Процедура тест_УстановитьТекстИсходныйТекстСоответствует() Экспорт
	
	ОжидаемыйРезультат = "Строка1
						|Строка2
						|Строка3
						|Строка4";
	
	Результат = ЮТРаботаСТекстом.КонструкторТекста()
		.УстановитьТекст(ОжидаемыйРезультат)
		.Текст();
	
	ЮТест.ОжидаетЧто(Результат)
			.Равно(ОжидаемыйРезультат);
	
КонецПроцедуры

Процедура тест_УстановитьТекстИсходныйТекстРазобралсяКорректно() Экспорт
	
	Текст = "Строка1
			|
			|Строка2
			|Строка3
			|Строка4";
	
	ОжидаемыйРезультат = 5;
	
	Результат = ЮТРаботаСТекстом.КонструкторТекста()
		.УстановитьТекст(Текст)
		.КоличествоСтрок();
	
	ЮТест.ОжидаетЧто(Результат)
			.Равно(ОжидаемыйРезультат);
	
КонецПроцедуры

Процедура тест_УвеличитьОтступ() Экспорт
	
	ОжидаемыйРезультат =
		"	Строка1
		|	Строка2";
	
	Результат = ЮТРаботаСТекстом.КонструкторТекста()
		.УвеличитьОтступ()
		.НоваяСтрока("Строка1")
		.НоваяСтрока("Строка2")
		.Текст();
	
	ЮТест.ОжидаетЧто(Результат)
			.Равно(ОжидаемыйРезультат);
	
КонецПроцедуры

Процедура тест_УменьшитьОтступ() Экспорт
	
	ОжидаемыйРезультат =
		"	Строка1
		|Строка2";
	
	Результат = ЮТРаботаСТекстом.КонструкторТекста()
		.УвеличитьОтступ()
		.НоваяСтрока("Строка1")
		.УменьшитьОтступ()
		.НоваяСтрока("Строка2")
		.Текст();
	
	ЮТест
		.ОжидаетЧто(Результат)
			.Равно(ОжидаемыйРезультат);
	
КонецПроцедуры

Процедура тест_НоваяСтрокаСОтступом() Экспорт
	
	ОжидаемыйРезультат =
		"Строка1
		|	Строка2
		|Строка3";
	
	Результат = ЮТРаботаСТекстом.КонструкторТекста()
		.НоваяСтрока("Строка1")
		.УвеличитьОтступ()
		.НоваяСтрока("Строка2")
		.УменьшитьОтступ()
		.НоваяСтрока("Строка3")
		.Текст();
	
	ЮТест
		.ОжидаетЧто(Результат)
			.Равно(ОжидаемыйРезультат);
	
КонецПроцедуры

Процедура тест_НоваяСтрокаСНесколькимиОтступами() Экспорт
	
	ОжидаемыйРезультат =
		"Строка1
		|	Строка2
		|		Строка3
		|	Строка4
		|Строка5";
	
	Результат = ЮТРаботаСТекстом.КонструкторТекста()
		.НоваяСтрока("Строка1")
		.УвеличитьОтступ()
		.НоваяСтрока("Строка2")
		.УвеличитьОтступ()
		.НоваяСтрока("Строка3")
		.УменьшитьОтступ()
		.НоваяСтрока("Строка4")
		.УменьшитьОтступ()
		.НоваяСтрока("Строка5")
		.Текст();
	
	ЮТест
		.ОжидаетЧто(Результат)
			.Равно(ОжидаемыйРезультат);
	
КонецПроцедуры

Процедура тест_НоваяСтрокаПоШаблонуСОтступом() Экспорт
	
	Шаблон = ".Установить(""%1"", %2)";
	Параметр1 = "Сумма";
	Параметр2 = "1000";
	
	ОжидаемыйРезультат = Символы.Таб + СтрШаблон(Шаблон, Параметр1, Параметр2);
	
	Результат = ЮТРаботаСТекстом.КонструкторТекста()
		.УвеличитьОтступ()
		.НоваяСтрокаПоШаблону(Шаблон, Параметр1, Параметр2)
		.Текст();
	
	ЮТест
		.ОжидаетЧто(Результат)
			.Равно(ОжидаемыйРезультат);
	
КонецПроцедуры

#КонецОбласти
