//©///////////////////////////////////////////////////////////////////////////©//
//
//  Copyright 2021-2022 BIA-Technologies Limited Liability Company
//
//  Licensed under the Apache License, Version 2.0 (the "License");
//  you may not use this file except in compliance with the License.
//  You may obtain a copy of the License at
//
//      http://www.apache.org/licenses/LICENSE-2.0
//
//  Unless required by applicable law or agreed to in writing, software
//  distributed under the License is distributed on an "AS IS" BASIS,
//  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//  See the License for the specific language governing permissions and
//  limitations under the License.
//
//©///////////////////////////////////////////////////////////////////////////©//

&Вместо("ОтправитьОбъектНаСервер")
Функция ЮТОтправитьОбъектНаСервер(ИсточникДанных, Объект, HTTPМетод, ТипКонтента, Преобразование, ДопНастройки, Ответ, ОтветВСтруктуру, ТелоОтветаВХранилище) Экспорт
	
	// Собираем параметры в массив
	ПараметрыМетода = Мокито.МассивПараметров(ИсточникДанных, Объект, HTTPМетод, ТипКонтента, Преобразование, ДопНастройки, Ответ, ОтветВСтруктуру, ТелоОтветаВХранилище);
	
	// Отправляем данные на анализ
	ПрерватьВыполнение = Ложь;
	Результат = Мокито.АнализВызова(РаботаСHTTP, "ОтправитьОбъектНаСервер", ПараметрыМетода, ПрерватьВыполнение);
	
	// Обрабатываем результат анализа
	Если НЕ ПрерватьВыполнение Тогда
		Возврат ПродолжитьВызов(ИсточникДанных, Объект, HTTPМетод, ТипКонтента, Преобразование, ДопНастройки, Ответ, ОтветВСтруктуру, ТелоОтветаВХранилище);
	Иначе
		Возврат Результат;
	КонецЕсли;
	
КонецФункции

&Вместо("ОтправитьЗапросHTTP")
Функция ЮТОтправитьЗапросHTTP(ИсточникДанных, HTTPМетод, АдресСкрипта, СтруктураТела, Ответ, СтруктураАвторизации, Параметры, Заголовки, ОтветВСтруктуру, ТелоОтветаВХранилище) Экспорт
	
	ПараметрыМетода = Мокито.МассивПараметров(ИсточникДанных, HTTPМетод, АдресСкрипта, СтруктураТела, Ответ, СтруктураАвторизации, Параметры, Заголовки, ОтветВСтруктуру, ТелоОтветаВХранилище);
	
	ПрерватьВыполнение = Ложь;
	Результат = Мокито.АнализВызова(РаботаСHTTP, "ОтправитьЗапросHTTP", ПараметрыМетода, ПрерватьВыполнение);
	
	Если НЕ ПрерватьВыполнение Тогда
		Возврат ПродолжитьВызов(ИсточникДанных, HTTPМетод, АдресСкрипта, СтруктураТела, Ответ, СтруктураАвторизации, Параметры, Заголовки, ОтветВСтруктуру, ТелоОтветаВХранилище);
	Иначе
		Возврат Результат;
	КонецЕсли;
	
КонецФункции
