---
name: Новая функциональность
about: Добавление новой функциональности в движок
title: '[NEW]'
assignees: ''

---

## Описание сценария (кейса) использования, применения
<!-- В данном блоке стоит описать проблему, сценарий использования, для формирования понимания, зачем нужна функциональность -->

## Вариант реализации новой функциональности
<!-- Можно описать вариант (-ы) реализации новой фунциональности, как видится в момент написания -->

## Дополнительная информация
<!-- Можно добавить любую информацию, которая может быть полезной при реализации -->
