//©///////////////////////////////////////////////////////////////////////////©//
//
//  Copyright 2021-2024 BIA-Technologies Limited Liability Company
//
//  Licensed under the Apache License, Version 2.0 (the "License");
//  you may not use this file except in compliance with the License.
//  You may obtain a copy of the License at
//
//      http://www.apache.org/licenses/LICENSE-2.0
//
//  Unless required by applicable law or agreed to in writing, software
//  distributed under the License is distributed on an "AS IS" BASIS,
//  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//  See the License for the specific language governing permissions and
//  limitations under the License.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область СлужебныйПрограммныйИнтерфейс

Функция ИспользоватьДымовыеТесты() Экспорт
	
	Возврат ЮТДымовыеТестыСлужебныйКлиентСервер.ИспользоватьДымовыеТесты();
	
КонецФункции

Функция ПараметрыДымовыхТестов() Экспорт
	
	Возврат ЮТДымовыеТестыСлужебныйКлиентСервер.ПараметрыДымовыхТестов();
	
КонецФункции

Функция ПараметрыВидаДымовогоТеста(КлючНастройки) Экспорт
	
	Возврат ЮТДымовыеТестыСлужебныйКлиентСервер.ПараметрыВидаДымовогоТеста(КлючНастройки);
	
КонецФункции

Функция ИсключитьТест(КлючТеста, ЭлементНастройки) Экспорт
	
	Если НЕ ЭлементНастройки.Свойство(КлючТеста) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат НЕ ЭлементНастройки[КлючТеста].Использовать;
	
КонецФункции

Функция БазовоеОписаниеЭлементаНастройки() Экспорт
	
	Описание = Новый Структура;
	Описание.Вставить("Исключения", Новый Массив);
	Описание.Вставить("Использовать", Истина);
	
	Возврат Описание;
	
КонецФункции

Функция СлучайныйЭлемент(ТипОбъекта, ИмяОбъекта, Параметры = Неопределено) Экспорт
	
#Если Сервер Тогда
	Возврат ЮТДымовыеТестыСлужебныйСервер.СлучайныйЭлемент(ТипОбъекта, ИмяОбъекта, Параметры);
#Иначе
	Возврат ЮТДымовыеТестыСлужебныйВызовСервера.СлучайныйЭлемент(ТипОбъекта, ИмяОбъекта, Параметры);
#КонецЕсли
	
КонецФункции

#КонецОбласти
