//©///////////////////////////////////////////////////////////////////////////©//
//
//  Copyright 2021-2023 BIA-Technologies Limited Liability Company
//
//  Licensed under the Apache License, Version 2.0 (the "License");
//  you may not use this file except in compliance with the License.
//  You may obtain a copy of the License at
//
//      http://www.apache.org/licenses/LICENSE-2.0
//
//  Unless required by applicable law or agreed to in writing, software
//  distributed under the License is distributed on an "AS IS" BASIS,
//  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//  See the License for the specific language governing permissions and
//  limitations under the License.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область СлужебныйПрограммныйИнтерфейс

Процедура ИсполняемыеСценарии() Экспорт
	
	ЮТТесты
		.ВТранзакции()
		.УдалениеТестовыхДанных()
		.ДобавитьТест("Удалить")
		.ДобавитьТест("ВариантыПараметров")
		.ДобавитьТест("СоздатьГруппу")
		.ДобавитьТест("ЗагрузитьИзМакета_ТабличныйДокумент")
		.ДобавитьТест("ЗагрузитьИзМакета_MarkDown")
		.ДобавитьТест("ЗагрузитьИзМакета_ЧастичнаяЗагрузкаДанных")
		.ДобавитьТест("ЗагрузитьИзМакета_Проверки")
		.ДобавитьТест("СлучайныйИдентификатор")
	;
		
КонецПроцедуры

Процедура Удалить() Экспорт
	
	Ссылки = Новый Массив;
	Ссылки.Добавить(ЮТест.Данные().СоздатьЭлемент("Справочники.Банки"));
	Ссылки.Добавить(ЮТест.Данные().СоздатьДокумент("Документы.ПриходТовара"));
	Ссылки.Добавить(
		ЮТест.Данные()
			.КонструкторОбъекта("Документы.ПриходТовара")
			.Провести()
	);
	
	Для Каждого Ссылка Из Ссылки Цикл
		
		СсылкаСуществует = ПомощникТестированияВызовСервера.СсылкаСуществует(Ссылка);
		ЮТест.ОжидаетЧто(СсылкаСуществует, "Ссылка на несуществующий объект").ЭтоИстина();
		
	КонецЦикла;
	
	ЮТТестовыеДанные.Удалить(Ссылки);
	
	Для Каждого Ссылка Из Ссылки Цикл
		
		СсылкаСуществует = ПомощникТестированияВызовСервера.СсылкаСуществует(Ссылка);
		ЮТест.ОжидаетЧто(СсылкаСуществует, "Объект не удален по ссылке").ЭтоЛожь();
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ВариантыПараметров() Экспорт
	
	Ключи = "Числа, Строки";
	БазоваяСтруктура = Новый Структура(Ключи);
	Значения = Новый Структура(Ключи, ЮТОбщий.ЗначениеВМассиве(1, 2), ЮТОбщий.ЗначениеВМассиве("1", "2"));
	
	Результат = ЮТест.Данные().ВариантыПараметров(БазоваяСтруктура, Значения);
	
	ЮТест.ОжидаетЧто(Результат)
		.ИмеетТип("Массив")
		.ИмеетДлину(7)
		.Элемент(0).Равно(БазоваяСтруктура)
		.Элемент(1).Равно(Новый Структура(Ключи, 1))
		.Элемент(2).Равно(Новый Структура(Ключи, 1, "1"))
		.Элемент(3).Равно(Новый Структура(Ключи, 1, "2"))
		.Элемент(5).Равно(Новый Структура(Ключи, 2, "1"))
		.Элемент(6).Равно(Новый Структура(Ключи, 2, "2"));
	
КонецПроцедуры

Процедура СоздатьГруппу() Экспорт
	
	Группа = ЮТест.Данные().СоздатьГруппу("Справочники.Товары");
	
	ЭтоГруппа = ЮТЗапросы.ЗначениеРеквизита(Группа, "ЭтоГруппа");
	ЮТест.ОжидаетЧто(ЭтоГруппа).ЭтоИстина();
	
КонецПроцедуры

Процедура СлучайныйИдентификатор() Экспорт
	
	Проверка = Новый Структура();
	
	Для Инд = 1 По 100 Цикл
		
		Идентификатор = ЮТест.Данные().СлучайныйИдентификатор(Инд);
		
		ЮТест.ОжидаетЧто(Проверка)
			.Метод("Вставить").Параметр(Идентификатор)
			.НеВыбрасываетИсключение(, "Сформирован не валидный идентификатор: " + Идентификатор);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗагрузитьИзМакета_ТабличныйДокумент() Экспорт
	
	// Подготовка тестового окружения
	
	ОписанияТипов = Новый Соответствие;
	ОписанияТипов.Вставить("Период", Новый ОписаниеТипов("Дата"));
	ОписанияТипов.Вставить("Товар", Новый ОписаниеТипов("СправочникСсылка.Товары"));
	ОписанияТипов.Вставить("Цена", Новый ОписаниеТипов("Число"));
	ОписанияТипов.Вставить("Количество", Новый ОписаниеТипов("Число"));
	
	КэшЗначений = Неопределено;
	
	Поставщик = ЮТест.Данные().СоздатьЭлемент("Справочники.Контрагенты", "Поставщик");
	
	ЗаменяемыеЗначения = Новый Соответствие;
	ЗаменяемыеЗначения.Вставить("Поставщик 1", Поставщик);
	
	ТаблицаРезультатов = ЮТест.Данные().ЗагрузитьИзМакета("ОбщийМакет.ЮТ_МакетТестовыхДанных.R2C1:R5C11",
		ОписанияТипов,
		КэшЗначений,
		ЗаменяемыеЗначения
	);
	
	// Проверка поведения и результатов
	
#Если Сервер Тогда
	Ютест.ОжидаетЧто(ТаблицаРезультатов)
		.ИмеетТип("ТаблицаЗначений")
		.ИмеетДлину(3)
		.Свойство("[0].Товар.Поставщик").Равно(Поставщик)
		.Свойство("[0].Товар.Артикул").Равно("Артикул 1")
		.Свойство("[0].Товар.Вид").Равно(ПредопределенноеЗначение("Перечисление.ВидыТоваров.Товар"))
		.Свойство("[0].Товар.Описание").Заполнено()
		.Свойство("[0].Количество").Равно(1)
		.Свойство("[0].Цена").Равно(100.55)
		.Свойство("[1].Товар.Поставщик").Заполнено().НеРавно(Поставщик)
		.Свойство("[1].Товар.Артикул").Равно("Артикул 2")
		.Свойство("[1].Товар.Вид").Равно(ПредопределенноеЗначение("Перечисление.ВидыТоваров.Товар"))
		.Свойство("[1].Товар.Описание").НеЗаполнено()
		.Свойство("[1].Количество").Равно(1)
		.Свойство("[1].Цена").Равно(1500.2)
		.Свойство("[2].Товар.Поставщик").НеЗаполнено()
		.Свойство("[2].Товар.Артикул").Равно("Артикул 3")
		.Свойство("[2].Товар.Вид").Равно(ПредопределенноеЗначение("Перечисление.ВидыТоваров.Услуга"))
		.Свойство("[2].Товар.Описание").Заполнено()
		.Свойство("[2].Количество").Равно(1)
		.Свойство("[2].Цена").Равно(1000000)
	;
#Иначе
	Ютест.ОжидаетЧто(ТаблицаРезультатов)
		.ИмеетТип("Массив")
		.ИмеетДлину(3)
		.КаждыйЭлементСоответствуетПредикату(ЮТест.Предикат()
			.Реквизит("Товар").Заполнено().ИмеетТип("СправочникСсылка.Товары")
			.Реквизит("Период").Заполнено().ИмеетТип("Дата")
			.Реквизит("Количество").Заполнено().ИмеетТип("Число")
			.Реквизит("Цена").Заполнено().ИмеетТип("Число")
		)
		.Свойство("[0].Количество").Равно(1)
		.Свойство("[0].Цена").Равно(100.55)
		.Свойство("[1].Количество").Равно(1)
		.Свойство("[1].Цена").Равно(1500.2)
		.Свойство("[2].Количество").Равно(1)
		.Свойство("[2].Цена").Равно(1000000)
	;
#КонецЕсли
	
КонецПроцедуры

Процедура ЗагрузитьИзМакета_MarkDown() Экспорт
	
	ИмяМакета = "ОбщийМакет.ЮТ_ТестовыеДанныеMarkdown";
	Макет = ЮТОбщий.Макет(ИмяМакета);
	
	Варианты = ЮТест.Варианты("Данные, Описание")
		.Добавить(ИмяМакета, "По имени макета")
		.Добавить(Макет, "Из текстового документа")
		.Добавить(Макет.ПолучитьТекст(), "Из строки")
	;
	
	Для Каждого Вариант Из Варианты.СписокВариантов() Цикл
	
		ОписанияТипов = Новый Соответствие;
		ОписанияТипов.Вставить("Товар", Новый ОписаниеТипов("СправочникСсылка.Товары"));
		ОписанияТипов.Вставить("Цена", Новый ОписаниеТипов("Число"));
		ОписанияТипов.Вставить("Количество", Новый ОписаниеТипов("Число"));
		ОписанияТипов.Вставить("Сумма", Новый ОписаниеТипов("Число"));
		
		// Вызов тестируемого сценария
		
		ТаблицаРезультатов = ЮТест.Данные().ЗагрузитьИзМакета(
			Вариант.Данные,
			ОписанияТипов
		);
		
		// Проверка поведения и результатов
		
#Если Сервер Тогда
		Ютест.ОжидаетЧто(ТаблицаРезультатов, Вариант.Описание)
			.ИмеетТип("ТаблицаЗначений")
			.ИмеетДлину(3)
			.Свойство("[0].Товар.Наименование").Равно("Товар 1")
			.Свойство("[0].Количество").Равно(1)
			.Свойство("[0].Цена").Равно(100)
			.Свойство("[0].Сумма").Равно(100)
			.Свойство("[1].Товар.Наименование").Равно("Товар 2")
			.Свойство("[1].Количество").Равно(1)
			.Свойство("[1].Цена").Равно(2000)
			.Свойство("[1].Сумма").Равно(2000)
			.Свойство("[2].Товар.Наименование").Равно("Услуга")
			.Свойство("[2].Количество").Равно(1)
			.Свойство("[2].Цена").Равно(300.9)
			.Свойство("[2].Сумма").Равно(300.9)
		;
#Иначе
		Ютест.ОжидаетЧто(ТаблицаРезультатов, Вариант.Описание)
			.ИмеетТип("Массив")
			.ИмеетДлину(3)
			.КаждыйЭлементСоответствуетПредикату(ЮТест.Предикат()
				.Реквизит("Товар").Заполнено().ИмеетТип("СправочникСсылка.Товары")
				.Реквизит("Количество").Равно(1)
				.Реквизит("Цена").Заполнено().ИмеетТип("Число")
				.Реквизит("Сумма").Заполнено().ИмеетТип("Число"))
			.Свойство("[0].Количество").Равно(1)
			.Свойство("[0].Цена").Равно(100)
			.Свойство("[0].Сумма").Равно(100)
			.Свойство("[1].Цена").Равно(2000)
			.Свойство("[1].Сумма").Равно(2000)
			.Свойство("[2].Цена").Равно(300.9)
			.Свойство("[2].Сумма").Равно(300.9)
		;
#КонецЕсли
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗагрузитьИзМакета_ЧастичнаяЗагрузкаДанных() Экспорт
	
	ОписанияТипов = Новый Структура;
	ОписанияТипов.Вставить("Период", Новый ОписаниеТипов("Дата"));
	ОписанияТипов.Вставить("Количество", Новый ОписаниеТипов("Число"));
	
	ТаблицаРезультатов = ЮТест.Данные().ЗагрузитьИзМакета("ОбщийМакет.ЮТ_МакетТестовыхДанных.R2C1:R5C11", ОписанияТипов);
	
#Если Сервер Тогда
	Ютест.ОжидаетЧто(ТаблицаРезультатов)
		.ИмеетДлину(3)
		.Свойство("Колонки").ИмеетДлину(2)
			.Содержит("Период")
			.Содержит("Количество")
	;
#Иначе
	Ютест.ОжидаетЧто(ТаблицаРезультатов)
		.ИмеетТип("Массив")
		.ИмеетДлину(3)
		.КаждыйЭлементСоответствуетПредикату(ЮТест.Предикат()
			.ИмеетДлину(2)
			.ИмеетСвойство("Период")
			.ИмеетСвойство("Количество")
		)
	;
#КонецЕсли
КонецПроцедуры

Процедура ЗагрузитьИзМакета_Проверки() Экспорт
	
	ЮТест.ОжидаетЧто(ЮТест.Данные())
		.Метод("ЗагрузитьИзМакета")
			.Параметр(Неопределено)
			.Параметр(Новый Массив)
		.ВыбрасываетИсключение("Укажите источник данных (Макет)");
	
	ЮТест.ОжидаетЧто(ЮТест.Данные())
		.Метод("ЗагрузитьИзМакета")
			.Параметр("ОбщийМакет.ЮТ_ТестовыеДанныеMarkdown")
			.Параметр(Новый Массив)
		.ВыбрасываетИсключение("Укажите описание загружаемых колонок (ОписанияТипов)");
	
	ЮТест.ОжидаетЧто(ЮТест.Данные())
		.Метод("ЗагрузитьИзМакета")
			.Параметр("ОбщийМакет.ЮТ_ТестовыеДанныеMarkdown")
			.Параметр(1)
		.ВыбрасываетИсключение("Некорректный тип параметра `ОписанияТипов` метода `ЮТТестовыеДанные.ЗагрузитьИзМакета`. Метод принимает `Соответствие, Структура`, а получили `Число` (1)");
	
	ЮТест.ОжидаетЧто(ЮТест.Данные())
		.Метод("ЗагрузитьИзМакета")
			.Параметр("ОбщийМакет.ЮТ_ТестовыеДанныеMarkdown")
			.Параметр(Новый Структура("Количество, Резерв", Новый ОписаниеТипов("Число"), Новый ОписаниеТипов("Число")))
		.ВыбрасываетИсключение("Макет не содержит колонку `Резерв`");
	
	ЮТест.ОжидаетЧто(ЮТест.Данные())
		.Метод("ЗагрузитьИзМакета")
			.Параметр("ОбщийМакет.ЮТ_ТестовыеДанныеMarkdown")
			.Параметр(Новый Структура("Количество, Резерв", Новый ОписаниеТипов("Число"), Новый ОписаниеТипов("Число")))
		.ВыбрасываетИсключение("Макет не содержит колонку `Резерв`");
	
	ЮТест.ОжидаетЧто(ЮТест.Данные())
		.Метод("ЗагрузитьИзМакета")
			.Параметр("ОбщийМакет.ЮТ_МакетТестовыхДанных.R2C4:R5C5")
			.Параметр(Новый Структура("Товар", Новый ОписаниеТипов("СправочникСсылка.Товары")))
		.ВыбрасываетИсключение("не найдена в макете основная колонка с именем `Товар`");
	
	ЮТест.ОжидаетЧто(ЮТест.Данные())
		.Метод("ЗагрузитьИзМакета")
			.Параметр("ОбщийМакет.ЮТ_МакетТестовыхДанных.ОсновнаяТаблица")
			.Параметр(Новый Структура("Цена", Новый ОписаниеТипов("Дата")))
		.ВыбрасываетИсключение("Область не найдена: ОсновнаяТаблица");
	
КонецПроцедуры

#КонецОбласти
