//©///////////////////////////////////////////////////////////////////////////©//
//
//  Copyright 2021-2025 BIA-Technologies Limited Liability Company
//
//  Licensed under the Apache License, Version 2.0 (the "License");
//  you may not use this file except in compliance with the License.
//  You may obtain a copy of the License at
//
//      http://www.apache.org/licenses/LICENSE-2.0
//
//  Unless required by applicable law or agreed to in writing, software
//  distributed under the License is distributed on an "AS IS" BASIS,
//  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//  See the License for the specific language governing permissions and
//  limitations under the License.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область СлужебныйПрограммныйИнтерфейс

Функция СформироватьКодДвиженийВФрматеКонструктора(Документ, ДанныеДвижений) Экспорт
	
	Конструктор = ЮТРаботаСТекстом.КонструкторТекста();
	ШагСоздатьДокумент(Конструктор, Документ, "ДокументСсылка");
	ШагДвиженияДокументаПоРегистру(Конструктор, ДанныеДвижений, "ДокументСсылка");
	
	Возврат Конструктор.Текст();
	
КонецФункции

Функция СформироватьКодДвиженийВФрматеMarkdown(Документ, ДанныеДвижений) Экспорт
	
	Конструктор = ЮТРаботаСТекстом.КонструкторТекста();
	Конструктор.НоваяСтрока("ПараметрыЗагрузки = ЮТест.Данные().ПараметрыЗагрузкиМакетов();");
	ШагСоздатьДокумент(Конструктор, Документ, "ДокументСсылка");
	
	Для Каждого Запись Из ДанныеДвижений Цикл
		
		Конструктор.ПереносСтроки()
			.НоваяСтрока("// Движения по регистру " + Запись.Ключ);
		
		СериализоватьТаблицуВMarkdown(Конструктор, Запись.Значение, "ДанныеТаблицы");
		
		Конструктор.НоваяСтрокаПоШаблону(
			"ЮТест.Данные().ЗагрузитьДвиженияИзМакета(ДокументСсылка, ""%1"", ДанныеТаблицы, ,ПараметрыЗагрузки);",
			Запись.Ключ);
		
	КонецЦикла;
	
	Возврат Конструктор.Текст();
	
КонецФункции

Функция ЗначениеВСтроку(Значение, ДопИнфоКомментарий = Неопределено) Экспорт
	
	Результат = Неопределено;
	
	Если Значение = Неопределено Тогда
		Возврат "Неопределено";
	КонецЕсли;
	
	ТекТип = ТипЗнч(Значение);
	
	Если ТекТип = Тип("Булево") Тогда
		
		Результат = Формат(Значение, "БЛ=Ложь; БИ=Истина");
		
	ИначеЕсли ТекТип = Тип("Строка") Тогда
		
		ЭкранированноеНаименование = ЭкранированиеСтроки(Значение);
		Результат = """" + ЭкранированноеНаименование + """";
		
	ИначеЕсли ТекТип = Тип("Число") Тогда
		
		Результат = Формат(Значение, "ЧРД=.; ЧН=0; ЧГ=;");
		
	ИначеЕсли ТекТип = Тип("Дата") Тогда
		
		Результат = "'" + Формат(Значение, "ДФ='гггг.ММ.дд ЧЧ:мм:сс';") + "'";
		
	ИначеЕсли ТекТип = Тип("ОписаниеТипов") Тогда
		
		СтрокаТипов = ОписаниеТиповВСтроку(Значение);
		ЭкранированнаяСтрока = СтрЗаменить(СтрокаТипов, """", """"""); // Замена одной кавычки на две
		Результат = "Новый ОписаниеТипов(""" + ЭкранированнаяСтрока + """)";
		
	ИначеЕсли ЮТТипыДанныхСлужебный.ЭтоСсылочныйТип(ТекТип) Тогда
		
		Результат = СсылочноеЗначениеВСтроку(Значение, ДопИнфоКомментарий);
		
	Иначе
		
		Результат = СтрШаблон("!Тип (%1) не поддерживается!", ТекТип);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СформироватьКодПоСсылкамНаОбъекты(СсылкиНаОбъекты, НастройкиФормирования) Экспорт
	
	Конструктор = ЮТРаботаСТекстом.КонструкторТекста();
	
	Для Каждого Ссылка Из СсылкиНаОбъекты Цикл
		
		Объект = Ссылка.ПолучитьОбъект();
		
		ОписаниеОбъекта = ЮТМетаданные.ОписаниеОбъектаМетаданных(Ссылка);
		
		Если ОписаниеОбъекта = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		СформироватьКодПоСсылке(Конструктор, Объект, ОписаниеОбъекта, НастройкиФормирования);
		
	КонецЦикла;
	
	Возврат Конструктор.Текст();
	
КонецФункции

// Сформировать код по ссылке.
// 
// Параметры:
//  Конструктор - ОбработкаОбъект.ЮТКонструкторТекста - Конструктор
//  Объект - Произвольный
//  ОписаниеОбъекта - см. ЮТМетаданные.ОписаниеОбъектаМетаданных
//  НастройкиФормирования - Произвольный
Процедура СформироватьКодПоСсылке(Конструктор, Объект, ОписаниеОбъекта, НастройкиФормирования) Экспорт
	
	ШагКомментарийОбъекта(Конструктор, Объект, ОписаниеОбъекта);
	ШагКонструкторОбъекта(Конструктор, ОписаниеОбъекта, ОписаниеОбъекта.Имя + "Ссылка");
	
	Конструктор.УвеличитьОтступ();
	ШагУстановкаРеквизитов(Конструктор, Объект, ОписаниеОбъекта.Реквизиты);
	
	Для Каждого Элемент Из ОписаниеОбъекта.ТабличныеЧасти Цикл
		ШагЗаполненияТабличнойЧасти(Конструктор, Элемент.Ключ, Объект[Элемент.Ключ], Элемент.Значение);
	КонецЦикла;
	Конструктор.НоваяСтрока(".ФикцияОбязательныхПолей()");
	Конструктор.НоваяСтрока(".Записать();");
	Конструктор.УменьшитьОтступ();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ШагКонструкторОбъекта(Конструктор, ОписаниеОбъекта, ИмяПеременной)
	
	Конструктор.НоваяСтрокаПоШаблону("%1 = ЮТест.Данные().КонструкторОбъекта(""%2.%3"")",
									 ИмяПеременной,
									 ОписаниеОбъекта.ОписаниеТипа.Имя,
									 ОписаниеОбъекта.Имя);
	
КонецПроцедуры

Процедура ШагСоздатьДокумент(Конструктор, Документ, ИмяПеременной)
	
	Описание = ЮТМетаданные.ОписаниеОбъектаМетаданных(Документ);
	Конструктор.НоваяСтрокаПоШаблону("%1 = ЮТест.Данные().СоздатьДокумент(""%2.%3"");",
									 ИмяПеременной,
									 Описание.ОписаниеТипа.ИмяКоллекции,
									 Описание.Имя);
	
КонецПроцедуры

Процедура ШагДвиженияДокументаПоРегистру(Конструктор, ДанныеДвижений, ИмяПеременной)
	
	Для Каждого Запись Из ДанныеДвижений Цикл
		Конструктор.ПереносСтроки()
			.НоваяСтрока("// Движения по регистру " + Запись.Ключ)
			.НоваяСтрокаПоШаблону("ЮТест.Данные().КонструкторДвижений(%1, ""%2"")", ИмяПеременной, Запись.Ключ);
		
		ШагЗаполненияТаблицы(Конструктор, Запись.Значение);
		
		Конструктор.НоваяСтрока(".Записать();");
	КонецЦикла;
	
КонецПроцедуры

Процедура ШагЗаполненияТабличнойЧасти(Конструктор, ИмяТабличнойЧасти, Таблица, ОписаниеТабличнойЧасти)
	
	Конструктор.НоваяСтрокаПоШаблону(".ТабличнаяЧасть(""%1"")", ИмяТабличнойЧасти);
	ШагЗаполненияТаблицы(Конструктор, Таблица, ОписаниеТабличнойЧасти);
	
КонецПроцедуры

Процедура ШагЗаполненияТаблицы(Конструктор, Таблица, Знач Колонки = Неопределено)
	
	Если Колонки = Неопределено Тогда
		Колонки = Таблица.Колонки;
	КонецЕсли;
	
	Для Каждого СтрокаДвижения Из Таблица Цикл
		
		Конструктор.НоваяСтрока(".ДобавитьСтроку()")
			.УвеличитьОтступ();
		
		Для Каждого Колонка Из Колонки Цикл
			ИмяКолонки = ?(ТипЗнч(Колонки) = Тип("Структура"), Колонка.Ключ, Колонка.Имя);
			Значение = СтрокаДвижения[ИмяКолонки];
			Если ЗначениеЗаполнено(Значение) Тогда
				Конструктор.НоваяСтрокаПоШаблону(".Установить(""%1"", %2)", ИмяКолонки, ЗначениеВСтроку(Значение));
			КонецЕсли;
		КонецЦикла;
		
		Конструктор.УменьшитьОтступ();
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ШагКомментарийОбъекта(Конструктор, Объект, ОписаниеОбъекта)
	
	Конструктор.НоваяСтрокаПоШаблону("// Создание %1.%2. %3",
									 ОписаниеОбъекта.ОписаниеТипа.Имя,
									 ОписаниеОбъекта.Имя,
									 Объект);
	
КонецПроцедуры

Процедура ШагУстановкаРеквизитов(Конструктор, Объект, Реквизиты)
	
	Для Каждого Элемент Из Реквизиты Цикл
		
		Значение = Объект[Элемент.Ключ];
		
		Конструктор
			.НоваяСтрокаПоШаблону(".Установить(""%1"", %2)", Элемент.Ключ, ЗначениеВСтроку(Значение));
		
	КонецЦикла;
	
КонецПроцедуры

#Область ТипыДанных

Функция ОписаниеТиповВСтроку(ОписаниеТипов)
	
	МассивТипов = Новый Массив;
	
	Для Каждого ТекТип Из ОписаниеТипов.Типы() Цикл
		
		СтрокаТипа = ПредставлениеТипа(ТекТип, ОписаниеТипов);
		МассивТипов.Добавить(СтрокаТипа);
		
	КонецЦикла;
	
	Возврат СтрСоединить(МассивТипов, ", ");
	
КонецФункции

Функция ПредставлениеТипа(ТипЗначения, ОписаниеТипов = Неопределено)
	
	МетаданныеТипа = Метаданные.НайтиПоТипу(ТипЗначения);
	СтрокаТипа = "";
	
	Если ТипЗначения = Тип("Булево") Тогда
		СтрокаТипа = "Булево";
	ИначеЕсли ТипЗначения = Тип("Число") Тогда
		СтрокаТипа = "Число";
		// Добавляем квалификаторы числа
		Если ОписаниеТипов <> Неопределено И (ОписаниеТипов.КвалификаторыЧисла.Разрядность > 0
			Или ОписаниеТипов.КвалификаторыЧисла.РазрядностьДробнойЧасти > 0) Тогда
			СтрокаТипа = СтрокаТипа + СтрШаблон("(%1, %2)",
				ОписаниеТипов.КвалификаторыЧисла.Разрядность,
				ОписаниеТипов.КвалификаторыЧисла.РазрядностьДробнойЧасти);
		КонецЕсли;
	ИначеЕсли ТипЗначения = Тип("Строка") Тогда
		СтрокаТипа = "Строка";
		// Добавляем квалификаторы строки
		Если ОписаниеТипов <> Неопределено Тогда
			Если ОписаниеТипов.КвалификаторыСтроки.Длина > 0 Тогда
				СтрокаТипа = СтрокаТипа + СтрШаблон("(%1)", ОписаниеТипов.КвалификаторыСтроки.Длина);
			ИначеЕсли ОписаниеТипов.КвалификаторыСтроки.ДопустимаяДлина = ДопустимаяДлина.Переменная Тогда
				СтрокаТипа = СтрокаТипа + "(0)";
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли ТипЗначения = Тип("Дата") Тогда
		СтрокаТипа = "Дата";
		// Добавляем квалификаторы даты
		Если ОписаниеТипов <> Неопределено Тогда
			СтрокаТипа = СтрокаТипа + "(" + Строка(ОписаниеТипов.КвалификаторыДаты.ЧастиДаты) + ")";
		КонецЕсли;
	ИначеЕсли ТипЗначения = Тип("Массив") Тогда
		СтрокаТипа = "Массив";
	ИначеЕсли Справочники.ТипВсеСсылки().СодержитТип(ТипЗначения) Тогда
		СтрокаТипа = "СправочникСсылка." + МетаданныеТипа.Имя;
	ИначеЕсли Перечисления.ТипВсеСсылки().СодержитТип(ТипЗначения) Тогда
		СтрокаТипа = "ПеречислениеСсылка." + МетаданныеТипа.Имя;
	ИначеЕсли Документы.ТипВсеСсылки().СодержитТип(ТипЗначения) Тогда
		СтрокаТипа = "ДокументСсылка." + МетаданныеТипа.Имя;
	Иначе
		СтрокаТипа = Строка(ТипЗначения);
	КонецЕсли;
	
	Возврат СтрокаТипа;
	
КонецФункции

#КонецОбласти

#Область СериализацияВMarkdown

Процедура СериализоватьТаблицуВMarkdown(Конструктор, Данные, ИмяПеременной)
	
	СериализованныеДанные = Новый ТаблицаЗначений();
	Для Каждого Колонка Из Данные.Колонки Цикл
		СериализованныеДанные.Колонки.Добавить(Колонка.Имя, Новый ОписаниеТипов("Строка"), , СтрДлина(Колонка.Имя));
	КонецЦикла;
	
	Для Каждого Строка Из Данные Цикл
		
		НоваяСтрока = СериализованныеДанные.Добавить();
		Для Инд = 0 По Данные.Колонки.Количество() - 1 Цикл
			НоваяСтрока[Инд] = ЗначениеВСтрокуMarkdown(Строка[Инд]);
			СериализованныеДанные.Колонки[Инд].Ширина = Макс(СериализованныеДанные.Колонки[Инд].Ширина, СтрДлина(НоваяСтрока[Инд]));
		КонецЦикла;
		
	КонецЦикла;
	
	Конструктор.НоваяСтрока(ИмяПеременной + " = ");
	ЗаголовокТаблицыВMarkdown(Конструктор, СериализованныеДанные.Колонки, Символы.Таб);
	
	Для Каждого Строка Из СериализованныеДанные Цикл
		СтрокаТаблицыВMarkdown(Конструктор, Строка, СериализованныеДанные.Колонки, Символы.Таб);
	КонецЦикла;
	
	Конструктор.ДобавитьВКонецСтроки(""";");
	
КонецПроцедуры

Процедура ЗаголовокТаблицыВMarkdown(Конструктор, Колонки, Префикс)
	
	ДанныеСтроки = Новый Массив;
	ДанныеСтроки.Добавить(Префикс + """|");
	
	Для Каждого Колонка Из Колонки Цикл
		Ячейка = СтрШаблон(" %1 |", ЮТСтроки.ДополнитьСправа(Колонка.Имя, Колонка.Ширина));
		ДанныеСтроки.Добавить(Ячейка);
	КонецЦикла;
	
	Конструктор.НоваяСтрока(СтрСоединить(ДанныеСтроки));
	
	// Разделитель
	ДанныеСтроки = Новый Массив;
	ДанныеСтроки.Добавить(Префикс + "||");
	
	Для Каждого Колонка Из Колонки Цикл
		Ячейка = СтрШаблон(" %1 |", ЮТСтроки.СтрокаСимволов("-", Колонка.Ширина));
		ДанныеСтроки.Добавить(Ячейка);
	КонецЦикла;
	
	Конструктор.НоваяСтрока(СтрСоединить(ДанныеСтроки));
	
КонецПроцедуры

Процедура СтрокаТаблицыВMarkdown(Конструктор, СтрокаДанных, Колонки, Префикс)
	
	ДанныеСтроки = Новый Массив;
	ДанныеСтроки.Добавить(Префикс + "||");
	
	Для Инд = 0 По Колонки.Количество() - 1 Цикл
		Ячейка = СтрШаблон(" %1 |", ЮТСтроки.ДополнитьСправа(СтрокаДанных[Инд], Колонки[Инд].Ширина));
		ДанныеСтроки.Добавить(Ячейка);
	КонецЦикла;
	
	Конструктор.НоваяСтрока(СтрСоединить(ДанныеСтроки));
	
КонецПроцедуры

Функция ЗначениеВСтрокуMarkdown(Значение)
	
	Результат = "";
	
	Если НЕ ЗначениеЗаполнено(Значение) Тогда
		Возврат Результат;
	КонецЕсли;
	
	ТекТип = ТипЗнч(Значение);
	
	Если ТекТип = Тип("Булево") Тогда
		
		Результат = Формат(Значение, "БЛ=Ложь; БИ=Истина");
		
	ИначеЕсли ТекТип = Тип("Строка") Тогда
		
		Результат = ЭкранированиеСтроки(Значение);
		
	ИначеЕсли ТекТип = Тип("Число") Тогда
		
		Результат = Формат(Значение, "ЧГ=;ЧРД='.'");
		
	ИначеЕсли ТекТип = Тип("Дата") Тогда
		
		Результат = Формат(Значение, "ДФ='гггг.ММ.дд ЧЧ:мм:сс';");
		
	ИначеЕсли ЮТТипыДанныхСлужебный.ЭтоСистемноеПеречисление(ТекТип) Тогда
		
		Результат = Строка(Значение);
		
	ИначеЕсли Перечисления.ТипВсеСсылки().СодержитТип(ТекТип) Тогда
		
		МетаданныеТипа = Метаданные.НайтиПоТипу(ТекТип);
		ИмяПеречисления = МетаданныеТипа.Имя;
		Индекс = Перечисления[ИмяПеречисления].Индекс(Значение);
		Результат = Метаданные.Перечисления[ИмяПеречисления].ЗначенияПеречисления[Индекс].Имя;
		
	ИначеЕсли ЮТТипыДанныхСлужебный.ЭтоСсылочныйТип(ТекТип) Тогда
		
		ОписаниеОбъектаМетаданных = ЮТМетаданные.ОписаниеОбъектаМетаданных(ТекТип);
		
		Если ОписаниеОбъектаМетаданных = Неопределено Тогда
			Результат = СтрШаблон("!Тип (%1) не поддерживается!", ТекТип);
		ИначеЕсли ОписаниеОбъектаМетаданных.ОписаниеТипа.Предопределенные И Значение.Предопределенный Тогда
			Результат = Значение.ИмяПредопределенныхДанных;
		ИначеЕсли ЮТМетаданные.ЭтоДокумент(ОписаниеОбъектаМетаданных) Тогда
			Результат = СокрЛП(Значение.Номер);
		ИначеЕсли ЮТМетаданные.ЭтоПланСчетов(ОписаниеОбъектаМетаданных) И ОписаниеОбъектаМетаданных.Реквизиты.Свойство("Код") Тогда
			Результат = СокрЛП(Значение.Код);
		Иначе
			Результат = СтрЗаменить(Значение.Наименование, """", """"""); // Замена одной кавычки на две
		КонецЕсли;
		
	Иначе
		
		Результат = СтрШаблон("!Тип (%1) не поддерживается!", ТекТип);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область Сериализация

Функция СсылочноеЗначениеВСтроку(Значение, ДопИнфоКомментарий)
	
	Описание = ЮТМетаданные.ОписаниеОбъектаМетаданных(Значение);
	
	Если Описание <> Неопределено И НЕ ЗначениеЗаполнено(Значение) Тогда
		Возврат СтрШаблон("%1.%2.ПустаяСсылка()", Описание.ОписаниеТипа.ИмяКоллекции, Описание.Имя);
	КонецЕсли;
	
	Если ЮТМетаданные.ЭтоПеречисление(Описание) Тогда
		
		Индекс = Перечисления[Описание.Имя].Индекс(Значение);
		ИмяЗначенияПеречисления = Метаданные.Перечисления[Описание.Имя].ЗначенияПеречисления[Индекс].Имя;
		Результат = СтрШаблон("Перечисления.%1.%2", Описание.Имя, ИмяЗначенияПеречисления);
		
		ДопИнфоКомментарий = " // Еще варианты: " + ВариантыПеречисленийВСтроку(Метаданные.Перечисления[Описание.Имя].ЗначенияПеречисления, 
			", ", ИмяЗначенияПеречисления);
		
	ИначеЕсли ЮТМетаданные.ЭтоДокумент(Описание) Тогда
		Результат = СтрШаблон("Документы.%1.НайтиПоНомеру(""%2"", '%3')",
							  Описание.Имя,
							  СокрЛП(Значение.Номер),
							  Формат(Значение.Дата, "ДФ='гггг.ММ.дд ЧЧ:мм:сс';"));
		
	Иначе
		ОбъектМетаданныхПуть = СтрШаблон("%1.%2", Описание.ОписаниеТипа.ИмяКоллекции, Описание.Имя);
		
		Если ЮТМетаданные.ЭтоСправочник(Описание) И Значение.Предопределенный Тогда
			Результат = СтрШаблон("%1.%2", ОбъектМетаданныхПуть, Значение.ИмяПредопределенныхДанных);
			
			МетаданныеТипа = Метаданные[Описание.ОписаниеТипа.ИмяКоллекции][Описание.Имя];
			
			СтрокаВариантыПредопределенных = ВариантыПредопределенныхВСтроку(МетаданныеТипа.ПолучитьИменаПредопределенных(), ", ", Значение.ИмяПредопределенныхДанных);
			ДопИнфоКомментарий = ?(СтрокаВариантыПредопределенных = "", "", " // Еще варианты предопределенных: " + СтрокаВариантыПредопределенных);
		ИначеЕсли ЮТМетаданные.ЭтоПланСчетов(Описание) И Описание.Реквизиты.Свойство("Код") Тогда
			Результат = СтрШаблон("%1.НайтиПоКоду(""%2"")", ОбъектМетаданныхПуть, Значение.Код);
			ДопИнфоКомментарий = " // " + Значение.Наименование;
		Иначе
			ЭкранированноеНаименование = СтрЗаменить(Значение.Наименование, """", """"""); // Замена одной кавычки на две
			Результат = СтрШаблон("%1.НайтиПоНаименованию(""%2"", Истина)", ОбъектМетаданныхПуть, ЭкранированноеНаименование);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ВариантыПеречисленийВСтроку(ЗначенияПеречисления, Разделитель = ", ", ИсключаемоеЗначение = "")

	СтрокаПеречислений = "";
	Для Каждого ТекЗначение Из ЗначенияПеречисления Цикл
		
		Если ТекЗначение.Имя = ИсключаемоеЗначение Тогда
			Продолжить;
		КонецЕсли;
		Если ЗначениеЗаполнено(СтрокаПеречислений) Тогда
			СтрокаПеречислений = СтрокаПеречислений + ", ";
		КонецЕсли;
		
		СтрокаПеречислений = СтрокаПеречислений + ТекЗначение.Имя;
	
	КонецЦикла;
	
	Возврат СтрокаПеречислений;

КонецФункции

Функция ВариантыПредопределенныхВСтроку(МассивПредопределенных, Разделитель = ", ", ИсключаемоеЗначение = "")
	
	СтрокаРезультата = "";
	Для Каждого ТекЗначение Из МассивПредопределенных Цикл
	
		Если ТекЗначение = ИсключаемоеЗначение Тогда
			Продолжить;
		КонецЕсли;
		Если ЗначениеЗаполнено(СтрокаРезультата) Тогда
			СтрокаРезультата = СтрокаРезультата + ", ";
		КонецЕсли;
		
		СтрокаРезультата = СтрокаРезультата + ТекЗначение;
	
	КонецЦикла;
	
	Возврат СтрокаРезультата;

КонецФункции

Функция ЭкранированиеСтроки(Значение)
	
	ЭкранированноеНаименование = Строка(Значение);
	ЭкранированноеНаименование = СтрЗаменить(ЭкранированноеНаименование, Символы.ПС, Символы.ПС + "|" );
	ЭкранированноеНаименование = СтрЗаменить(ЭкранированноеНаименование, "'", "''" );
	ЭкранированноеНаименование = СтрЗаменить(ЭкранированноеНаименование, """", """"""); // Замена одной кавычки на две
	
	Возврат ЭкранированноеНаименование;
	
КонецФункции

#КонецОбласти

#КонецОбласти
