//©///////////////////////////////////////////////////////////////////////////©//
//
//  Copyright 2021-2025 BIA-Technologies Limited Liability Company
//
//  Licensed under the Apache License, Version 2.0 (the "License");
//  you may not use this file except in compliance with the License.
//  You may obtain a copy of the License at
//
//      http://www.apache.org/licenses/LICENSE-2.0
//
//  Unless required by applicable law or agreed to in writing, software
//  distributed under the License is distributed on an "AS IS" BASIS,
//  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//  See the License for the specific language governing permissions and
//  limitations under the License.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область СлужебныйПрограммныйИнтерфейс

// Общий модуль с тестами
Процедура ИсполняемыеСценарии() Экспорт
	ЮТТесты
		.ДобавитьТест("Локализация")
		.ДобавитьТест("УстановитьЛокализацию").После("СброситьЛокализацию")
		.ДобавитьТест("Люди")
		.ДобавитьТест("Компании")
		.ДобавитьТест("Банки");
КонецПроцедуры

Процедура СброситьЛокализацию() Экспорт
	// Обработчик события "ПослеТеста"
	ЮТПодражатель.УстановитьЛокализацию("");
КонецПроцедуры

// Тест метода Локализация
Процедура Локализация() Экспорт
	// Выполнение
	ТекущаяЛокализация = ЮТПодражатель.Локализация();
	
	// Проверка
	ЮТест.ОжидаетЧто(ТекущаяЛокализация, "Текущая локализация")
		.Заполнено()
		.ИмеетТип("Строка");
КонецПроцедуры

// Тест метода УстановитьЛокализацию
Процедура УстановитьЛокализацию() Экспорт
	// Подготовка
	НоваяЛокализация = "en";
	
	// Выполнение
	ЮТПодражатель.УстановитьЛокализацию(НоваяЛокализация);
	
	// Проверка
	ЮТест.ОжидаетЧто(ЮТПодражатель.Локализация(), "Установленная локализация")
		.Равно(НоваяЛокализация);
КонецПроцедуры

// Тест метода Люди
Процедура Люди() Экспорт
	// Выполнение
	ГенераторЛюдей = ЮТПодражатель.Люди();
	
	// Проверка
	ЮТест.ОжидаетЧто(ГенераторЛюдей, "Генератор данных о людях")
		.ИмеетТип("CommonModule");
КонецПроцедуры

// Тест метода Компании
Процедура Компании() Экспорт
	// Выполнение
	ГенераторКомпаний = ЮТПодражатель.Компании();
	
	// Проверка
	ЮТест.ОжидаетЧто(ГенераторКомпаний, "Генератор данных о компаниях")
		.ИмеетТип("CommonModule");
КонецПроцедуры

// Тест метода Банки
Процедура Банки() Экспорт
	// Выполнение
	ГенераторБанков = ЮТПодражатель.Банки();
	
	// Проверка
	ЮТест.ОжидаетЧто(ГенераторБанков, "Генератор данных о банках")
		.ИмеетТип("CommonModule");
КонецПроцедуры

#КонецОбласти
