//©///////////////////////////////////////////////////////////////////////////©//
//
//  Copyright 2021-2024 BIA-Technologies Limited Liability Company
//
//  Licensed under the Apache License, Version 2.0 (the "License");
//  you may not use this file except in compliance with the License.
//  You may obtain a copy of the License at
//
//      http://www.apache.org/licenses/LICENSE-2.0
//
//  Unless required by applicable law or agreed to in writing, software
//  distributed under the License is distributed on an "AS IS" BASIS,
//  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//  See the License for the specific language governing permissions and
//  limitations under the License.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область СлужебныйПрограммныйИнтерфейс

Процедура ИсполняемыеСценарии() Экспорт
	
	ЮТТесты
		.ДобавитьТест("ПроверкаПростогоМассива")
		.ДобавитьТест("ПроверкаМассиваСтруктур")
	;
		
КонецПроцедуры

Процедура ПроверкаПростогоМассива() Экспорт
	
	ЮТест.ОжидаетЧтоКоллекция(ЮТОбщий.ЗначениеВМассиве(1, 2, 3))
		.ИмеетДлину(3)
		.Элемент(1).Равно(2)
		;
	
КонецПроцедуры

Процедура ПроверкаМассиваСтруктур() Экспорт
	
	Ключи = "Строка, Число, Дата";
	Данные = Новый Массив();
	
	Данные.Добавить(Новый Структура(Ключи, "1", 1, '00010101'));
	Данные.Добавить(Новый Структура(Ключи, "2", 2, '00020101'));
	Данные.Добавить(Новый Структура(Ключи, "3", 3, '00030101'));
	
	ЮТест.ОжидаетЧтоКоллекция(Данные)
		.ИмеетДлину(3)
		.Элементы()
			.ИмеетТип("Структура")
			.ИмеетСвойство("Строка")
			.ИмеетСвойство("Число")
			.ИмеетСвойство("Дата")
		.Элемент(2)
			.Свойство("Число").Равно(1)
		;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
