//©///////////////////////////////////////////////////////////////////////////©//
//
//  Copyright 2021-2025 BIA-Technologies Limited Liability Company
//
//  Licensed under the Apache License, Version 2.0 (the "License");
//  you may not use this file except in compliance with the License.
//  You may obtain a copy of the License at
//
//      http://www.apache.org/licenses/LICENSE-2.0
//
//  Unless required by applicable law or agreed to in writing, software
//  distributed under the License is distributed on an "AS IS" BASIS,
//  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//  See the License for the specific language governing permissions and
//  limitations under the License.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область СлужебныйПрограммныйИнтерфейс

Процедура ИсполняемыеСценарии() Экспорт
	
	// Настройка базовых тегов Allure для дымовых тестов - должна быть в самом начале
	ЮТТесты.Настроить(ЮТАлюр
		.Epic("Дымовые тесты")
		.ParentSuite("Дымовые тесты")
		.Feature("Проверка прав"));
	
	Настройки = ЮТДымовыеТесты.ПараметрыВидаДымовогоТеста(КлючНастройки());
	
	Если НЕ Настройки.Использовать Тогда
		Возврат;
	КонецЕсли;
	
	ПроверкиПрав = ДТПроверкаПравСлужебныйВызовСервера.ПроверкиПрав();
	
	ЗарегистрироватьНаборПроверок("Проверка прав. Интерактивное удаление", 
									ПроверкиПрав.ИнтерактивноеУдаление, "ПроверитьОтсутствиеПраваУРолей");
	
	ЗарегистрироватьНаборПроверок("Проверка прав. Интерактивное удаление помеченных", 
									ПроверкиПрав.ИнтерактивноеУдалениеПомеченных, "ПроверитьОтсутствиеПраваУРолей");
	
	ЗарегистрироватьНаборПроверок("Проверка прав. Чтение не администраторами",
								  	ПроверкиПрав.ЧтениеНеАдминистраторами, "ПроверитьЧтениеНеАдминистраторами");
	
КонецПроцедуры

#КонецОбласти

#Область Тесты

Процедура ПроверитьОтсутствиеПраваУРолей(ОписаниеПроверки) Экспорт
	
	РолиСПравом = ДТПроверкаПравСлужебныйВызовСервера.РолиСПравом(ОписаниеПроверки.ПолноеИмя,
																  ОписаниеПроверки.Право, ОписаниеПроверки.ИсключенияРолей);
	
	ЮТест.ОжидаетЧто(РолиСПравом, ТекстОшибкиПраваНеДолжноБыть(ОписаниеПроверки, РолиСПравом)).ИмеетДлину(0);
	
КонецПроцедуры

Процедура ПроверитьЧтениеНеАдминистраторами(ОписаниеПроверки) Экспорт
	
	РолиСПравом = ДТПроверкаПравСлужебныйВызовСервера.РолиСПравом(ОписаниеПроверки.ПолноеИмя,
																  "Чтение", ОписаниеПроверки.ИсключенияРолей);
	
	ЮТест.ОжидаетЧто(РолиСПравом, ТекстОшибкиНетЧтенияНеАдминистраторами(ОписаниеПроверки)).ИмеетДлинуБольше(0);
	
КонецПроцедуры

#КонецОбласти

#Область Контекст

Функция Настройки() Экспорт
	
	Возврат ЮТКонтекстСлужебный.ЗначениеКонтекста(ИмяКонтекстаНастройки());
	
КонецФункции

Функция ИмяКонтекстаНастройки()
	
	Возврат "ДымовыеТесты_ПроверкаПрав";
	
КонецФункции

#КонецОбласти

#Область ЗагрузкаНастроек

Функция ЗагрузитьНастройки(ЗагружаемаяНастройка)
	
	НастройкиТестов = НастройкиПоУмолчанию();
	Путь = "ДымовыеТесты.ПроверкаПрав";
	
	Для Каждого Элемент Из ЗагружаемаяНастройка Цикл
		
		ЭтоБазоваяНастройка = ЮТДымовыеТестыСлужебныйКлиентСервер.ПрочитанБазовыеЭлементНастройки(НастройкиТестов,
																								  Элемент.Ключ,
																								  Элемент.Значение,
																								  Путь);
		
		Если ЭтоБазоваяНастройка Тогда
			Продолжить;
		ИначеЕсли ЭтоНастройкаВидаПроверкиПрав(Элемент.Ключ) Тогда
			НастройкиТестов.Вставить(Элемент.Ключ, НастройкаВидаПроверкиПрав(Элемент.Значение, Путь + "." + Элемент.Ключ));
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат НастройкиТестов;
	
КонецФункции

Функция НастройкаВидаПроверкиПрав(ЗначениеНастройки, Путь)
	
	Настройка = БазовоеОписаниеНастройкиВидаПроверкиПрав();
	ЗагружаемаяНастройка = НормализованноеЗначениеНастройки(ЗначениеНастройки); 
	
	КлючИсключенияРолей = "ИсключенияРолей";
	
	Для Каждого Элемент Из ЗагружаемаяНастройка Цикл
		
		ЭтоБазоваяНастройка = ЮТДымовыеТестыСлужебныйКлиентСервер.ПрочитанБазовыеЭлементНастройки(Настройка,
																								  Элемент.Ключ,
																								  Элемент.Значение,
																								  Путь);
		
		Если ЭтоБазоваяНастройка Тогда
			Продолжить;
		ИначеЕсли Элемент.Ключ = КлючИсключенияРолей Тогда
			Настройка.Вставить(КлючИсключенияРолей, 
				ЮТДымовыеТестыСлужебныйКлиентСервер.НормализованнаяНастройкаИсключений(Элемент.Значение));
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Настройка;
	
КонецФункции

Функция НормализованноеЗначениеНастройки(Настройка)
	
	Если ТипЗнч(Настройка) = Тип("Булево") Тогда
		Возврат Новый Структура("Использовать", Настройка);
	Иначе
		Возврат Настройка;
	КонецЕсли;
	
КонецФункции

Функция НастройкиПоУмолчанию()
	
	Настройки = ЮТДымовыеТесты.БазовоеОписаниеЭлементаНастройки();
	Настройки.Вставить("ИнтерактивноеУдаление", БазовоеОписаниеНастройкиВидаПроверкиПрав());
	Настройки.Вставить("ИнтерактивноеУдалениеПомеченных", БазовоеОписаниеНастройкиВидаПроверкиПрав());
	Настройки.Вставить("ЧтениеНеАдминистраторами", БазовоеОписаниеНастройкиВидаПроверкиПрав());  
	Настройки.Использовать = Истина;
	
	Возврат Настройки;
	
КонецФункции

Функция БазовоеОписаниеНастройкиВидаПроверкиПрав()
	
	Настройка = ЮТДымовыеТесты.БазовоеОписаниеЭлементаНастройки();
	Настройка.Вставить("ИсключенияРолей", Новый Массив);
	
	Возврат Настройка;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция КлючНастройки()
	
	Возврат "ПроверкаПрав";
	
КонецФункции

Процедура ЗарегистрироватьНаборПроверок(ПредставлениеНабора, Проверки, ИмяМетода)
	
	Если НЕ ЗначениеЗаполнено(Проверки) Тогда
		Возврат;
	КонецЕсли;
	
	ЮТТесты.ДобавитьТестовыйНабор(ПредставлениеНабора)
		.Настроить(ЮТАлюр
			.Suite("Проверка прав")
			.SubSuite(ПредставлениеНабора));
	
	Для Каждого ОписаниеПроверки Из Проверки Цикл
		ЗарегистрироватьТест(ОписаниеПроверки, ИмяМетода);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗарегистрироватьТест(ОписаниеПроверки, ИмяМетода)
	
	ПредставлениеТеста = СтрШаблон("%1.%2", ОписаниеПроверки.ПолноеИмя, ОписаниеПроверки.Представление);
	
	ЮТТесты.ДобавитьСерверныйТест(ИмяМетода, ПредставлениеТеста, ОписаниеПроверки.Тег)
		.Настроить(ЮТАлюр
			.Story(ОписаниеПроверки.ПолноеИмя)
			.SubSuite(ОписаниеПроверки.Представление)
			.Package("Smoke.ДТПроверкаПрав." + ОписаниеПроверки.КлючПроверки + "." + ОписаниеПроверки.ПолноеИмя))
		.СПараметрами(ОписаниеПроверки);
	
КонецПроцедуры

Функция ЭтоНастройкаВидаПроверкиПрав(Ключ)
	
	Возврат Ключ = "ИнтерактивноеУдаление"
		Или Ключ = "ИнтерактивноеУдалениеПомеченных"
		Или Ключ = "ЧтениеНеАдминистраторами";
	
КонецФункции

Функция ТекстОшибкиПраваНеДолжноБыть(ОписаниеПроверки, РолиСПравом)
	
	Возврат СтрШаблон("У объекта `%1` есть право `%2` у ролей:%3%4",
				ОписаниеПроверки.ПолноеИмя, ОписаниеПроверки.Право, Символы.ПС, СтрСоединить(РолиСПравом, Символы.ПС));
	
КонецФункции

Функция ТекстОшибкиНетЧтенияНеАдминистраторами(ОписаниеПроверки)
	
	Возврат СтрШаблон("У объекта `%1` нет роли с правом `Чтение`, кроме основных ролей конфигурации и исключений",
				ОписаниеПроверки.ПолноеИмя);
	
КонецФункции

#КонецОбласти
