Процедура НовыйИдентификаторПодписчикаУведомлений(Подписчик, Идентификатор) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	МобильныеУстройства.Ссылка КАК Ссылка,
	               |	МобильныеУстройства.ПометкаУдаления КАК ПометкаУдаления
	               |ИЗ
	               |	Справочник.МобильныеУстройства КАК МобильныеУстройства
	               |ГДЕ
	               |	МобильныеУстройства.Подписчик = &Подписчик";	
	Запрос.УстановитьПараметр("Подписчик", Подписчик);
	Выборка = Запрос.Выполнить().Выбрать();
	Устройство = 0;
	Пока Выборка.Следующий() Цикл
		Если Выборка.ПометкаУдаления = Ложь Тогда
			Устройство = Выборка.Ссылка.ПолучитьОбъект();
			Прервать;
        КонецЕсли;
	КонецЦикла;
	
	Если Устройство = 0 Тогда
        Устройство = СоздатьЭлемент();
		Устройство.Владелец = Пользователи.ТекущийПользователь();
		Устройство.Подписчик = Подписчик;
	КонецЕсли;
	
	Устройство.ИдентификаторПодписчикаДоставляемыхУведомлений = Новый ХранилищеЗначения(Идентификатор);
	Устройство.Записать();
	
КонецПроцедуры
	