//©///////////////////////////////////////////////////////////////////////////©//
//
//  Copyright 2021-2025 BIA-Technologies Limited Liability Company
//
//  Licensed under the Apache License, Version 2.0 (the "License");
//  you may not use this file except in compliance with the License.
//  You may obtain a copy of the License at
//
//      http://www.apache.org/licenses/LICENSE-2.0
//
//  Unless required by applicable law or agreed to in writing, software
//  distributed under the License is distributed on an "AS IS" BASIS,
//  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//  See the License for the specific language governing permissions and
//  limitations under the License.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область ПрограммныйИнтерфейс

// Найти ссылку по реквизиту.
// 
// Параметры:
//  МетаданныеОбъекта - ОбъектМетаданных - метаданные
//                    - Произвольный - менеджер
//                    - Строка - полное имя метаданных или менеджера
//                    - Тип, ОписаниеТипов - тип значения
//  ИмяРеквизита - Строка
//  ЗначениеРеквизита - Произвольный
// 
// Возвращаемое значение:
//  Неопределено - Найти ссылку по реквизиту
Функция СсылкаПоРеквизиту(МетаданныеОбъекта, ИмяРеквизита, ЗначениеРеквизита) Экспорт
#Если Сервер Тогда
	Возврат ЮТПоискДанныхСлужебныйСервер.СсылкаПоРеквизиту(МетаданныеОбъекта, ИмяРеквизита, ЗначениеРеквизита);
#Иначе
	Возврат ЮТПоискДанныхСлужебныйВызовСервера.СсылкаПоРеквизиту(МетаданныеОбъекта, ИмяРеквизита, ЗначениеРеквизита);
#КонецЕсли
КонецФункции

// Случайная ссылка.
// 
// Параметры:
//  МетаданныеОбъекта - ОбъектМетаданных - метаданные
//                    - Произвольный - менеджер
//                    - Строка - полное имя метаданных или менеджера
//                    - Тип, ОписаниеТипов - тип значения
//  Отборы - Массив из см. ЮТФабрика.ВыражениеПредиката - Набор условий, см. ЮТПредикаты.Получить
//           - см. ЮТФабрика.ВыражениеПредиката
//           - ОбщийМодуль - Модуль настройки предикатов, см. ЮТест.Предикат
//           - Структура, Соответствие - Набор условий
//           - Неопределено - Проверит, что таблица не пустая
// 
// Возвращаемое значение:
//  Неопределено - Случайная ссылка
Функция СлучайнаяСсылка(МетаданныеОбъекта, Отборы = Неопределено) Экспорт
#Если Сервер Тогда
	Возврат ЮТПоискДанныхСлужебныйСервер.СлучайнаяСсылка(МетаданныеОбъекта, Отборы);
#Иначе
	Возврат ЮТПоискДанныхСлужебныйВызовСервера.СлучайнаяСсылка(МетаданныеОбъекта, Отборы);
#КонецЕсли
КонецФункции

// Случайная ссылка.
// 
// Параметры:
//  МетаданныеОбъекта - ОбъектМетаданных - метаданные
//                    - Произвольный - менеджер
//                    - Строка - полное имя метаданных или менеджера
//                    - Тип, ОписаниеТипов - тип значения
//  Значение - Строка, Число, УникальныйИдентификатор - Значение поиска
//  Отборы - Массив из см. ЮТФабрика.ВыражениеПредиката - Набор условий, см. ЮТПредикаты.Получить
//           - см. ЮТФабрика.ВыражениеПредиката
//           - ОбщийМодуль - Модуль настройки предикатов, см. ЮТест.Предикат
//           - Структура, Соответствие - Набор условий
//           - Неопределено - Проверит, что таблица не пустая
// 
// Возвращаемое значение:
//  Неопределено - Случайная ссылка
Функция Ссылка(МетаданныеОбъекта, Значение, Отборы = Неопределено) Экспорт
#Если Сервер Тогда
	Возврат ЮТПоискДанныхСлужебныйСервер.Ссылка(МетаданныеОбъекта, Значение, Отборы);
#Иначе
	Возврат ЮТПоискДанныхСлужебныйВызовСервера.Ссылка(МетаданныеОбъекта, Значение, Отборы);
#КонецЕсли
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
