//©///////////////////////////////////////////////////////////////////////////©//
//
//  Copyright 2021-2025 BIA-Technologies Limited Liability Company
//
//  Licensed under the Apache License, Version 2.0 (the "License");
//  you may not use this file except in compliance with the License.
//  You may obtain a copy of the License at
//
//      http://www.apache.org/licenses/LICENSE-2.0
//
//  Unless required by applicable law or agreed to in writing, software
//  distributed under the License is distributed on an "AS IS" BASIS,
//  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//  See the License for the specific language governing permissions and
//  limitations under the License.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область СлужебныйПрограммныйИнтерфейс

Процедура ИсполняемыеСценарии() Экспорт
	
	// Настройка базовых тегов Allure для дымовых тестов - должна быть в самом начале
	ЮТТесты.Настроить(ЮТАлюр
		.Epic("Дымовые тесты")
		.ParentSuite("Дымовые тесты")
		.Feature("Проведение документов"));
	
	Настройки = ЮТДымовыеТесты.ПараметрыВидаДымовогоТеста(КлючНастройки());
	
	Если НЕ Настройки.Использовать Тогда
		Возврат;
	КонецЕсли;
	
	ЮТТесты.ВТранзакции().УдалениеТестовыхДанных();	
	
	ДокументыДляПроведения = ДТПроведениеДокументовСлужебныйВызовСервера.ДокументыДляПроведения();
	
	Если НЕ ЗначениеЗаполнено(ДокументыДляПроведения) Тогда
		Возврат;
	КонецЕсли;
	
	ЮТТесты.ДобавитьТестовыйНабор("Проведение документов").Настроить(ЮТАлюр.Suite("Проведение документов"));
	
	Для Каждого ОписаниеДокумента Из ДокументыДляПроведения Цикл
		ЗарегистрироватьТест(ОписаниеДокумента);
	КонецЦикла;	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция КлючНастройки()
	
	Возврат "ПроведениеДокументов";
	
КонецФункции

Процедура ЗарегистрироватьТест(ОписаниеДокумента)
	
	ПредставлениеОбъекта = СтрШаблон("Документ.%1", ОписаниеДокумента.Имя);
	ПредставлениеТеста = СтрШаблон("%1.Проведение последнего существующего документа", ПредставлениеОбъекта);
	
	ЮТТесты.ДобавитьСерверныйТест("ПровестиДокумент", ПредставлениеТеста, "Проведение")
		.Настроить(ЮТАлюр
			.Story(ПредставлениеОбъекта)
			.SubSuite(ОписаниеДокумента.Имя)
			.Package("Smoke.ДТПроведениеДокументов." + ПредставлениеОбъекта))
		.СПараметрами(ОписаниеДокумента);
	
КонецПроцедуры

#Область Тесты

Процедура ПровестиДокумент(ОписаниеДокумента) Экспорт
	
	СсылкаДокумента = ДТПроведениеДокументовСлужебныйВызовСервера.ПоследнийДокумент(ОписаниеДокумента.Имя);
	
	Если НЕ ЗначениеЗаполнено(СсылкаДокумента) Тогда
		ЮТест.Пропустить(СтрШаблон("Не найден существующий документ `Документ.%1`", ОписаниеДокумента.Имя));
	КонецЕсли;
	
	Попытка
		ОбъектДокумента = СсылкаДокумента.ПолучитьОбъект();
		ОбъектДокумента.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		ЮТРегистрацияОшибок.ДобавитьПояснениеОшибки("Ошибка проведения документа");
		ВызватьИсключение;
	КонецПопытки;
	
	ЮТест.ОжидаетЧто(ОбъектДокумента.Ссылка.Проведен, "Документ должен быть проведен").ЭтоИстина();
	
КонецПроцедуры

#КонецОбласти

#Область Контекст

Функция Настройки() Экспорт
	
	Возврат ЮТКонтекстСлужебный.ЗначениеКонтекста(ИмяКонтекстаНастройки());
	
КонецФункции

Функция ИмяКонтекстаНастройки()
	
	Возврат "ДымовыеТесты_ПроведениеДокументов";
	
КонецФункции

#КонецОбласти

#Область ЗагрузкаНастроек

Функция ЗагрузитьНастройки(ЗагружаемаяНастройка)
	
	НастройкиТестов = НастройкиПоУмолчанию();
	Путь = "ДымовыеТесты.ПроведениеДокументов";
	
	Для Каждого Элемент Из ЗагружаемаяНастройка Цикл
		
		ЭтоБазоваяНастройка = ЮТДымовыеТестыСлужебныйКлиентСервер.ПрочитанБазовыеЭлементНастройки(НастройкиТестов,
																								  Элемент.Ключ,
																								  Элемент.Значение,
																								  Путь);
		
		Если ЭтоБазоваяНастройка Тогда
			Продолжить;
		ИначеЕсли ЮТМетаданные.ТипыМетаданных().Свойство(Элемент.Ключ) Тогда
			ПрочитатьНастройкиТипаМетаданных(НастройкиТестов, Элемент.Ключ, Элемент.Значение, Путь);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат НастройкиТестов;
	
КонецФункции

Процедура ПрочитатьНастройкиТипаМетаданных(НастройкиТестов, ИмяНастройки, ЗначениеНастройки, Путь)
	
	НастройкиТипаМетаданных = ЮТДымовыеТесты.БазовоеОписаниеЭлементаНастройки();
	ТипМетаданного = ЮТМетаданные.ТипыМетаданных()[ИмяНастройки];
	
	ЗагружаемаяНастройка = НормализованноеЗначениеНастройки(ЗначениеНастройки);
	
	Для Каждого Элемент Из ЗагружаемаяНастройка Цикл		
		ЭтоБазоваяНастройка = ЮТДымовыеТестыСлужебныйКлиентСервер.ПрочитанБазовыеЭлементНастройки(НастройкиТипаМетаданных,
																								  Элемент.Ключ,
																								  Элемент.Значение,
																								  Путь);
		
		Если ЭтоБазоваяНастройка Тогда
			Продолжить;
		КонецЕсли;
		
		ОписаниеНастройкиДокумента = НастройкаДокумента(Элемент.Значение, Путь + "." + ИмяНастройки + "." + Элемент.Ключ);
		НастройкиТипаМетаданных.Вставить(Элемент.Ключ, ОписаниеНастройкиДокумента);
	КонецЦикла;
	
	НастройкиТестов.Вставить(ТипМетаданного.Имя, НастройкиТипаМетаданных);
	
КонецПроцедуры

Функция НастройкаДокумента(ЗначениеНастройки, Путь)
	
	Настройка = ЮТДымовыеТесты.БазовоеОписаниеЭлементаНастройки(); 
	ЗагружаемаяНастройка = НормализованноеЗначениеНастройки(ЗначениеНастройки);
	
	Для Каждого Элемент Из ЗагружаемаяНастройка Цикл
		
		ЮТДымовыеТестыСлужебныйКлиентСервер.ПрочитанБазовыеЭлементНастройки(Настройка,
																			Элемент.Ключ,
																			Элемент.Значение,
																			Путь);
	КонецЦикла;
	
	Возврат Настройка;
	
КонецФункции

Функция НормализованноеЗначениеНастройки(Настройка)
	
	Если ТипЗнч(Настройка) = Тип("Булево") Тогда
		Возврат Новый Структура("Использовать", Настройка);
	Иначе
		Возврат Настройка;
	КонецЕсли;
	
КонецФункции

Функция НастройкиПоУмолчанию()
	
	Настройки = ЮТДымовыеТесты.БазовоеОписаниеЭлементаНастройки();
	Настройки.Использовать = Ложь;
	
	Возврат Настройки;
	
КонецФункции

#КонецОбласти

#КонецОбласти
