//©///////////////////////////////////////////////////////////////////////////©//
//
//  Copyright 2021-2025 BIA-Technologies Limited Liability Company
//
//  Licensed under the Apache License, Version 2.0 (the "License");
//  you may not use this file except in compliance with the License.
//  You may obtain a copy of the License at
//
//      http://www.apache.org/licenses/LICENSE-2.0
//
//  Unless required by applicable law or agreed to in writing, software
//  distributed under the License is distributed on an "AS IS" BASIS,
//  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//  See the License for the specific language governing permissions and
//  limitations under the License.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область СлужебныйПрограммныйИнтерфейс

Функция ДокументыДляПроведения() Экспорт
	
	ПараметрыТестов = ПереопределеннаяНастройка(ЮТДымовыеТесты.ПараметрыДымовыхТестов(), "ПроведениеДокументов");
	НастройкаДокументов = ПереопределеннаяНастройка(ПараметрыТестов, "Документы");
	
	Результат = Новый Массив;
	
	Для Каждого ДокументМетаданных Из Метаданные.Документы Цикл	
		Если ДокументМетаданных.Проведение = Метаданные.СвойстваОбъектов.Проведение.Запретить
			ИЛИ НЕ ДокументПодходитДляПроведения(ДокументМетаданных, НастройкаДокументов) Тогда
			Продолжить;
		КонецЕсли;
		
		ОписаниеДокумента = Новый Структура("Тип, Имя", "Документ", ДокументМетаданных.Имя);    
		
		Результат.Добавить(ОписаниеДокумента);	
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ПоследнийДокумент(ИмяДокумента) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = СтрШаблон(
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Документы.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.%1 КАК Документы
		|ГДЕ
		|	Документы.Проведен
		|УПОРЯДОЧИТЬ ПО
		|	Документы.Дата УБЫВ", ИмяДокумента); // BSLLS:QueryParseError-off
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДокументПодходитДляПроведения(ДокументМетаданных, НастройкаДокументов)
	
	Если НЕ ПравоДоступа("Проведение", ДокументМетаданных) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ЮТДымовыеТестыСлужебныйКлиентСервер.ПодходитПодНаборыИсключений(ДокументМетаданных.Имя,
		НастройкаДокументов.НаборыИсключений) Тогда
		
		Возврат Ложь;
	КонецЕсли;
	
	НастройкаДокумента = ПереопределеннаяНастройка(НастройкаДокументов, ДокументМетаданных.Имя); 
	
	Возврат НастройкаДокумента.Использовать;
	
КонецФункции

Функция БазоваяНастройка()
	
	Настройка = Новый Структура;
	Настройка.Вставить("Использовать", Истина);
	Настройка.Вставить("НаборыИсключений", Новый Массив);
	
	Возврат Настройка;
	
КонецФункции

Функция ПереопределеннаяНастройка(БазоваяНастройка, Ключ)
	
	ТекущаяНастройка = ЮТКоллекции.ЗначениеСтруктуры(БазоваяНастройка, Ключ);
	
	Если ТекущаяНастройка = Неопределено Тогда
		Возврат БазоваяНастройка;
	КонецЕсли;
	
	Настройка = БазоваяНастройка();
	ЗаполнитьЗначенияСвойств(Настройка, БазоваяНастройка);
	
	ТипНастройки = ТипЗнч(ТекущаяНастройка);   
	
	Если ТипНастройки = Тип("Булево") Тогда
		ТекущаяНастройка = Новый Структура("Использовать", ТекущаяНастройка);
	ИначеЕсли ТекущаяНастройка.Свойство("Исключения") И ЗначениеЗаполнено(ТекущаяНастройка.Исключения) Тогда
		Исключения = ЮТДымовыеТестыСлужебныйКлиентСервер.НормализованнаяНастройкаИсключений(ТекущаяНастройка.Исключения);
		
		НаборыИсключений = ЮТКоллекции.СкопироватьМассив(Настройка.НаборыИсключений, Ложь);
		НаборыИсключений.Добавить(Исключения);   
		
		Настройка.НаборыИсключений = НаборыИсключений;
	КонецЕсли;
	
	ЮТКоллекции.ДополнитьСтруктуру(Настройка, ТекущаяНастройка);
	
	Возврат Настройка;
	
КонецФункции

#КонецОбласти
