//©///////////////////////////////////////////////////////////////////////////©//
//
//  Copyright 2021-2024 BIA-Technologies Limited Liability Company
//
//  Licensed under the Apache License, Version 2.0 (the "License");
//  you may not use this file except in compliance with the License.
//  You may obtain a copy of the License at
//
//      http://www.apache.org/licenses/LICENSE-2.0
//
//  Unless required by applicable law or agreed to in writing, software
//  distributed under the License is distributed on an "AS IS" BASIS,
//  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//  See the License for the specific language governing permissions and
//  limitations under the License.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область СлужебныйПрограммныйИнтерфейс

Функция ТипыТестов() Экспорт
	
	// При изменении списка типов необходимо скорректировать метода см. ДТОткрытиеФормСлужебныйВызовСервера.БазоваяНастройка
	Типы = Новый Структура;
	Типы.Вставить("Новый", "Новый");
	Типы.Вставить("НоваяГруппа", "НоваяГруппа");
	Типы.Вставить("Существующий", "Существующий");
	Типы.Вставить("СуществующаяГруппа", "СуществующаяГруппа");
	Типы.Вставить("Скопированный", "Скопированный");
	Типы.Вставить("СкопированнаяГруппа", "СкопированнаяГруппа");
	Типы.Вставить("Список", "Список");
	Типы.Вставить("Выбор", "Выбор");
	Типы.Вставить("ВыборГруппы", "ВыборГруппы");
	Типы.Вставить("Основная", "Основная");
	Типы.Вставить("Настройки", "Настройки");
	Типы.Вставить("Варианты", "Варианты");
	
	Возврат Типы;
	
КонецФункции

Функция ПараметрыТиповТестов() Экспорт
	
	Параметры = ЮТТестовыеДанные.СтруктураMarkDown("Имя",
		"| Имя                 | Право                   | ВидФормы             | Представление          |
		||---------------------|-------------------------|----------------------|------------------------|
		|| Новый               | ИнтерактивноеДобавление | ФормаОбъекта         | нового объекта         |
		|| НоваяГруппа         | ИнтерактивноеДобавление | ФормаГруппы          | новой группы           |
		|| Существующий        | Просмотр                | ФормаОбъекта         | существующего объекта  |
		|| СуществующаяГруппа  | Просмотр                | ФормаГруппы          | существующей группы    |
		|| Скопированный       | Редактирование          | ФормаОбъекта         | скопированного объекта |
		|| СкопированнаяГруппа | Редактирование          | ФормаГруппы          | скопированной группы   |
		|| Список              | Просмотр                | ФормаСписка          | списка                 |
		|| Выбор               | Просмотр                | ФормаДляВыбора       | выбора                 |
		|| ВыборГруппы         | Просмотр                | ФормаДляВыбораГруппы | выбора группы          |
		|| Основная            | Просмотр                | Форма                | основная               |
		|| Настройки           | Просмотр                | ФормаНастроек        | настройки отчета       |
		|| Варианты            | Просмотр                | ФормаВарианта        | выбора варианта        |");
	
	Возврат Параметры;
	
КонецФункции

#КонецОбласти
