//©///////////////////////////////////////////////////////////////////////////©//
//
//  Copyright 2021-2025 BIA-Technologies Limited Liability Company
//
//  Licensed under the Apache License, Version 2.0 (the "License");
//  you may not use this file except in compliance with the License.
//  You may obtain a copy of the License at
//
//      http://www.apache.org/licenses/LICENSE-2.0
//
//  Unless required by applicable law or agreed to in writing, software
//  distributed under the License is distributed on an "AS IS" BASIS,
//  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//  See the License for the specific language governing permissions and
//  limitations under the License.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция СформироватьКодДвижений(Документ, Регистры, ПараметрыФормирования) Экспорт
	
	Форматы = Форматы();
	Если ПараметрыФормирования.ТипКода = Форматы.ОсновнойКод Тогда
		ВызватьИсключение "Формирование движений для формата ""Основной код"" не поддерживается";
	КонецЕсли;
	
	ДанныеДвижений = Новый Соответствие();
	Для Каждого Регистр Из Регистры Цикл
		//@skip-check query-in-loop
		ДанныеРегистра = ДвиженияДокумента(Документ, Регистр);
		Если ЗначениеЗаполнено(ДанныеРегистра) Тогда
			ДанныеДвижений.Вставить(Регистр, ДанныеРегистра);
		КонецЕсли;
	КонецЦикла;
	
	Если ПараметрыФормирования.ТипКода = Форматы.ТаблицаMarkdownYaxunit Тогда
		
		Возврат ЮТГенераторКодаСлужебныйСервер.СформироватьКодДвиженийВФрматеMarkdown(Документ, ДанныеДвижений);
		
	ИначеЕсли ПараметрыФормирования.ТипКода = Форматы.КонструкторОбъектаYaxunit Тогда
		
		Возврат ЮТГенераторКодаСлужебныйСервер.СформироватьКодДвиженийВФрматеКонструктора(Документ, ДанныеДвижений);
		
	Иначе
		ВызватьИсключение "Неподдерживемый формат";
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция Форматы()
	
	Возврат Новый Структура("ОсновнойКод, КонструкторОбъектаYaxunit, ТаблицаMarkdownYaxunit",
							"ОсновнойКод",
							"КонструкторОбъектаYaxunit",
							"ТаблицаMarkdownYaxunit");
	
КонецФункции

Функция ДвиженияДокумента(Документ, ИмяРегистра)
	
	ТекстЗапроса = СтрШаблон("ВЫБРАТЬ * ИЗ %1 ГДЕ Регистратор = &Регистратор", ИмяРегистра);
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Регистратор", Документ);
	
	Результат = Запрос.Выполнить().Выгрузить();
	Результат.Колонки.Удалить("Регистратор");
	Результат.Колонки.Удалить("НомерСтроки");
	Результат.Колонки.Удалить("Активность");
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли
