//©///////////////////////////////////////////////////////////////////////////©//
//
//  Copyright 2021-2023 BIA-Technologies Limited Liability Company
//
//  Licensed under the Apache License, Version 2.0 (the "License");
//  you may not use this file except in compliance with the License.
//  You may obtain a copy of the License at
//
//      http://www.apache.org/licenses/LICENSE-2.0
//
//  Unless required by applicable law or agreed to in writing, software
//  distributed under the License is distributed on an "AS IS" BASIS,
//  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//  See the License for the specific language governing permissions and
//  limitations under the License.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область СлужебныйПрограммныйИнтерфейс

// Форматированный текст ошибки утверждения.
// 
// Параметры:
//  ОписаниеПроверки - см. ЮТФабрика.ОписаниеПроверки
//  ТекстОжидания - Строка - Описание ожидания
//  ОбъектПроверки - Строка - Объект проверки
// 
// Возвращаемое значение:
//  Строка - Форматированный текст ошибки утверждения
Функция ФорматированныйТекстОшибкиУтверждения(Знач ОписаниеПроверки, ТекстОжидания, ОбъектПроверки) Экспорт
	
	Если ЗначениеЗаполнено(ОписаниеПроверки.ОбъектПроверки.ИмяСвойства) Тогда
		ВставкаСвойство = СтрШаблон(" содержит свойство `%1`, которое", ОписаниеПроверки.ОбъектПроверки.ИмяСвойства);
	Иначе
		ВставкаСвойство = "";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОписаниеПроверки.ОбъектПроверки.Представление) Тогда
		ПредставлениеЗначения = ОписаниеПроверки.ОбъектПроверки.Представление;
	Иначе
		ПредставлениеЗначения = СтрШаблон("`%1`", ОписаниеПроверки.ОбъектПроверки.Значение);
	КонецЕсли;
	
	// Заголовок сообщения
	ТекстСообщения = "";
	// Тело сообщения
	ТекстСообщения = СтрШаблон("ожидали, что %1 %2%3 %4, но это не так.",
		ОбъектПроверки,
		ПредставлениеЗначения,
		ВставкаСвойство,
		ТекстОжидания);
	
	Возврат ТекстСообщения;
	
КонецФункции

// Сообщение об ошибке события.
// 
// Параметры:
//  ИмяСобытия - Строка
//  Ошибка - Строка - Текст ошибки
//         - ИнформацияОбОшибке - ошибка выполнения
// 
// Возвращаемое значение:
//  Строка -  Сообщение об ошибке события
Функция СообщениеОбОшибкеСобытия(ИмяСобытия, Ошибка) Экспорт
	
	ТипОшибки = ЮТФабрика.ТипыОшибок().ОшибкаОбработкиСобытия;
	Возврат СтрШаблон("%1 '%2': %3", ТипОшибки, ИмяСобытия, КраткоеСообщениеОшибки(Ошибка));
	
КонецФункции

Функция КраткоеСообщениеОшибки(Ошибка) Экспорт
	
	Если ЭтоИнформацияОбОшибке(Ошибка) Тогда
		Возврат КраткоеПредставлениеОшибки(Ошибка);
	Иначе
		Возврат Ошибка;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЭтоИнформацияОбОшибке(Ошибка) Экспорт
	
	Возврат ТипЗнч(Ошибка) = Тип("ИнформацияОбОшибке");
	
КонецФункции
#КонецОбласти
