//©///////////////////////////////////////////////////////////////////////////©//
//
//  Copyright 2021-2023 BIA-Technologies Limited Liability Company
//
//  Licensed under the Apache License, Version 2.0 (the "License");
//  you may not use this file except in compliance with the License.
//  You may obtain a copy of the License at
//
//      http://www.apache.org/licenses/LICENSE-2.0
//
//  Unless required by applicable law or agreed to in writing, software
//  distributed under the License is distributed on an "AS IS" BASIS,
//  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//  See the License for the specific language governing permissions and
//  limitations under the License.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область СлужебныйПрограммныйИнтерфейс

Процедура ИсполняемыеСценарии() Экспорт
	
	ЮТТесты.ВТранзакции()
		.ДобавитьТест("ЗначенияРеквизитов")
		.ДобавитьТест("ЗначениеРеквизита")
		.ДобавитьТест("ТаблицаСодержитЗаписи")
		.ДобавитьТест("РезультатЗапроса")
		.ДобавитьТест("РезультатПустой")
	;
	
КонецПроцедуры

Процедура ЗначенияРеквизитов() Экспорт
	
	Конструктор = ЮТест.Данные().КонструкторОбъекта("Справочники.Товары")
		.Фикция("Наименование")
		.Фикция("Код")
		.Фикция("Поставщик");
	Данные = Конструктор.ДанныеОбъекта();
	Ссылка = Конструктор.Записать();
	
	ДанныеСсылки = ЮТЗапросы.ЗначенияРеквизитов(Ссылка, "Наименование");
	ЮТест.ОжидаетЧто(ДанныеСсылки)
		.ИмеетТип("Структура")
		.Заполнено()
		.Свойство("Наименование").Равно(Данные.Наименование);
	
	ДанныеСсылки = ЮТЗапросы.ЗначенияРеквизитов(Ссылка, "Код, Поставщик");
	ЮТест.ОжидаетЧто(ДанныеСсылки)
		.ИмеетТип("Структура")
		.Заполнено()
		.Свойство("Код").Равно(Данные.Код)
		.Свойство("Поставщик").Равно(Данные.Поставщик);
	
	ДанныеСсылки = ЮТЗапросы.ЗначенияРеквизитов(ПредопределенноеЗначение("Справочник.Товары.ПустаяСсылка"), "Код, Поставщик");
	ЮТест.ОжидаетЧто(ДанныеСсылки)
		.ИмеетТип("Структура")
		.Заполнено()
		.Свойство("Код").Равно(Неопределено)
		.Свойство("Поставщик").Равно(Неопределено);
	
КонецПроцедуры

Процедура ЗначениеРеквизита() Экспорт
	
	Конструктор = ЮТест.Данные().КонструкторОбъекта("Справочники.Товары")
		.Фикция("Наименование")
		.Фикция("Код")
		.Фикция("Поставщик");
	Данные = Конструктор.ДанныеОбъекта();
	Ссылка = Конструктор.Записать();
	
	ЮТест.ОжидаетЧто(ЮТЗапросы.ЗначениеРеквизита(Ссылка, "Наименование"))
		.ИмеетТип("Строка")
		.Заполнено()
		.Равно(Данные.Наименование);
	
	ЮТест.ОжидаетЧто(ЮТЗапросы.ЗначениеРеквизита(Ссылка, "Поставщик"))
		.Равно(Данные.Поставщик);
	
	ЮТест.ОжидаетЧто(ЮТЗапросы.ЗначениеРеквизита(Ссылка, "Код, Поставщик"))
		.Равно(Данные.Код);
	
	ЮТест.ОжидаетЧто(ЮТЗапросы.ЗначениеРеквизита(ПредопределенноеЗначение("Справочник.Товары.ПустаяСсылка"), "Наименование"))
		.Равно(Неопределено);
	
КонецПроцедуры

#КонецОбласти
