//©///////////////////////////////////////////////////////////////////////////©//
//
//  Copyright 2021-2025 BIA-Technologies Limited Liability Company
//
//  Licensed under the Apache License, Version 2.0 (the "License");
//  you may not use this file except in compliance with the License.
//  You may obtain a copy of the License at
//
//      http://www.apache.org/licenses/LICENSE-2.0
//
//  Unless required by applicable law or agreed to in writing, software
//  distributed under the License is distributed on an "AS IS" BASIS,
//  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//  See the License for the specific language governing permissions and
//  limitations under the License.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область ОписаниеПеременных

Перем Контекст;

#КонецОбласти

#Область ПрограммныйИнтерфейс

Функция НоваяСтрока(Текст, НачалоСтроки = "", КонецСтроки = "") Экспорт
	
	ПодготовленныйТекст = НачалоСтроки + Текст + КонецСтроки;
	
	Контекст.Строки.Добавить(ПодготовленныйТекст);
	
	Возврат ЭтотОбъект;
	
КонецФункции

Функция НоваяСтрокаПоШаблону(Шаблон, П1 = "", П2 = "", П3 = "", П4 = "", П5 = "", П6 = "", П7 = "", П8 = "", П9 = "") Экспорт
	
	ПараметрыСтрокой = СтрШаблон("%1·%2·%3·%4·%5·%6·%7·%8·%9", П1, П2, П3, П4, П5, П6,  П7, П8, П9);
	ПараметрыЗаполненные  = СтрРазделить(ПараметрыСтрокой, "·", Ложь);
	
	Для Итератор = 1 По ПараметрыЗаполненные.Количество() Цикл
		ПараметрыЗаполненные[Итератор - 1] = """" + СтрЗаменить(ПараметрыЗаполненные[Итератор - 1], """", """""") + """"; // экранируем кавычки
	КонецЦикла;
	
	ПараметрыБезПустых =  СтрСоединить(ПараметрыЗаполненные, ", ");
	КодДляВыполнения = СтрШаблон("ПодготовленныйТекст = СтрШаблон(Шаблон, %1);", ПараметрыБезПустых);
	
	ПодготовленныйТекст = "";
	
	Выполнить(КодДляВыполнения);
	
	НоваяСтрока(ПодготовленныйТекст);
	
	Возврат ЭтотОбъект;
			
КонецФункции

Функция ДобавитьТекст(Текст, РазделительСтрок, РазмерСдвига = 1) Экспорт
	
	ДобавляемыеСтроки = СтрРазделить(Текст, РазделительСтрок);
	
	Для Каждого Стр Из ДобавляемыеСтроки Цикл
		НоваяСтрока(Стр).Табуляция(РазмерСдвига);
	КонецЦикла;
	
	Возврат ЭтотОбъект;
	
КонецФункции
	
Функция ВставитьСтроку(Позиция, Текст, НачалоСтроки = "", КонецСтроки = "") Экспорт
	
	ПодготовленныйТекст = НачалоСтроки + Текст + КонецСтроки;
	
	Контекст.Строки.Вставить(Позиция, ПодготовленныйТекст);
	
	Возврат ЭтотОбъект;
	
КонецФункции

Функция ВставитьПервуюСтроку(Текст, НачалоСтроки = "", КонецСтроки = "") Экспорт

	Возврат ВставитьСтроку(0, Текст, НачалоСтроки, КонецСтроки);
	
КонецФункции
	
Функция ПереносСтроки() Экспорт

	Возврат ДобавитьВКонецСтроки(Символы.ПС);
	
КонецФункции

Функция Табуляция(Количество = 1) Экспорт
	
	Табы = Сдвиг(Количество);
	
	ПоследнийЭлемент = Контекст.Строки.Количество() - 1;
	Контекст.Строки[ПоследнийЭлемент] = Табы + Контекст.Строки[ПоследнийЭлемент];
	
	Возврат ЭтотОбъект;
	
КонецФункции

Функция ДобавитьВКонецСтроки(Суффикс) Экспорт
	
	ПоследнийЭлемент = Контекст.Строки.Количество() - 1;
	Контекст.Строки[ПоследнийЭлемент] = Контекст.Строки[ПоследнийЭлемент] + Суффикс;
	
	Возврат ЭтотОбъект;
КонецФункции

Функция Разделитель(Разделитель) Экспорт
	
	Контекст.Разделитель = Разделитель;
	
	Возврат ЭтотОбъект;
	
КонецФункции

Функция Текст() Экспорт
	
	Возврат СтрСоединить(Контекст.Строки, Контекст.Разделитель);
	
КонецФункции

Функция КоличествоСтрок() Экспорт
	
	Возврат Контекст.Строки.Количество();
	
КонецФункции

Функция УстановитьТекст(Текст) Экспорт
	
	СтрокиТекста = СтрРазделить(Текст, Контекст.Разделитель);
	
	Для Каждого Стр Из СтрокиТекста Цикл
		НоваяСтрока(Стр);
	КонецЦикла;
	
	Возврат ЭтотОбъект;
		
КонецФункции

#КонецОбласти

#Область СлужебныеПрограммныйИнтерфейс

Процедура Инициализировать() Экспорт
	
	Контекст = Новый Структура;
	Контекст.Вставить("Строки", Новый Массив);
	Контекст.Вставить("Разделитель", Символы.ПС);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция Сдвиг(ШагСдвига = 0)
	
	Табы = Новый Массив;
	
	Для Итератор = 1 По ШагСдвига Цикл
		Табы.Добавить("	");
	КонецЦикла;
	
	Сдвиг = СтрСоединить(Табы);
			
	Возврат Сдвиг;
	
КонецФункции

#КонецОбласти
