//©///////////////////////////////////////////////////////////////////////////©//
//
//  Copyright 2021-2024 BIA-Technologies Limited Liability Company
//
//  Licensed under the Apache License, Version 2.0 (the "License");
//  you may not use this file except in compliance with the License.
//  You may obtain a copy of the License at
//
//      http://www.apache.org/licenses/LICENSE-2.0
//
//  Unless required by applicable law or agreed to in writing, software
//  distributed under the License is distributed on an "AS IS" BASIS,
//  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//  See the License for the specific language governing permissions and
//  limitations under the License.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область СлужебныйПрограммныйИнтерфейс

Функция ТаблицыРавны(Знач Данные1, Знач Данные2) Экспорт
	
	Если Данные1.Количество() <> Данные2.Количество() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Данные1.Колонки.Количество() <> Данные2.Колонки.Количество() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Для Каждого Колонка Из Данные1.Колонки Цикл
		Если Данные2.Колонки.Найти(Колонка.Имя) = Неопределено Тогда
			Возврат Ложь;
		КонецЕсли;
		
		Индекс = Данные1.Количество() - 1;
		Пока Индекс >= 0 Цикл
			Если НЕ ЮТСравнениеСлужебныйКлиентСервер.ЗначенияРавны(Данные1[Индекс][Колонка.Имя], Данные2[Индекс][Колонка.Имя]) Тогда
				Возврат Ложь;
			КонецЕсли;
			Индекс = Индекс - 1;
		КонецЦикла;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Функция ТабличныеДокументыРавны(Знач ТабличныйДокумент1, Знач ТабличныйДокумент2) Экспорт
	
	Данные1 = ПолучитьТаблицуЗначенийИзТабличногоДокумента(ТабличныйДокумент1);
	Данные2 = ПолучитьТаблицуЗначенийИзТабличногоДокумента(ТабличныйДокумент2);
	
	Возврат ТаблицыРавны(Данные1, Данные2);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьТаблицуЗначенийИзТабличногоДокумента(ТабличныйДокумент, УчитыватьТолькоВидимыеКолонки = Ложь, УчитыватьТолькоВидимыеСтроки = Ложь)
	// https://github.com/vanessa-opensource/add 
	// перенесен из Functest
	
	ЮТПроверкиСлужебный.ПроверитьТипПараметра(ТабличныйДокумент,
											  Тип("ТабличныйДокумент"),
											  "ЮТСравнениеСлужебныйСервер.ПолучитьТаблицуЗначенийИзТабличногоДокумента",
											  "ТабличныйДокумент");
	
	Если УчитыватьТолькоВидимыеКолонки И УчитыватьТолькоВидимыеСтроки Тогда
		ЮТТестовыеДанныеСлужебныйСервер.ТаблицаИзТабличногоДокумента(ТабличныйДокумент);
	КонецЕсли;
	
	НоваяТаблицаЗначений = Новый ТаблицаЗначений;
	
	УчитываемыеКолонки = УчитываемыеКолонки(ТабличныйДокумент, НоваяТаблицаЗначений, УчитыватьТолькоВидимыеКолонки);
	
	ГраницаКолонок = УчитываемыеКолонки.ВГраница();
	НомерПоследнейСтроки = ТабличныйДокумент.ВысотаТаблицы;
	
	Для НомерСтроки = 1 По НомерПоследнейСтроки Цикл
		
		УчитыватьСтроку = УчитыватьТолькоВидимыеСтроки И Не ТабличныйДокумент.Область(НомерСтроки, , НомерСтроки).Видимость;
		Если УчитыватьСтроку Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = НоваяТаблицаЗначений.Добавить();
		
		Для Индекс = 0 По ГраницаКолонок Цикл
			Область = ТабличныйДокумент.Область(НомерСтроки, УчитываемыеКолонки[Индекс]);
			НоваяСтрока[Индекс] = Область.Текст;
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат НоваяТаблицаЗначений;
	
КонецФункции

Функция УчитываемыеКолонки(ТабличныйДокумент, ТаблицаЗначений, УчитыватьТолькоВидимыеКолонки)
	
	ТипСтрока = Новый ОписаниеТипов("Строка");
	НомерПоследнейКолонки = ТабличныйДокумент.ШиринаТаблицы;
	Колонки = ТаблицаЗначений.Колонки;
	
	// При определении видимости не учитывается наличие нескольких форматов строк, сейчас видимость колонки определяется по формату первой строки
	УчитываемыеКолонки = Новый Массив;
	Для НомерКолонки = 1 По НомерПоследнейКолонки Цикл
		
		ОбластьКолонки = ТабличныйДокумент.Область(1, НомерКолонки);
		УчитыватьКолонку = Не УчитыватьТолькоВидимыеКолонки Или ОбластьКолонки.Видимость;
		
		Если УчитыватьКолонку Тогда
			УчитываемыеКолонки.Добавить(НомерКолонки);
			ИмяКолонки = "К" + Формат(Колонки.Количество() + 1, "ЧН=; ЧГ=0");
			Колонки.Добавить(ИмяКолонки, ТипСтрока);
		КонецЕсли;
	КонецЦикла;
	
	Возврат УчитываемыеКолонки;
	
КонецФункции

#КонецОбласти
