//©///////////////////////////////////////////////////////////////////////////©//
//
//  Copyright 2021-2024 BIA-Technologies Limited Liability Company
//
//  Licensed under the Apache License, Version 2.0 (the "License");
//  you may not use this file except in compliance with the License.
//  You may obtain a copy of the License at
//
//      http://www.apache.org/licenses/LICENSE-2.0
//
//  Unless required by applicable law or agreed to in writing, software
//  distributed under the License is distributed on an "AS IS" BASIS,
//  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//  See the License for the specific language governing permissions and
//  limitations under the License.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область СлужебныйПрограммныйИнтерфейс

Процедура ИсполняемыеСценарии() Экспорт
	
	ЮТТесты
		.ДобавитьТест("ПодсистемыПодключаемыхМодулей")
		.ДобавитьТест("ОбработчикиСобытий")
		.ДобавитьТест("ПодключаемыеМодулиПодсистемы")
	;
	
КонецПроцедуры

Процедура ПодсистемыПодключаемыхМодулей() Экспорт
	
	ЮТест.ОжидаетЧто(ЮТМетаданныеСлужебныйПовтИсп.ПодсистемыПодключаемыхМодулей())
		.Заполнено()
		.Содержит("ЮТПодключаемыеМодули")
		.Содержит("Тесты_ЮТПодключаемыеМодули")
	;
	
КонецПроцедуры

Процедура ОбработчикиСобытий() Экспорт
	
	ЮТест.ОжидаетЧто(ЮТПодключаемыеМодулиСлужебныйВызовСервера.ОбработчикиСобытий("Инициализация"))
		.Заполнено()
		.Содержит("НастройкаYAxUnit")
		.Содержит("ЮТЗависимостиСлужебный")
		.Содержит("ЮТЛогированиеСлужебный")
		.ИмеетДлинуБольше(2)
	;
	
КонецПроцедуры

Процедура ПодключаемыеМодулиПодсистемы() Экспорт
	
	ЮТест.ОжидаетЧто(ЮТПодключаемыеМодулиСлужебныйВызовСервера.ПодключаемыеМодулиПодсистемы("ОбработчикиСобытий"))
		.Заполнено()
		.Содержит("ЮТЛогированиеСлужебный")
	;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
