//©///////////////////////////////////////////////////////////////////////////©//
//
//  Copyright 2021-2023 BIA-Technologies Limited Liability Company
//
//  Licensed under the Apache License, Version 2.0 (the "License");
//  you may not use this file except in compliance with the License.
//  You may obtain a copy of the License at
//
//      http://www.apache.org/licenses/LICENSE-2.0
//
//  Unless required by applicable law or agreed to in writing, software
//  distributed under the License is distributed on an "AS IS" BASIS,
//  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//  See the License for the specific language governing permissions and
//  limitations under the License.
//
//©///////////////////////////////////////////////////////////////////////////©//

// @strict-types

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиСобытий

// Обработчик события "ПередТестовымНабором"
// 
// Параметры:
//  ОписаниеСобытия - См. ЮТФабрика.ОписаниеСобытияИсполненияТестов
// 
Процедура ПередТестовымНабором(ОписаниеСобытия) Экспорт
	
	ВызватьОбработчик(ОписаниеСобытия, "ПередТестовымНабором");
	
КонецПроцедуры

// Обработчик события "ПослеТестовогоНабора"
// 
// Параметры:
//  ОписаниеСобытия - См. ЮТФабрика.ОписаниеСобытияИсполненияТестов
// 
Процедура ПослеТестовогоНабора(ОписаниеСобытия) Экспорт
	
	ВызватьОбработчик(ОписаниеСобытия, "ПослеТестовогоНабора");
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Вызывает настроенный обработчик события
// 
// Параметры:
//  ОписаниеСобытия - См. ЮТФабрика.ОписаниеСобытияИсполненияТестов
//  ИмяНастройки - Строка
// 
Процедура ВызватьОбработчик(ОписаниеСобытия, ИмяНастройки)
	
	ИмяМодуля = ОписаниеСобытия.Модуль.МетаданныеМодуля.Имя;
	ИмяМетода = ЮТНастройкиВыполнения.ЗначениеНастройкиТеста(ИмяНастройки, "");
	Если ЗначениеЗаполнено(ИмяМетода) Тогда
		ЮТОбщий.ВыполнитьМетод(СтрШаблон("%1.%2", ИмяМодуля, ИмяМетода));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
