//©///////////////////////////////////////////////////////////////////////////©//
//
//  Copyright 2021-2024 BIA-Technologies Limited Liability Company
//
//  Licensed under the Apache License, Version 2.0 (the "License");
//  you may not use this file except in compliance with the License.
//  You may obtain a copy of the License at
//
//      http://www.apache.org/licenses/LICENSE-2.0
//
//  Unless required by applicable law or agreed to in writing, software
//  distributed under the License is distributed on an "AS IS" BASIS,
//  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//  See the License for the specific language governing permissions and
//  limitations under the License.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область СлужебныйПрограммныйИнтерфейс

Функция НовыйИсполняемый(ОписаниеБазовогоОбъекта)
	
	Данные = Новый Структура;
	Данные.Вставить("Идентификатор", Новый УникальныйИдентификатор());
	Данные.Вставить("ИдентификаторБазовогоОписания", ОписаниеБазовогоОбъекта.Идентификатор);
	Данные.Вставить("Статус", Новый Структура);
	Данные.Вставить("Родитель", Неопределено);
	
КонецФункции

Функция ОписаниеБазовогоОбъекта(Идентификатор, АдресХранилища) Экспорт
	
	ДанныеХранилища = ПолучитьИзВременногоХранилища(АдресХранилища);
	Возврат ДанныеХранилища[Идентификатор];
	
КонецФункции

Функция РезультатТесирования(ДанныеИсполняемого) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Идентификатор", ДанныеИсполняемого.Идентификатор);
	Результат.Вставить("Представление");
	Результат.Вставить("Статус");
	Результат.Вставить("Контекст");
	Результат.Вставить("Метки");
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
