//©///////////////////////////////////////////////////////////////////////////©//
//
//  Copyright 2021-2024 BIA-Technologies Limited Liability Company
//
//  Licensed under the Apache License, Version 2.0 (the "License");
//  you may not use this file except in compliance with the License.
//  You may obtain a copy of the License at
//
//      http://www.apache.org/licenses/LICENSE-2.0
//
//  Unless required by applicable law or agreed to in writing, software
//  distributed under the License is distributed on an "AS IS" BASIS,
//  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//  See the License for the specific language governing permissions and
//  limitations under the License.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область СлужебныйПрограммныйИнтерфейс

Функция СерверноеХранилищеТестов() Экспорт
	
	АдресХранилища = ЮТКонтекстСлужебный.ЗначениеКонтекста(ИмяКонтекстаХранилище());
	Возврат ПолучитьИзВременногоХранилища(АдресХранилища);
	
КонецФункции

Процедура СохранитьИнформациюОТестовыхСценариях(ТестовыеМодули) Экспорт
	
	Хранилище = Новый Соответствие();
	
	Для Каждого Модуль Из ТестовыеМодули Цикл
		
		Идентификатор = ЮТИсполнительСлужебныйКлиентСервер.ИдентификаторТестовогоМодуля(Модуль);
		Хранилище.Вставить(Идентификатор, Модуль);
		
		Для Каждого Набор Из Модуль.НаборыТестов Цикл
			
			Идентификатор = ЮТИсполнительСлужебныйКлиентСервер.ИдентификаторТестовогоНабора(Модуль, Набор);
			Хранилище.Вставить(Идентификатор, Набор);
			
			Для Каждого Тест Из Набор.Тесты Цикл
				
				Идентификатор = ЮТИсполнительСлужебныйКлиентСервер.ИдентификаторТеста(Модуль, Набор, Тест);
				Хранилище.Вставить(Идентификатор, Тест);
				
			КонецЦикла;
			
		КонецЦикла;
		
		Модуль.НаборыТестов = Новый Массив; // Уже не нужно, поэтому очистим
		
	КонецЦикла;
	
	АдресХранилища = ПоместитьВоВременноеХранилище(Хранилище, Новый УникальныйИдентификатор());
	ЮТКонтекстСлужебный.УстановитьЗначениеКонтекста(ИмяКонтекстаХранилище(), АдресХранилища);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ИмяКонтекстаХранилище()
	
	Возврат "ХранилищеТестовыхСценариев";
	
КонецФункции

#КонецОбласти
