Функция СохранитьИзменения(ОбрабатываемыеЭлементы) Экспорт
	
	НачатьТранзакцию();
	
	Попытка
	
		Для Каждого ОбрабатываемыйЭлемент Из ОбрабатываемыеЭлементы Цикл
			
			ВстречаОбъект = ОбрабатываемыйЭлемент.Встреча.ПолучитьОбъект();
			
			Если ОбрабатываемыйЭлемент.Свойство("ПометкаУдаления") Тогда
				ВстречаОбъект.УстановитьПометкуУдаления(ОбрабатываемыйЭлемент.ПометкаУдаления);
				Продолжить;
			КонецЕсли;
			
			ВстречаОбъект.Начало		= ОбрабатываемыйЭлемент.Начало;
			ВстречаОбъект.Окончание	= ОбрабатываемыйЭлемент.Конец;
			
			Пользователь = ОбрабатываемыйЭлемент.Владелец;
			Если Пользователь = Неопределено Тогда
				Пользователь = ПользователиИнформационнойБазы.ТекущийПользователь();
			КонецЕсли;
			
			Владелец = Справочники.Пользователи.НайтиПоКоду(Пользователь);
			ВстречаОбъект.Владелец = Владелец;
			
			ВстречаОбъект.Записать();
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		Успешно = Истина;
		
	Исключение
		
		ОтменитьТранзакцию();
		Успешно = Ложь;
		
	КонецПопытки;
	
	Возврат Успешно;
	
КонецФункции
