Функция СохранитьИзменения(ОбрабатываемыеЭлементы) Экспорт
	
	НачатьТранзакцию();
	
	Попытка
	
		Для Каждого ОбрабатываемыйЭлемент Из ОбрабатываемыеЭлементы Цикл
			
			ВстречаОбъект = ОбрабатываемыйЭлемент.Встреча.ПолучитьОбъект();
			
			Если ОбрабатываемыйЭлемент.Свойство("ПометкаУдаления") Тогда
				ВстречаОбъект.УстановитьПометкуУдаления(ОбрабатываемыйЭлемент.ПометкаУдаления);
				Продолжить;
			КонецЕсли;
			
			ЗаполнитьОбъект(ВстречаОбъект, ОбрабатываемыйЭлемент);
			ВстречаОбъект.Записать();
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		Успешно = Истина;
		
	Исключение
		
		ОтменитьТранзакцию();
		ВызватьИсключение;
		
	КонецПопытки;
	
	Возврат Успешно;
	
КонецФункции

Процедура ЗаполнитьОбъект(Объект, ОбрабатываемыйЭлемент)
	
	Объект.Начало		= ОбрабатываемыйЭлемент.Начало;
	Объект.Окончание	= ОбрабатываемыйЭлемент.Конец;
	
	Пользователь = ОбрабатываемыйЭлемент.Владелец;
	Если Пользователь = Неопределено Тогда
		Пользователь = ПользователиИнформационнойБазы.ТекущийПользователь();
	КонецЕсли;
	
	Владелец = Справочники.Пользователи.НайтиПоКоду(Пользователь.Имя);
	
	Объект.Владелец = Владелец;
	
КонецПроцедуры
