
&Вместо("ПередЗаписью")
Процедура Расш1_ПередЗаписью(Отказ, Замещение)
	
	ПараметрыМетода = Мокито.МассивПараметров(Отказ, Замещение);
	
	ПрерватьВыполнение = Ложь;
	Мокито.АнализВызова(ЭтотОбъект, "ПередЗаписью", ПараметрыМетода, ПрерватьВыполнение);
	
	Если НЕ ПрерватьВыполнение Тогда
		ПродолжитьВызов(Отказ, Замещение);
	КонецЕсли;
	
КонецПроцедуры

&Вместо("ОбработкаПроверкиЗаполнения")
Процедура Расш1_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ПараметрыМетода = Мокито.МассивПараметров(Отказ, ПроверяемыеРеквизиты);
	
	ПрерватьВыполнение = Ложь;
	Мокито.АнализВызова(ЭтотОбъект, "ОбработкаПроверкиЗаполнения", ПараметрыМетода, ПрерватьВыполнение);
	
	Если НЕ ПрерватьВыполнение Тогда
		ПродолжитьВызов(Отказ, ПроверяемыеРеквизиты);
	КонецЕсли;
	
КонецПроцедуры

