//©///////////////////////////////////////////////////////////////////////////©//
//
//  Copyright 2021-2025 BIA-Technologies Limited Liability Company
//
//  Licensed under the Apache License, Version 2.0 (the "License");
//  you may not use this file except in compliance with the License.
//  You may obtain a copy of the License at
//
//      http://www.apache.org/licenses/LICENSE-2.0
//
//  Unless required by applicable law or agreed to in writing, software
//  distributed under the License is distributed on an "AS IS" BASIS,
//  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//  See the License for the specific language governing permissions and
//  limitations under the License.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область СлужебныйПрограммныйИнтерфейс

// ЗагрузитьТесты
// 	Читает наборы тестов (тестовые модули) из расширений
// Параметры:
//  ПараметрыЗапускаТестов - см. ЮТФабрика.ПараметрыЗапуска
//
// Возвращаемое значение:
//  Массив из см. ЮТФабрикаСлужебный.ОписаниеТестовогоМодуля - Набор описаний тестовых модулей, которые содержат информацию о запускаемых тестах
Функция ЗагрузитьТесты(ПараметрыЗапускаТестов) Экспорт
	
	Результат = Новый Массив;
	
	ЮТФильтрацияСлужебный.УстановитьКонтекст(ПараметрыЗапускаТестов);
	
	ТестовыеМодули = ТестовыеМодули();
	
	Для Каждого МетаданныеМодуля Из ТестовыеМодули Цикл
		
		ОписаниеТестовогоМодуля = ТестовыеНаборыМодуля(МетаданныеМодуля, ПараметрыЗапускаТестов);
		
		Если ОписаниеТестовогоМодуля = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Результат.Добавить(ОписаниеТестовогоМодуля);
		
	КонецЦикла;
	
	ЮТЗависимостиСлужебныйКлиент.ДедупликацияЗависимостей(Результат);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// ТестовыеМодули
//  Возвращает описания модулей, содержащих тесты
// Возвращаемое значение:
//  Массив из см. ЮТМетаданныеСлужебныйВызовСервера.МетаданныеМодуля - Тестовые модули
Функция ТестовыеМодули()
	
	МодулиРасширения = ЮТМетаданныеСлужебныйВызовСервера.МодулиРасширений();
	МодулиДвижка = ЮТМетаданныеСлужебныйВызовСервера.ИменаМодулейДвижка();
	
	ОтфильтрованныеМодули = ЮТИсполнительСлужебныйКлиент.ЗначениеСостоянияТекущегоЭтапаИсполнения("ОтфильтрованныеМодули");
	
	Если ОтфильтрованныеМодули = Неопределено Тогда
		
		ОтфильтрованныеМодули = Новый Массив;
		
		Для Каждого ОписаниеМодуля Из МодулиРасширения Цикл
			
			Если МодулиДвижка.Найти(ОписаниеМодуля.Имя) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			ЮТЛогирование.Отладка("Анализ модуля: " + ОписаниеМодуля.Имя);
			
			Если НЕ ЮТФильтрацияСлужебный.ЭтоПодходящийМодуль(ОписаниеМодуля) Тогда
				ЮТЛогирование.Отладка("	Пропущен, не подходит под отбор");
			Иначе
				ОтфильтрованныеМодули.Добавить(ОписаниеМодуля);
			КонецЕсли;
			
		КонецЦикла;
		
		ЮТИсполнительСлужебныйКлиент.СохранитьСостояниеТекущегоЭтапаИсполнения(Новый Структура("ОтфильтрованныеМодули", ОтфильтрованныеМодули));
		
	КонецЕсли;
	
	ТестовыеМодули = ЮТИсполнительСлужебныйКлиент.ЗначениеСостоянияТекущегоЭтапаИсполнения("ТестовыеМодули");
	ОшибочныйМодуль = ЮТИсполнительСлужебныйКлиент.ЗначениеСостоянияТекущегоЭтапаИсполнения("ТекущийМодуль");
	ПропуститьМодуль = ОшибочныйМодуль <> Неопределено;
	
	Если ТестовыеМодули = Неопределено Тогда
		ТестовыеМодули = Новый Массив;
		ЮТИсполнительСлужебныйКлиент.СохранитьСостояниеТекущегоЭтапаИсполнения(Новый Структура("ТестовыеМодули", ТестовыеМодули));
	КонецЕсли;
	
	Для Каждого ОписаниеМодуля Из ОтфильтрованныеМодули Цикл
		
		Если ПропуститьМодуль Тогда
			Если ОписаниеМодуля = ОшибочныйМодуль Тогда
				ПропуститьМодуль = Ложь;
			КонецЕсли;
			
			Продолжить;
		КонецЕсли;
		
		ЮТИсполнительСлужебныйКлиент.СохранитьСостояниеТекущегоЭтапаИсполнения(Новый Структура("ТекущийМодуль", ОписаниеМодуля));
		
		Если НЕ ЮТЧитательСлужебный.ЭтоТестовыйМодуль(ОписаниеМодуля) Тогда
			ЮТЛогирование.Отладка("	Пропущен, это не тестовый модуль");
		Иначе
			ЮТЛогирование.Отладка("	Добавлен");
			ТестовыеМодули.Добавить(ОписаниеМодуля);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТестовыеМодули;
	
КонецФункции

Функция ТестовыеНаборыМодуля(МетаданныеМодуля, ПараметрыЗапуска)
	
	// TODO Фильтрация по путям
	ОписаниеМодуля = Неопределено;
	
#Если ТолстыйКлиентОбычноеПриложение Тогда
	Если МетаданныеМодуля.КлиентОбычноеПриложение Тогда
		ОписаниеМодуля = ЮТЧитательСлужебный.ИсполняемыеСценарииМодуля(МетаданныеМодуля);
	ИначеЕсли МетаданныеМодуля.Сервер Тогда
		ОписаниеМодуля = ЮТЧитательСлужебныйВызовСервера.ИсполняемыеСценарииМодуля(МетаданныеМодуля);
		ЮТЛогированиеСлужебный.ВывестиСерверныеСообщения();
	КонецЕсли;
#ИначеЕсли ТолстыйКлиентУправляемоеПриложение Или ТонкийКлиент Тогда
	Если МетаданныеМодуля.КлиентУправляемоеПриложение Тогда
		ОписаниеМодуля = ЮТЧитательСлужебный.ИсполняемыеСценарииМодуля(МетаданныеМодуля);
	ИначеЕсли МетаданныеМодуля.Сервер Тогда
		ОписаниеМодуля = ЮТЧитательСлужебныйВызовСервера.ИсполняемыеСценарииМодуля(МетаданныеМодуля);
		ЮТЛогированиеСлужебный.ВывестиСерверныеСообщения();
	КонецЕсли;
#ИначеЕсли Сервер Тогда
	Если МетаданныеМодуля.Сервер Тогда
		ОписаниеМодуля = ЮТЧитательСлужебный.ИсполняемыеСценарииМодуля(МетаданныеМодуля);
	Иначе
		ВызватьИсключение "Чтение списка тестов модуля в недоступном контексте";
	КонецЕсли;
#КонецЕсли
	
	Возврат ОписаниеМодуля;
	
КонецФункции

#КонецОбласти
