//©///////////////////////////////////////////////////////////////////////////©//
//
//  Copyright 2021-2025 BIA-Technologies Limited Liability Company
//
//  Licensed under the Apache License, Version 2.0 (the "License");
//  you may not use this file except in compliance with the License.
//  You may obtain a copy of the License at
//
//      http://www.apache.org/licenses/LICENSE-2.0
//
//  Unless required by applicable law or agreed to in writing, software
//  distributed under the License is distributed on an "AS IS" BASIS,
//  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//  See the License for the specific language governing permissions and
//  limitations under the License.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область СлужебныйПрограммныйИнтерфейс

Процедура ИсполняемыеСценарии() Экспорт
	
	ЮТТесты
		.ДобавитьТестовыйНабор("Коммерция")
			.ДобавитьТест("Товар")
			.ДобавитьТест("Категория")
		.ДобавитьТестовыйНабор("Локализации")
			.ДобавитьТест("ТоварСЛокализацией")
			.ДобавитьТест("КатегорияСЛокализацией")
			.После("СброситьЛокализацию")
	;
	
КонецПроцедуры

Процедура Товар() Экспорт
	
	Товар = ЮТПодражатель_Коммерция.Товар();
	ЮТест.ОжидаетЧто(Товар)
		.ИмеетТип("Строка")
		.Заполнено()
	;
	
	ЮТест.ОжидаетЧто(СтрДлина(Товар))
		.Больше(1)
	;
	
КонецПроцедуры

Процедура Категория() Экспорт
	
	Категория = ЮТПодражатель_Коммерция.Категория();
	ЮТест.ОжидаетЧто(Категория)
		.ИмеетТип("Строка")
		.Заполнено()
	;
	
	ЮТест.ОжидаетЧто(СтрДлина(Категория))
		.Больше(1)
	;
	
КонецПроцедуры

Процедура ТоварСЛокализацией() Экспорт
	
	Подражатель = ЮТест.Данные().Подражатель();
	Подражатель.УстановитьЛокализацию("en");
	
	Товар = ЮТПодражатель_Коммерция.Товар();
	ЮТест.ОжидаетЧто(Товар)
		.ИмеетТип("Строка")
		.Заполнено()
	;
	
КонецПроцедуры

Процедура КатегорияСЛокализацией() Экспорт
	
	Подражатель = ЮТест.Данные().Подражатель();
	Подражатель.УстановитьЛокализацию("en");
	
	Категория = ЮТПодражатель_Коммерция.Категория();
	ЮТест.ОжидаетЧто(Категория)
		.ИмеетТип("Строка")
		.Заполнено()
	;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СброситьЛокализацию() Экспорт
	
	ЮТест.Данные().Подражатель().УстановитьЛокализацию("");
	
КонецПроцедуры

#КонецОбласти
