//©///////////////////////////////////////////////////////////////////////////©//
//
//  Copyright 2021-2023 BIA-Technologies Limited Liability Company
//
//  Licensed under the Apache License, Version 2.0 (the "License");
//  you may not use this file except in compliance with the License.
//  You may obtain a copy of the License at
//
//      http://www.apache.org/licenses/LICENSE-2.0
//
//  Unless required by applicable law or agreed to in writing, software
//  distributed under the License is distributed on an "AS IS" BASIS,
//  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//  See the License for the specific language governing permissions and
//  limitations under the License.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область ПрограммныйИнтерфейс

// Инициализирует новый конструктор вариантов
// 
// Параметры:
//  Реквизиты - Строка - Имена реквизитов варианта разделенные запятыми.
// 
// Возвращаемое значение:
//  ОбщийМодуль - Этот же модуль, для замыкания
Функция Варианты(Реквизиты) Экспорт
	
	Варианты = Новый Структура("Реквизиты, Варианты, КоличествоРеквизитов", Реквизиты, Новый Массив());
	Вариант = Новый Структура(Реквизиты);
	Варианты.КоличествоРеквизитов = Вариант.Количество();
	
	ЮТКонтекст.УстановитьЗначениеКонтекста(КлючКонтекста(), Варианты);
	
	Возврат ЮТКонструкторВариантов;
	
КонецФункции

// Добавляет новый вариант
// 
// Параметры:
//  Параметр1 - Произвольный
//  Параметр2 - Произвольный
//  Параметр3 - Произвольный
//  Параметр4 - Произвольный
//  Параметр5 - Произвольный
//  Параметр6 - Произвольный
//  Параметр7 - Произвольный
// 
// Возвращаемое значение:
//  ОбщийМодуль - Этот же модуль, для замыкания
Функция Добавить(Параметр1,
				 Параметр2 = Неопределено,
				 Параметр3 = Неопределено,
				 Параметр4 = Неопределено,
				 Параметр5 = Неопределено,
				 Параметр6 = Неопределено,
				 Параметр7 = Неопределено) Экспорт
// BSLLS:MagicNumber-off	
// BSLLS:NumberOfValuesInStructureConstructor-off
	Варианты = ЮТКонтекст.ЗначениеКонтекста(КлючКонтекста());
	
	Если Варианты.КоличествоРеквизитов = 1 Тогда
		Вариант = Новый Структура(Варианты.Реквизиты, Параметр1);
	ИначеЕсли Варианты.КоличествоРеквизитов = 2 Тогда
		Вариант = Новый Структура(Варианты.Реквизиты, Параметр1, Параметр2);
	ИначеЕсли Варианты.КоличествоРеквизитов = 3 Тогда
		Вариант = Новый Структура(Варианты.Реквизиты, Параметр1, Параметр2, Параметр3);
	ИначеЕсли Варианты.КоличествоРеквизитов = 4 Тогда
		Вариант = Новый Структура(Варианты.Реквизиты, Параметр1, Параметр2, Параметр3, Параметр4);
	ИначеЕсли Варианты.КоличествоРеквизитов = 5 Тогда
		Вариант = Новый Структура(Варианты.Реквизиты, Параметр1, Параметр2, Параметр3, Параметр4, Параметр5);
	ИначеЕсли Варианты.КоличествоРеквизитов = 6 Тогда
		Вариант = Новый Структура(Варианты.Реквизиты, Параметр1, Параметр2, Параметр3, Параметр4, Параметр5, Параметр6);
	ИначеЕсли Варианты.КоличествоРеквизитов = 7 Тогда
		Вариант = Новый Структура(Варианты.Реквизиты, Параметр1, Параметр2, Параметр3, Параметр4, Параметр5, Параметр6, Параметр7);
	КонецЕсли;
// BSLLS:NumberOfValuesInStructureConstructor-on
// BSLLS:MagicNumber-on	
	Варианты.Варианты.Добавить(Вариант);
	
	Возврат ЮТКонструкторВариантов;
	
КонецФункции

// Список вариантов.
// 
// Возвращаемое значение:
//  Массив из Структура
Функция СписокВариантов() Экспорт
	
	Возврат ЮТКонтекст.ЗначениеКонтекста(КлючКонтекста()).Варианты;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция КлючКонтекста()
	
	Возврат "ВариантыТеста";
	
КонецФункции

#КонецОбласти
